[
    {
        "resulNum": "1.",
        "title": "多變量卷積長短期記憶神經網路結合氣象資訊之太陽能發電預測模型",
        "link": "https://hdl.handle.net/11296/yx74p4",
        "description": "太陽能發電正逐漸成為台灣再生能源的一大主力，隨著其發電占比的增加，維持電網的穩定性上受到了一大挑戰，因此為了智慧電網的發展，太陽能發電量預測成為了一項重要議題。本論文數據集來自太陽能發電系統中監控的多個逆變器發電量資料，因此需要設計多變量時間序列預測模型。在使用傳統建模方法的情況下，可能產生過多的計算成本與難以學習數據的多變量依賴關係，因此本論文中使用深度學習模型，結合卷積神經網路與長短期記憶循環網路預測未來一天後的逐時發電量。利用卷積神經網路提取多時間序列的特徵，而長短期記憶神經網路同時預測出多變量結果。為了更準確的預測結果，我們使用數值天氣預報中的氣象資訊進行特徵選擇，並結合天氣特徵訓練模型，並進一步根據預測日降雨條件分別晴天與雨天模型，在實驗中顯示結合氣象資訊的方式能夠使進一步降低誤差。最後考慮到台灣地區南北地區的氣候狀況差異，評估包含多個不同地區的案場的實驗結果，驗證氣象資訊結合訓練能夠廣泛應用於台灣不同氣候的地區。"
    },
    {
        "resulNum": "2.",
        "title": "氣象參數應用類神經網路於太陽能發電量預測之研究",
        "link": "https://hdl.handle.net/11296/qycswf",
        "description": "因太陽能發電量預測易受天氣影響其準確度，如遇到極端天氣，傳統BP倒傳遞類神經網路因屬於靜態的類神經網路，意味著訓練出來的權重參數以及預測出來的結果是固定不變的，其太陽能發電量預測將發生很不準確的情況，為了改善這種狀況，勢必要對預測出的值做出修正，本文提出Elman神經網路訓練是動態的，所預測出的太陽能發電量可因應先前的資訊作相對應的修改，例如晴天和陰雨天的照度相差甚多，可利用對前一刻的資訊判斷出當天的天氣狀況，進而修正權重值，進而達到較為準確的預測。實驗結果顯示氣象參數(日照時數、日照率、日射量)與太陽能發電量間具有關聯性，再經由本論文使用Elman類神經網路預測，較一般傳統BP類神經網路預測，其平均絕對誤差MAE（Mean Absolute Error）準確度提高4.51%、均方根誤差(Root Mean Squared Error)準確度提高5.39%，故Elman類神經網路不論在模擬及預測結果上均接近實際值，未來可做為現行太陽能發電系統設計運用。"
    },
    {
        "resulNum": "3.",
        "title": "多元分散式發電系統結合氣象預測與動態對局模型電力調度之研究",
        "link": "https://hdl.handle.net/11296/5yw5pb",
        "description": "本論文提出以分散式能源為架構並整合了氣象局天氣資料與動態對局模型(Dynamic Game Model, DGM)應用於分散式電網電力調度之研究。使用可程式控制器(Programmable Logic Controller, PLC)與人機介面(Human-Machine Interface, HMI)建構以分散式能源為結構之分散式微電網電力調度，並使用Python程式語言連結至氣象預報資料下載三日內之天氣概況，根據天氣資料預估隔日發電量，並配合電力公司公告之時間電價與管理方案，進行各分散式電力調度。此外，因天氣的多變性，天氣資料可能隨時變動，本研究可隨時取得最新的天氣資料，應用動態對局模型，分配分散式能源現有之儲能，同時配合電力公司需量反應及需量競價措施，使電力系統在有需求時取得最經濟之電力，也讓各電源與負載之管理調度達到最佳化效益，並且增加電力公司之備載容量達到最佳電力調度。"
    },
    {
        "resulNum": "4.",
        "title": "彰濱海域的海氣象及發電特性分析",
        "link": "https://hdl.handle.net/11296/s25jb6",
        "description": "強勁的東北季風是台灣海峽天氣系統的一大特色。本研究將 2017及 2018 年台電海氣象觀測塔量測的風資料圖像化並進行風速與風向 的基本統計分析。搭配 Vestas V-164 9.5MW 風機的功率曲線進行彰 濱地區的風力與發電量分析，並計算出年發電量以及發電量在一個小 時內的變化量，呈現了東北季風雖強勁但是風速變化劇烈此一現象。 發電量的急劇變化對於電力調度方面是一大挑戰。風機工作狀態的時 間佔比與東北季風時期的發電量佔比呈現了東北季風可觀的風資源。 同時，海上浮球量測的波高資料也進行了快速傅立葉分析，並將其結 果與風資料的傅立葉分析結果進行比對，得到風與浪有三處共同的週 期性此一結論。颱風是台灣的另一個天氣特色。本研究使用了台電海氣象觀測塔 與固定式光達量測的梅姬颱風 (RSMC No. 1617) 風資料，計算其亂 流強度，並且與東北季風時期的資料進行比較，發現颱風的亂流強度 並未強過東北季風的亂流強度。北海擁有良好的氣候條件，為歐洲地區離岸風電發展的先進地區 本研究匯整了 KNW (KNMI North sea Wind) 於 FINO1 之風資料、 MERRA-2 於丹麥 Horns Rev 風力發電廠之風資料以及台電海氣象doi:10.6844/NCKU201900784觀測塔量測的風資料，進行發電量分析以及發電量波動分析，結果顯 示台灣海峽的東北季風發電量波動確實較北海地區嚴重。"
    },
    {
        "resulNum": "5.",
        "title": "以RSCMAC結合區域氣象資料為基礎之風力發電量預測",
        "link": "https://hdl.handle.net/11296/8vuz65",
        "description": "近年來，由於化石燃料藏量有限與溫室效應等環境變遷問題，迫使世界各國莫不極力關注並嘗試尋求解決之道，台灣身為世界社區的一份子，自是不能置身事外，其中發展再生能源便是方法之一。近年來，政府不僅通過再生能源條例，更全力推動再生能源產業，提出”千架海陸風力機計畫”。因風力屬於間歇性能源，隨著再生能源滲透率的逐漸攀升，若缺乏前瞻性的規劃設計與適當的運轉策略，勢必會影響電力系統供電可靠度與供電品質，並降低再生能源的使用率。若風機之輸出功率能被預測，則其電力就有可能調度或有其他策略來穩定併聯電網，本研究選定澎湖中屯風機公園為測試場址，公園內共架設8支德國ENERCON E-40 600kW風力發電機。為收集公園內之風速情形在周遭架設3組氣象監測站，並以回授最簡類化型小腦模型控制器(RSCMAC)為基礎，使用台電提供之澎湖中屯風力發電機監測系統資料與區域性氣象監測系統，開發三種不同的極短期(1小時)風機發電量預測模型。三種模型訓練及測試結果呈現優異的成果，展現模型的可用性及穩定性。未來此3種高準確度風機輸出功率預測模型，可提供區域電網風力發電之最佳調度，以達風力發電之最大使用效益，亦可提高風力機之裝置容量。"
    },
    {
        "resulNum": "6.",
        "title": "考慮氣象組合模型之風力發電機率預測研究",
        "link": "https://hdl.handle.net/11296/23xwgv",
        "description": "近十幾年來，隨著再生能源占比日益增加，為了降低電網的經濟成本並使其擁有一定的可靠性，「風力機率預測」成為問題決策的必要考量因素。機率預測與傳統決定性預測的最大差別在於機率預測會額外把預測的不確定性一起納入考量，而這對再生能源發電預測而言是相當重要的。本論文將先對幾種常見的機率預測做整理，並詳述這些方法的概念與預測方式。接著，本文整理評估機率預測的方法。最後，本研究提出非參數風力發電機率預測模型。此模型採用上下限估計法，從輸入資料中預測出可靠的風力預測區間；這些輸入資料包含風場的歷史風力與風速量測資料，以及台灣交通部中央氣象局所提供的20組數值天氣風速預報值。其中，上下限估計法中的參數是由電荷搜尋演算法調整而得。本文將用三個台灣實際風場的發電資料進行預測模型的比較。研究結果指出本文提出的模型皆能比持續法的模型有更佳的表現。"
    },
    {
        "resulNum": "7.",
        "title": "透過機器學習方法結合氣象與太陽軌跡變化之短期太陽能發電預測研究",
        "link": "https://hdl.handle.net/11296/fxz6q8",
        "description": "由於全球暖化、臭氧層破裂等環境議題逐漸浮出檯面，再生能源的產業發展與法規制度儼然已成為各國不得不正視與著手制定的一大政策。其中，太陽能再生能源產業對於位處副熱帶氣候且陽光充沛的台灣來說，具備高度發展前景，因此，準確地預測太陽能案場發電量的技術，將成為發電業者做案場控管與電力分配時的一項重要能力。本研究旨在探討機器學習方法在太陽能發電預測能力與績效之比較，並進一步進行不同時間型態資料集、參數組合、權重設定以及不同案場資料集的結果比對。尤其在不同參數組合中，氣象資料與發電、太陽軌跡變數與發電之間的相互影響，也於本次研究中進行了探討。最後，本研究基於此次實驗結果建立太陽能發電預測系統，期望能應用於實際太陽能案場上。本研究透過類神經網路、最近鄰居法及迴歸分析等機器學習預測方法，對太陽能案場進行發電預測與方法比較。實驗結果顯示，在眾多的影響變數中，太陽輻射值對於案場之發電預測具有最高的影響能力；在方法比較上，類神經網路預測績效普遍優於最近鄰居法的績效結果，但若能取得品值較高之太陽輻射預報資料，可以大幅改善最近鄰居法的預測結果。"
    }
]