[
    {
        "resulNum": "1.",
        "title": "以風速預測風力發電量-以彰工發電站為例",
        "link": "https://hdl.handle.net/11296/9j9xu3",
        "description": "再生能源涵蓋風力發電、太陽能發電、地熱能、生質能…等等，雖然很廣泛但是其中以風力發電及太陽能發電是目前最為推廣的方法，尤其在離岸風力發電上投入龐大的資源。然而風力會隨著地區、季節及天氣上的不同而有差異，使得風力發電量的穩定度也受影響，這樣不利於整體用電的調度，若是可以藉由氣象的資訊提前預測風力的發電量，可使得電力調度更靈活。本文以彰化彰工風力發電站的發電歷史資料及氣象局彰化縣西觀測站的氣象資料為依據，利用線性回歸方式，建立風速與發電量的多項式關係，探討利用風速值來預估發電量，發現基本線性迴歸、二次方程式及三次方程式之間差別較大，而三次方程式到五次方程式差別較小，也可看出風速的三次方的確與風的功率有關係。"
    },
    {
        "resulNum": "2.",
        "title": "多變量卷積長短期記憶神經網路結合氣象資訊之太陽能發電預測模型",
        "link": "https://hdl.handle.net/11296/yx74p4",
        "description": "太陽能發電正逐漸成為台灣再生能源的一大主力，隨著其發電占比的增加，維持電網的穩定性上受到了一大挑戰，因此為了智慧電網的發展，太陽能發電量預測成為了一項重要議題。本論文數據集來自太陽能發電系統中監控的多個逆變器發電量資料，因此需要設計多變量時間序列預測模型。在使用傳統建模方法的情況下，可能產生過多的計算成本與難以學習數據的多變量依賴關係，因此本論文中使用深度學習模型，結合卷積神經網路與長短期記憶循環網路預測未來一天後的逐時發電量。利用卷積神經網路提取多時間序列的特徵，而長短期記憶神經網路同時預測出多變量結果。為了更準確的預測結果，我們使用數值天氣預報中的氣象資訊進行特徵選擇，並結合天氣特徵訓練模型，並進一步根據預測日降雨條件分別晴天與雨天模型，在實驗中顯示結合氣象資訊的方式能夠使進一步降低誤差。最後考慮到台灣地區南北地區的氣候狀況差異，評估包含多個不同地區的案場的實驗結果，驗證氣象資訊結合訓練能夠廣泛應用於台灣不同氣候的地區。"
    },
    {
        "resulNum": "3.",
        "title": "氣象參數應用類神經網路於太陽能發電量預測之研究",
        "link": "https://hdl.handle.net/11296/qycswf",
        "description": "因太陽能發電量預測易受天氣影響其準確度，如遇到極端天氣，傳統BP倒傳遞類神經網路因屬於靜態的類神經網路，意味著訓練出來的權重參數以及預測出來的結果是固定不變的，其太陽能發電量預測將發生很不準確的情況，為了改善這種狀況，勢必要對預測出的值做出修正，本文提出Elman神經網路訓練是動態的，所預測出的太陽能發電量可因應先前的資訊作相對應的修改，例如晴天和陰雨天的照度相差甚多，可利用對前一刻的資訊判斷出當天的天氣狀況，進而修正權重值，進而達到較為準確的預測。實驗結果顯示氣象參數(日照時數、日照率、日射量)與太陽能發電量間具有關聯性，再經由本論文使用Elman類神經網路預測，較一般傳統BP類神經網路預測，其平均絕對誤差MAE（Mean Absolute Error）準確度提高4.51%、均方根誤差(Root Mean Squared Error)準確度提高5.39%，故Elman類神經網路不論在模擬及預測結果上均接近實際值，未來可做為現行太陽能發電系統設計運用。"
    },
    {
        "resulNum": "4.",
        "title": "多元分散式發電系統結合氣象預測與動態對局模型電力調度之研究",
        "link": "https://hdl.handle.net/11296/5yw5pb",
        "description": "本論文提出以分散式能源為架構並整合了氣象局天氣資料與動態對局模型(Dynamic Game Model, DGM)應用於分散式電網電力調度之研究。使用可程式控制器(Programmable Logic Controller, PLC)與人機介面(Human-Machine Interface, HMI)建構以分散式能源為結構之分散式微電網電力調度，並使用Python程式語言連結至氣象預報資料下載三日內之天氣概況，根據天氣資料預估隔日發電量，並配合電力公司公告之時間電價與管理方案，進行各分散式電力調度。此外，因天氣的多變性，天氣資料可能隨時變動，本研究可隨時取得最新的天氣資料，應用動態對局模型，分配分散式能源現有之儲能，同時配合電力公司需量反應及需量競價措施，使電力系統在有需求時取得最經濟之電力，也讓各電源與負載之管理調度達到最佳化效益，並且增加電力公司之備載容量達到最佳電力調度。"
    },
    {
        "resulNum": "5.",
        "title": "太陽光電發電系統台中及高雄區域發電量分析比較",
        "link": "https://hdl.handle.net/11296/jp7k7p",
        "description": "以中央氣象局氣象資料及監測平台發電資料分析，2018年及2019年度台中后里及高雄前鎮地區太陽能光電發電，受自然環境因子日照強度、降水量及降水次數、露點、最大陣風等4項發電量影響。利用敘述性統計及迴歸分析，進行研究探討分析。2018年度高雄前鎮案場日照強度高於台中后里案場4.77%，高雄前鎮案場發電量確低於台中后里案場2.77%。2019年度高雄前鎮案場日照強度高於台中后里案場5.36%，高雄前鎮案場發電量確低於台中后里案場1.18%。台中后里案場2018年11月2日至2018年11月30日，無降水量及無露點形成，期間RA值上升1.05%，高雄前鎮案場2018年11月12日至2018年12月30日，無降水量及無露點形成，期間RA值下降6.48%，RA值下降降低發電量。降水量的次數及累積降水量，台中后里案場2018、2019年度分別有7個月份相對高於高雄前鎮案場，在模組上清潔度方面來得理想，直接造成RA值上升提高發電量因素之一。台中后里案場在露點的形成上高於高雄前鎮案場2018年度達63日、2019年度達71日，證明在區域性露點形成，台中后里案場優於高雄前鎮案場。最大陣風影響發電量方面，台中后里案場最大陣風在時間區間內最大陣風最高值需大於9.3m/s及區間內最大陣風最高值與最低值差值需大於2.7m/s，才能有效提升RA值5.2%以上，可知最大陣風在台中后里案場對RA值呈上升趨"
    },
    {
        "resulNum": "6.",
        "title": "機器學習應用於風力發電量預測之研究：以彰工風力發電站為例",
        "link": "https://hdl.handle.net/11296/5d3uhd",
        "description": "近年來，地球已進入氣候緊急狀態(Climate Emergency)，牛津辭典將其列入2019年度詞彙之中。再生能源全面投入運行，將有機會讓氣候惡化逐漸緩和。在此情況下，再生能源科技浪潮帶動風力發電之發展，促使風力發電技術顯著改善，已在電力市場上扮演日益重要的角色。風力發電易受氣候與發電設備運轉影響，使發電有間歇性供電之狀況。這種間歇性不穩定及不易預測性，對電力供應及併入電網，恐影響供電品質及可靠度。為解決風力發電間歇性不穩定之影響，發電量研究及預測乃益顯重要。本研究之目的在界清影響風力發電之關鍵因素及建置未來24小時逐時發電量預測，並進行模型評估及調校，進而提高模型預測準確度。為了達成上述目的，首先本研究收集T電力公司2015年1月1日至2018年12月31日四年31支風力發電機數據，並結合氣象資料進行資料預處理，包含清洗及降維等。接著，用統計方法計算平均數、加總數及異常數據比重，並透過K-Means分為發電量高、中、低等三群，以發電量高群組中異常比重相對較低的第15號風機為研究分析之對象。再來，透過皮爾森相關係數(Pearson Correlation)、主成分分析(Principal Component Analysis)，進行風機之特徵篩選，取出影響發電量之8個高相關特徵，包含風機風速、風機輸電R相/S相/T相電流、風機發電機S相溫度及風機發電機定子溫度相位1/相位2/相位3等。然後，利用長"
    },
    {
        "resulNum": "7.",
        "title": "彰濱海域的海氣象及發電特性分析",
        "link": "https://hdl.handle.net/11296/s25jb6",
        "description": "強勁的東北季風是台灣海峽天氣系統的一大特色。本研究將 2017及 2018 年台電海氣象觀測塔量測的風資料圖像化並進行風速與風向 的基本統計分析。搭配 Vestas V-164 9.5MW 風機的功率曲線進行彰 濱地區的風力與發電量分析，並計算出年發電量以及發電量在一個小 時內的變化量，呈現了東北季風雖強勁但是風速變化劇烈此一現象。 發電量的急劇變化對於電力調度方面是一大挑戰。風機工作狀態的時 間佔比與東北季風時期的發電量佔比呈現了東北季風可觀的風資源。 同時，海上浮球量測的波高資料也進行了快速傅立葉分析，並將其結 果與風資料的傅立葉分析結果進行比對，得到風與浪有三處共同的週 期性此一結論。颱風是台灣的另一個天氣特色。本研究使用了台電海氣象觀測塔 與固定式光達量測的梅姬颱風 (RSMC No. 1617) 風資料，計算其亂 流強度，並且與東北季風時期的資料進行比較，發現颱風的亂流強度 並未強過東北季風的亂流強度。北海擁有良好的氣候條件，為歐洲地區離岸風電發展的先進地區 本研究匯整了 KNW (KNMI North sea Wind) 於 FINO1 之風資料、 MERRA-2 於丹麥 Horns Rev 風力發電廠之風資料以及台電海氣象doi:10.6844/NCKU201900784觀測塔量測的風資料，進行發電量分析以及發電量波動分析，結果顯 示台灣海峽的東北季風發電量波動確實較北海地區嚴重。"
    },
    {
        "resulNum": "8.",
        "title": "太陽能發電政策與空氣汙染對發電效益影響之研究 -以金門縣為例",
        "link": "https://hdl.handle.net/11296/7hux63",
        "description": "本研究旨在探討金門縣對於太陽能發電相關之政策，以及了解目前日益嚴重的空氣汙染現象，對於綠色能源的太陽能發電有無實際造成其發電效益的影響，瞭解空氣汙染與太陽能發電效益間之相關性。本研究以文獻分析法與資料蒐集法進行，透過行政院環境保護署空氣品質監測網、中央氣象局觀測資料查詢網站、環境感測平台「紫爆在哪裡」、個案之系統發電數據平台之相關資料進行比對與分析，其研究分析結果與結論如下：一、金門地區空氣汙染對太陽能發電效益影響並不顯著，可能原因金門當地並無大型或是嚴重產生空氣汙然源之產業，也無高山或盆地地形導致空氣汙然滯留或不易散去，且多為境外細懸浮微粒或臭氧八小時所導致的空氣汙染，會隨著時間與風向而逐漸散去，因此對於太陽能發電效益影響不大。二、太陽日照時間之長短對於太陽能發電效益具有關連性，金門地區3~5月間偶而會因為濃霧氣候導致太陽能發電效益稍差，但影響有限。雖然金門縣政府有提供太陽能發電系統安裝補助，但每年並沒有編列很多預算在這方面，且並無與銀行配合專案融資擔保貸款，導致許多想要裝設的民眾考量到要8~10年才能回本而有所顧慮，若能以低利息的專案貸款來分攤民眾初期建置的費用，可以大幅度提升安裝的意願。金門縣的太陽能熱水器裝機率全國第一"
    },
    {
        "resulNum": "9.",
        "title": "以資料探勘技術預測風力發電量之研究：彰工風力發電站案例",
        "link": "https://hdl.handle.net/11296/7z77eq",
        "description": "由於風機的建置成本昂貴及電力的不易儲存，若能依據本身居住環境之天氣變化預測風力發電量，電力市場上的利害關係人可以從中評估其安裝之價值，並且進行相關之電力決策。有鑑於此，藉由本研究之實驗結果提供利害關係人在風力發電的應用及建置中能有個不同的指標可供參考。本研究以台灣電力公司所提供的風力發電機數據作為研究資料，採用統計方法分析每台風機的發電量狀況，找出發電量異常之風機，並且探究季節轉換對於發電量是否有影響。另外，結合中央氣象局觀測資料查詢系統所提供的歷年氣象數據，依據不分季、季風與海陸風等天氣因素建立發電量預測模型，為了探討各演算法對於預測結果的影響，藉由隨機森林、支援向量迴歸、人工神經網路、最近鄰居法與線性迴歸等找出預測誤差最低之演算法，最後在使用演算法進行特徵選取，最佳化其結果。實驗結果發現，採用變異數分析三十一台風力發電機其平均發電量最低的5台風機，彼此間有顯著差異，可能是因為風機之架設位置或維修狀況等因素造成。並且，採用獨立樣本T檢定得知東北季風及海陸風時段其分析結果為顯著，意味著風力發電量的數值在此期間或許能得到更精確的預測。另外，風機編號5、風機編號26為最佳及最差預測結果，但是風機編號31其〖 R〗^2值小於0.9，故可以推斷"
    },
    {
        "resulNum": "10.",
        "title": "水力發電廠如何創造價值？--以日月潭水力發電系統之個案探討",
        "link": "https://hdl.handle.net/11296/fvbyq6",
        "description": "台灣的電業轉型引起水力發電是否具有盈利能力的爭議，啟發了本研究之動機與目的。過去國內有關水力發電之研究以技術導向為主，本研究以經濟價值面的角度切入，透過參考國外抽蓄水力發電相關文獻，以個案研究的方式深入探討台灣日月潭水力發電系統創造之價值，並參照工程經濟學原理進行整體營運成本效益分析估算，本研究結果發現：1.水力發電具有儲能套利、輔助服務、氣象資源有效利用以及溫室氣體與空氣汙染減量等四大價值。2.日月潭水力發電系統2016年潛在獲利能力相當可觀。3.水力發電未來發展趨勢將朝著再生能源儲能服務、可變速抽蓄發電以及微型水力發電等方向邁進。本研究並建議：1.未來計價模式發展，特別是能量費用應密切關注及參與。2.與調度中心保持密切合作，卻不過度依賴之關係。3.與國際技術領先企業建立合作交流關係。"
    },
    {
        "resulNum": "11.",
        "title": "以類神經網路預測民和國小太陽能發電系統發電量研究",
        "link": "https://hdl.handle.net/11296/8425g3",
        "description": "本研究以嘉義縣民和國小為例，擷取太陽能發電系統紀錄，設定發電量監測值為依變數（Dependent variable），另將香對應之主要氣象參數(例如風向、風速、溫度、溼度、氣壓等)資料等視為自變數（Independent variables），採用皮爾森相關係數法（Pearson Correlation Coefficient）方法及P值檢定法計算各自變數與依變數間關聯強度，再將關聯度最大之自變數配合以類神經網路（Artificial Neural Networks，ANN）方法，探討太陽能發電量預測模型之適用性。研究結果顯示，太陽能發電量與氣象參數之溫度及溼度間具關聯性；經將溫度及溼度參數配合太陽能發電量以類神經網路分析（ANN），應用於104年2月至5月各月份太陽能發電量訓練預測，確認各月份預測值接近實際值，顯示氣象參數與太陽能發電量間具有關聯性。而在後續使用訓練參數應用於104年6月至105年1月太陽能發電量之預測建模，不論在模擬及預測結果上，均接近實際值，驗證太陽能發電量與氣象參數間有一定之關聯度；未來可依據氣象參數預測太陽能發電量，作為現行太陽能發電系統設計及運用。"
    },
    {
        "resulNum": "12.",
        "title": "以RSCMAC結合區域氣象資料為基礎之風力發電量預測",
        "link": "https://hdl.handle.net/11296/8vuz65",
        "description": "近年來，由於化石燃料藏量有限與溫室效應等環境變遷問題，迫使世界各國莫不極力關注並嘗試尋求解決之道，台灣身為世界社區的一份子，自是不能置身事外，其中發展再生能源便是方法之一。近年來，政府不僅通過再生能源條例，更全力推動再生能源產業，提出”千架海陸風力機計畫”。因風力屬於間歇性能源，隨著再生能源滲透率的逐漸攀升，若缺乏前瞻性的規劃設計與適當的運轉策略，勢必會影響電力系統供電可靠度與供電品質，並降低再生能源的使用率。若風機之輸出功率能被預測，則其電力就有可能調度或有其他策略來穩定併聯電網，本研究選定澎湖中屯風機公園為測試場址，公園內共架設8支德國ENERCON E-40 600kW風力發電機。為收集公園內之風速情形在周遭架設3組氣象監測站，並以回授最簡類化型小腦模型控制器(RSCMAC)為基礎，使用台電提供之澎湖中屯風力發電機監測系統資料與區域性氣象監測系統，開發三種不同的極短期(1小時)風機發電量預測模型。三種模型訓練及測試結果呈現優異的成果，展現模型的可用性及穩定性。未來此3種高準確度風機輸出功率預測模型，可提供區域電網風力發電之最佳調度，以達風力發電之最大使用效益，亦可提高風力機之裝置容量。"
    },
    {
        "resulNum": "13.",
        "title": "考慮氣象組合模型之風力發電機率預測研究",
        "link": "https://hdl.handle.net/11296/23xwgv",
        "description": "近十幾年來，隨著再生能源占比日益增加，為了降低電網的經濟成本並使其擁有一定的可靠性，「風力機率預測」成為問題決策的必要考量因素。機率預測與傳統決定性預測的最大差別在於機率預測會額外把預測的不確定性一起納入考量，而這對再生能源發電預測而言是相當重要的。本論文將先對幾種常見的機率預測做整理，並詳述這些方法的概念與預測方式。接著，本文整理評估機率預測的方法。最後，本研究提出非參數風力發電機率預測模型。此模型採用上下限估計法，從輸入資料中預測出可靠的風力預測區間；這些輸入資料包含風場的歷史風力與風速量測資料，以及台灣交通部中央氣象局所提供的20組數值天氣風速預報值。其中，上下限估計法中的參數是由電荷搜尋演算法調整而得。本文將用三個台灣實際風場的發電資料進行預測模型的比較。研究結果指出本文提出的模型皆能比持續法的模型有更佳的表現。"
    },
    {
        "resulNum": "14.",
        "title": "透過機器學習方法結合氣象與太陽軌跡變化之短期太陽能發電預測研究",
        "link": "https://hdl.handle.net/11296/fxz6q8",
        "description": "由於全球暖化、臭氧層破裂等環境議題逐漸浮出檯面，再生能源的產業發展與法規制度儼然已成為各國不得不正視與著手制定的一大政策。其中，太陽能再生能源產業對於位處副熱帶氣候且陽光充沛的台灣來說，具備高度發展前景，因此，準確地預測太陽能案場發電量的技術，將成為發電業者做案場控管與電力分配時的一項重要能力。本研究旨在探討機器學習方法在太陽能發電預測能力與績效之比較，並進一步進行不同時間型態資料集、參數組合、權重設定以及不同案場資料集的結果比對。尤其在不同參數組合中，氣象資料與發電、太陽軌跡變數與發電之間的相互影響，也於本次研究中進行了探討。最後，本研究基於此次實驗結果建立太陽能發電預測系統，期望能應用於實際太陽能案場上。本研究透過類神經網路、最近鄰居法及迴歸分析等機器學習預測方法，對太陽能案場進行發電預測與方法比較。實驗結果顯示，在眾多的影響變數中，太陽輻射值對於案場之發電預測具有最高的影響能力；在方法比較上，類神經網路預測績效普遍優於最近鄰居法的績效結果，但若能取得品值較高之太陽輻射預報資料，可以大幅改善最近鄰居法的預測結果。"
    },
    {
        "resulNum": "15.",
        "title": "以複迴歸模型預測太陽光電發電系統之發電量",
        "link": "https://hdl.handle.net/11296/36bwn7",
        "description": "傳統太陽電池模型，必須藉由日照量及電池溫度來估算電池的發電功率。然而，在太陽光電發電系統尚未建置前，電池溫度並無法獲得，因此常常只以日照量來預測電池發電量，而於高溫時造成較大誤差。本論文利用複迴歸模型來預測太陽光電發電系統的發電量。迴歸自變數採用日照量、室外溫度及風速，這些是可以預先在氣象局獲得的長期逐時資料。測試結果顯示，本論文所提出的複迴歸模型其預測誤差可比單純使用日照量迴歸降低16.7%。"
    },
    {
        "resulNum": "16.",
        "title": "住宅用太陽光電發電系統發電效益與電能管理分析",
        "link": "https://hdl.handle.net/11296/sun8jn",
        "description": "全球原油價格不斷攀昇，進而危及經濟復甦。我國油電費雙漲，人民負擔更加沉重，發展綠能產業在全球各地正如火如荼進行。目前我國台電為防止夏季瞬間用電超過負荷，祭出超約罰鍰、節電優惠等措施。而太陽光電在日照數長的台灣特別適合使用，尤其是在夏季時可以減緩台電用電負荷。本研究以高應大再生能源館空中花園之8.16kWp太陽光電系統(簡稱本系統)為主要研究對象，就近五年量測資料探討分析再生能源館太陽能發電遮蔽前與遮蔽後之發電效率。遮蔽後較遮蔽前發電量減少43.6%，從中瞭解氣象變化(降雨量、日照時數)、設備運轉穩定性會影響太陽能發電，一般而言夏季比冬季發電量佳。並與臨近科工館作比較：本系統為8.16kWp，使用4組太陽能電池模組以高透光布紋白玻璃(有角度)封裝，搭配3台電力轉換器。而國立高雄科學工藝博物館設置10.26kWp市電併聯型系統，為仰角固定式系統。5並27串太陽能電池模組陣列之10kWp太陽能光電發電系統。並以1組具有最大功率追蹤（MPPT）15kWA直交流轉換器變流器。2009年平均發電量比高雄科工館太陽能發電系統年平均發電量多7.2%。從而瞭解太陽能模組、群組排列、建築物朝向、配合太陽作息，可以提高最大年發電量。另就發電成本、回收時程與二氧化碳減量一併討論之。本系統於2009年前，以當時我國太陽光電發電補助"
    },
    {
        "resulNum": "17.",
        "title": "風機發電量推估之不確定性分析-以中屯風力發電廠為例",
        "link": "https://hdl.handle.net/11296/txf68n",
        "description": "一般在推估風機發電量時，通常係以定值的風速資料或定值的風速分佈參數值推估發電量，但實際上在風速資料的觀測、風速分佈的套配與發電量的估算皆有不確定性存在，以定值無法完全表示其實際情況。故本研究利用蒙地卡羅模擬方法，結合各項影響風機發電量的因子，進行發電量不確定性的分析與驗證。本研究選擇了中屯風力發電廠與鄰近的澎湖氣象站評估模擬發電量是否符合實際發電概況，並將發電資料依時間長度之分為全年、半年強風期、半年弱風期與各月份，討論其模擬結果的不確定性。本研究同時也探討模擬次數對模擬結果的影響。而前人的研究尚未考慮平均風速的不確定性對發電量推估之影響，故本研究將之加入模式當中，並比較其差異。研究結果發現，當模擬次數達100000次時，會有較穩定之模擬結果。此外，考慮平均風速之不確定性會比不考慮平均風速之不確定性更為合理。各時期比較方面，全年、半年強風期、半年弱風期的發電量不確定性較低，強風期各月份的發電量不確定性次之，弱風期各月份的發電量不確定性最高。"
    },
    {
        "resulNum": "18.",
        "title": "最佳化技術在太陽能發電系統規劃之探討最佳化技術在太陽能發電系統規劃之探討",
        "link": "https://hdl.handle.net/11296/pv5bgd",
        "description": "本論文探討獨立式太陽能發電系統容量規劃問題，利用2008年台灣中央氣象局28個局設氣象站之實際日照量及溫度資料，分析比較於此28個氣象站架設獨立式太陽能發電系統的特性。本研究為長期規劃問題，規劃過程利用了拉格朗日方程式結合目標成本函數及限制函數求解最佳化值。太陽能發電系統的之年缺電時數當作系統可靠度時，利用多項式迴歸技術來求取此限制函數。論文中詳細分析，使用Matlab中solve、fsolve、fmincon及基因演算法求解最佳化問題造成之影響。另外亦探討當太陽能板與蓄電池的單位價格比及負載類型發生變動時，會對不同區域的最佳容量配置造成何種影響。相關結果可作為在台灣不同區域，建置規劃獨立式太陽能發電系統的重要參考。"
    },
    {
        "resulNum": "19.",
        "title": "建構台灣地區太陽能發電系統之發電量預測模型",
        "link": "https://hdl.handle.net/11296/w38288",
        "description": "電在人類生活中扮演著不可或缺的角色，而電能大多必須藉由化石燃料或鈾礦進行能量轉換所產生，這些資源在地球上的蘊藏量有限且分佈不均，且能源轉換為電力的過程中，會對於地球環境造成不少負面影響，有鑑於上述能源短缺與環保問題，太陽能、風力等再生能源發電的重要性逐漸提高，許多國家皆積極的推廣設置太陽能發電系統。然而，太陽能發電系統之轉換效率始終存在技術瓶頸，台灣雖位於太陽光能輻射豐富的地區，實際投入太陽能發電市場的廠商卻不如預期，主要的原因就是發電轉售的盈收不敷高昂的設置成本。因此，本研究分析台灣地區現有的太陽能發電系統資料，並建構一套發電量之預測模型，由於系統實際輸出的發電量，牽涉到地表日照量與系統轉換效率兩個因素，故本研究實際上是分別針對此兩因素建構預測模型，在系統轉換效率的部份，以各種系統規格做為解釋變數，應用遺傳規劃法（Genetic Programming, GP）進行預測；在地表日照量的部份，本研究搜集中央氣象局出版的氣候年報，以時間序列分析（Time Series Analysis）之成份分解法預測台灣各地區未來的地表日照量，最後整合地表日照量預測值、系統模組面積與轉換效率預測值，即可預測系統的發電量，且預測模型可程式化，只要輸入發電系統的關鍵變數與設置地區，即可得知系統在未來某一段時間內，正常運作下可輸出的發電量，一旦"
    },
    {
        "resulNum": "20.",
        "title": "水力發電廠多座水庫之排洪管理資訊系統整合─以大觀發電廠為例",
        "link": "https://hdl.handle.net/11296/b9887d",
        "description": "本研究以大觀發電廠所管轄三座蓄水庫的排洪管理為研究目標，利用原有硬體設備建立排洪管理資訊系統，協助值班人員計算各種排洪相關資料並且自動將資料儲存於資料庫，再利用應用軟體將資料轉換成報表以利資訊分享。本系統同時能讓硬體發揮最大功效，也一併解決特殊型號列表機已經沒有備品以及零件的問題。在硬體架構方面，以不變更原有建廠設計為原則，僅在原機組順序控制系統旁並聯一套可程式控制器(Programmable Logic Controller，PLC)作為監控系統，在擷取資料後直接傳送到控制室的PLC，經由企業內部網路在排洪管理資訊系統顯示以及儲存資料。本系統的規劃與設計是使用統一塑模語言(Unified Modeling Language，UML )作為分析工具，將使用者需求繪製成各種圖表，充分運用圖表進行分析、設計以及實作排洪管理資訊系統，以web型式提供不同需求的使用者共享資訊。本研究所開發的資訊系統其主要貢獻是在於颱風來臨時，以水庫水位、水庫蓄水量、發電用水量即時換算為水庫天然進流量，值班人員依此數據決定排洪模式，多一道互核機制可以防止人工洪水的發生。而且以電腦自動收集氣象、發電資料，可以直接提供工作人員記錄資料，不再需要人工抄寫記錄需要的時間，可以防止報表資料錯誤的發生。"
    },
    {
        "resulNum": "21.",
        "title": "考慮模糊風力發電模型之離島發電成本評估",
        "link": "https://hdl.handle.net/11296/vgvs85",
        "description": "本論文主要探討風力發電對澎湖離島地區發電成本之影響，為有效掌握澎湖離島地區用戶負載特性及其系統負載組成，以負載特性調查研究分析方法，推導住宅、商業及工業等類型用戶標準化負載模型，配合用戶資訊系統(CIS)售電資料，推估各類型用戶負載模型及系統負載組成，據以探討各類型用戶對系統尖離峰負載貢獻度。並探討溫度變化對系統負載之影響程度，根據統計學之方法，推估溫升後負載變化量及新的負載組成。由於風力發電風速的隨機性及不確定性，本論文以模糊模型來擬合風力機組風速與發電量的非線性數學模式。因此，本論文提出以模糊集合理論為基礎，建構一套模糊風力發電模型，依據當地氣象風速資料來推論風力機組發電量，將風力發電與柴油發電併聯整合於電力系統發電調度與運轉中，計算風力發電機組可取代之柴油機組發電成本。而負載特性調查所推估之電力系統負載需求，則是提供風力-柴油機組發電系統發電量依據。為驗證本論文所提方法的有效性及可行性，將以澎湖風力發電系統為例，應用當地2003年每小時風速資料，進行統計分析及電腦模擬。結果顯示風力發電，不但能經濟有效替代柴油發電成本，且具有部份淨尖峰供電能力。本論文研究之成果，希望藉以提供電業探討風力發電的能源效益及誘因參考，並且幫助評估風力發電在台灣發"
    },
    {
        "resulNum": "22.",
        "title": "澎湖近海發展離岸風力發電潛能之評估",
        "link": "https://hdl.handle.net/11296/nhbg6m",
        "description": "澎湖位處台灣海峽介於台灣本島與中國大陸，於每年夏冬兩季頻受颱風與東北季風的影響比本島來的強烈，且澎湖本島周圍海域地質相對本島單純也並無地理上的天然屏障，因此應是易開發離岸風力發電的絕佳場址。本研究目的為發展出可以預測未來時間風能模式的方法，掌握未來風速資料達到預測風能之功能，讓研究地區能夠及時做好因應措施，增加風力發電機即時運轉的效率等的安排。在本次研究中開發了一種即時的風速預測模型，用於即時預報未來 1、3、6、12小時內風速狀況。本研究主要包含人工智慧機器學習演算法的前饋神經網路、時間延遲神經網路等。由於風速資料為不連續資料，必須使用其他屬性資料一同進行相關性分析得以比較屬性資料間的相關性，因此本研究模式輸入資料主要有浮標風速和地面氣象觀測值作為模型輸入變量之一。本研究設計了兩個階段以實現風能預測。第一階段為資料處理階段，本階段為分別對各屬性資料進行相關性分析，以便了解逐時段最適合建立模型的屬性資料；在第二階段中，本研究進行風速預測模式建立，本階段再利用第一階段之最適屬性資料作為預測模式建模之基礎，再將之結合地面氣象資訊以建立風速預測模式。本研究之研究區域為離島澎湖地區之七美、東吉島及澎湖本島。本研究蒐集了 2002-2019年的"
    },
    {
        "resulNum": "23.",
        "title": "以氣侯觀測因子探討太陽光電系統發電量記錄可信度之研究 -以高雄國家體育場為例",
        "link": "https://hdl.handle.net/11296/a3w54q",
        "description": "近年來，政府的極力推動與民間踴躍參與，讓太陽能發電廠設施的建設與投資效益保證等相關議題受到重視。但國內大型PV 發電廠的發展歷程尚淺，設備的長期監控與維護問題未有明確管理方針，由長期發展觀之，這是確保發電效能的重要議題。換言之，太陽光電系統需要系統性驗證方法來確保設備的投資效益。影響PV 發電量的因子，除了系統相關組件，氣候觀測數據的運用尤為重要。因此，本研究是以高雄國家體育場為研究對象，經由氣侯觀測因子數據來探討太陽光電系統其發電量記錄可信度的問題。本研究已從系統發電量與氣象數據之間的關聯性比較來說明氣候觀測因子選用的適配程度比較方法，並以性能比(PR)指標來檢核發電是否異常以及其在長時間分析時的數值變化或趨勢的問題，最後提出PV 系統發電量推估參數可適用的相關數據。其中包含每日的、逐月的與全年的在數據之間的迴歸關係與判定係數(R2)比較。研究結果顯示：適配度高低是全天空日射量日照時數日間總雲量或日間降雨量日間降雨時數。PV 系統性能比變化約略呈現二段式階梯型改變，在2009~2013 年間各年平均PR 值為0.87；在2014 年後，各年平均值為0.802，衰退率約8%。太陽光電系統的每一峰瓩(kWp)峰值單位發電量(kWh/kWp)，若從十年平均的季平均變動範圍觀之，夏季(5~7 月)最高是4.21；冬季(10~1 月)最低是2"
    },
    {
        "resulNum": "24.",
        "title": "模擬風力發電預測模型",
        "link": "https://hdl.handle.net/11296/xckces",
        "description": "再生發電已是現今和未來的發展趨勢，然而要完全依賴再生能源發電依然有許多問題需要克服及排除，如供電的不穩定性。若並聯電網後，對於我國孤島型電力系統將會造成巨大的影響，因此在能源結構上的改變，除了要審慎評估電力系統需要儲備的容量，還必須考慮到再生能源發電可能的影響。為了能夠維持電力系統品質及穩定的前提下，還需要兼顧成本考量等因素，因此如何準確預測再生能源所提供的發電量這項課題，成了未來與整個電力系統合併發電的重點。本文主要目的是風力發電預測和預測的準確性，若未來要進行評估風力發電提供的發電量，其預測的發電量及準確性可作為整體電力系統中重要的參考。本研究以觀園風力發電站所提供之發電機第一機組資料作為研究基礎，並使用大氣水文資料庫和中央氣象局所提供的氣象資訊，包括大氣壓力、溫度與濕度，再利用空氣密度公式計算出當時的空氣密度。透過Matlab類神經網路的回歸預測模型來進行預測，此模型所設置的影響條件為風速、風向及溫度，並將其預測結果與實際資料進行分析比較，藉此來探討此模型的預測準確度。關鍵詞：風力發電預測、類神經網路。"
    },
    {
        "resulNum": "25.",
        "title": "運用機器學習方法預測風力發電量之研究",
        "link": "https://hdl.handle.net/11296/jj37nf",
        "description": "目前風力發電量預測的研究，依照輸入資料欄位區分，分別是只用風力發電量輸入資料欄位的時間序列預測；使用風力發電量與氣象資料當作輸入資料欄位的多變項預測。目前的風力發電量預測研究鮮少同時使用時間序列預測與多變項預測兩種，本研究將會使用時間序列預測與多變項預測，並比較兩種模型預測的結果。本研究主要是預測風力發電量，將風力發電量與氣象資料作為研究資料並建立實驗資料集。使用實驗資料集訓練時間序列與多變項等兩種類型的預測模型。其中，時間序列模型包含ARIMA及深度學習(MLP、RNN、LSTM、GRU與TCN)等六種方法；多變項模型包含VARMA及深度學習(MLP、RNN、LSTM、GRU與TCN)等六種方法。時間序列模型實驗結果為： ARIMA比較適用於資料集的時間間隔較小的；深度學習方法則比較適用於資料集的時間間隔較大的。多變項模型實驗結果為：VARMA在【發電量、風速、風向】資料集的表現最好，隨著「溫度」與「氣壓」的加入，表現越來越差；深度學習方法則無論在哪一種資料集皆有不錯的表現。兩種模型績效評估結果為：以前三名而言時間序列方法多變項VARMA的績效比ARIMA的績效好；深度學習方法多變項模型的績效比時間序列模型的績效好。在風力發電量預測上，多變項模型的預測結果比時間序列模型的好。"
    },
    {
        "resulNum": "26.",
        "title": "時間卷積神經網路在風力發電預測的研究",
        "link": "https://hdl.handle.net/11296/g885zt",
        "description": "隨著石化燃料發電造成全球溫室效應日趨嚴重，導致環境與氣候遭受強烈的衝擊，甚而危及生存安全，因此世界各國紛紛投入綠能之開發謀求改善全球暖化問題，研究發現風力發電具有很高的開發潛力，但若要獲得穩定供電則需有賴於精準的風力發電預測。對風力發電預測而言，從理論上，使用基於統計的預測模型來準確預測風力輸出和天氣變化是很困難的；在實踐中，傳統的機器學習模型可以進行長期風力發電預測，但其平均絕對百分比誤差(mean absolute percentage error, MAPE)為10%~17%仍無法滿足可再生能源項目的工程要求。深度學習網路(deep learning networks, DLN)使用多神經網路架構和梯度下降算法來獲得氣象特徵與發電之間的相關性，可以最大限度地減少估計誤差，這在風力發電預測領域具有廣泛的適用性。時間卷積網路(temporal convolutional network, TCN)模型具有因果卷積層(causal network)、擴張卷積(dilated network)與殘差連接(residual connection)結構是深度學習技術的一種模型，研究證實TCN對於序列資料處理或預測具有優異的效能。因此，本研究旨在探討TCN模型在風力發電預測的效能以及其最佳模型參數的選擇。研究結果顯示運用差分進化演算法可以快速獲得最佳TCN模型參數，且在土耳其Scada的一年歷史數據進行提前24-72小時風力發電預測，其MAPE皆小於5.55%可以滿足工程需求，最後，比較四種基於DLN的預測模型性能，即TCN、長短期記憶(long short-term memory, LSTM)、遞迴神經網"
    },
    {
        "resulNum": "27.",
        "title": "基於RSCMAC的澎湖中屯風力發電機組功率預測",
        "link": "https://hdl.handle.net/11296/e5f946",
        "description": "本論文之目的為採用小腦模型控制器結合風力發電機發電與氣象監測站之資料，預測中屯風機群的發電狀況。本論文風機地點選用中屯風機公園中8支風機來進行三種不同資料，結合回歸型最簡類化型小腦模型控制器(Recurrent simple addressing structure for Cerebellar Controller with General Basis Function ,RSCMAC)為基礎之預測模型建立。一為僅採用風機群監測資料的模型訓練與測試，二為氣象監測站的模型訓練與測試，三為風機群與氣象監測站的模型訓練與測試。在訓練時會將相關資料分散存於RSCMAC之各個記憶體中，之後於預測時再整合輸出。在學習時輸出值會與目標值比對，將誤差值回傳，進行各記憶體之修正，重複循環學習直到學習完成，在單使用風機群資料結合RSCMAC訓練後與目標值相比之絕對誤差在4%以內，而使用風機群使用經過訓練之模型測試後與目標值相比之絕對誤差在5%以內，使用氣象監測站結合RSCMAC訓練後與目標值相比之絕對誤差在7.5%以內，而使用氣象監測站使用經過訓練之模型測試後與目標值相比之絕對誤差在9.5%以內，而風機群與氣象監測站結合RSCMAC訓練後與目標值相比之絕對誤差在4%以內，而風機群與氣象監測站使用經過訓練之模型測試後與目標值相比之絕對誤差在10.5%以內。以本計劃所得到的結果來看，風機群的方法可以用在更加廣域的風場上，這更可以大幅提升，電網上的電源調度，也間接的提升風力發電"
    },
    {
        "resulNum": "28.",
        "title": "基於深度學習預測太陽能未來3天之光伏發電量",
        "link": "https://hdl.handle.net/11296/yn36sd",
        "description": "本研究透過三種演算法:類神經網路(ANN)、長短期記憶模型(LSTM)和門控循環單元(GRU)，利用氣象局資料、當地微氣象站資料以及混合型態資料(結合氣象局和當地微氣象站資料)當作輸入，楊梅案場太陽能板提供的光伏發電量當作輸出，去做太陽能未來三天之光伏發電量的預測並且做預測精準度的比較，目的為預測太陽能近期的發電量以利提供更有效地區域能源調度。本研究輸入的特徵包括溫度、相對溼度、降水量、平均風速以及紫外線指數，透過模型參數的調整找出預測效果最好的模型。研究結果顯示，使用GRU預測氣象局資料以及混合型態的精準度會最好，使用LSTM和GRU預測當地微氣象站資料會有相似的表現，但考量到訓練的時間，本研究會採用GRU做預測模型；而比較三種資料的預測精準度，使用微氣象站資料的效果會最好，其預測精準度分別為MAE:0.0577、RMSE:0.1199、MAPE:20.76%，主要是因為微氣象站缺失的資料比其他兩種資料少，其中MAPE的接受範圍根據Lewis [29]指出本研究的MAPE值介在21%-50%的合理範圍內。與其他文獻做比較後，可以發現本研究利用ANN預測的結果，MAPE會比Rehman和Mohandes [5]研究太陽能輻射線的結果為大；而利用LSTM和GRU預測的結果，MAE以及RMSE會比Bendali 等人[15]研究短期太陽能輻射線的結果為大，主要原因是本研究的資料來自於不穩定天氣並且資料量不足所造成。"
    },
    {
        "resulNum": "29.",
        "title": "應用類神經網路預測發電廠周圍細懸浮微粒及臭氧濃度",
        "link": "https://hdl.handle.net/11296/n538nc",
        "description": "根據2020年統計燃煤占發電量的36%，表示臺灣燃煤發電量仍為高占比，而典型預測空氣品質模式包含高斯類擴散模式、軌跡類模式與網格類模式等，本研究以機器學習中的類神經網路(Artificial Neural Network, ANN)整合分析環保署固定污染源連續自動監測設施資料(Continuous Emission Monitoring Systems, CEMS)、環保署空氣品質監測資料、中央氣象局氣象觀測資料，用以預測鄰近三座台電電廠(林口、台中、大林)每日的細懸浮微粒與臭氧濃度並探討預測結果。蒐集2019至2020年林口、台中、大林電廠之固定污染源每小時排放數據(包含氮氧化物及二氧化硫)，林口、沙鹿、小港空氣品質監測站之每小時空氣污染物數據(包含二氧化硫、二氧化氮、一氧化碳、臭氧、細懸浮微粒及懸浮微粒)與林口、梧棲、鳳森氣象觀測站之每日大氣數據(包含溫度、氣壓、濕度、風速及風向)等參數，將前述資料彙整為日平均值導入以Python語言程式建構的ANN模型中作為輸入參數，輸出參數為細懸浮微粒(μg/m3)與臭氧(ppb)，決定係數(Coefficient of determination, R2)、均方根誤差(Mean Square Error, MSE)與絕對平均誤差(Mean Absolute Error, MAE)用以評估模型表現，隱藏層神經元試誤後，結果得出細懸浮微粒與臭氧分別使用22個與23個隱藏層神經元有最佳的預測表現，再將數據分區建立模型，保留訓練與驗證時連接層與層之間的最佳權重值，用以預測2021年1月至3月的細懸浮微粒與臭氧濃度。以ANN預測每日細"
    },
    {
        "resulNum": "30.",
        "title": "太陽能發電量估算策略之研究",
        "link": "https://hdl.handle.net/11296/3a97d7",
        "description": "政府近年來積極推推動能源政策，將於2025年之電力配比分別為20%再生能源、30%燃煤機組以及50%燃氣機組，有80%發電機組不易到氣候因素影響本身發電出力，但太陽能發電會因氣候條件影響，而影響本身發電，加上因傍晚太陽下山形成鴨子曲線，如何能精準掌握其未來個小時發電，以準備未來時段配合太陽光電發電安排相關水、火力機組來應付其所需系統負載為非常重要的課題。本論文首先了解太陽能發電與太陽能板對太陽傾角、方位等關係，並研究如何運用歷史太陽能光發電資訊及北、中、南氣象溫、濕度資料，運用群聚分析概念找出相同氣象因子之發電曲線，以彌補無法取得太陽能光電各案場之靜態資料(如安裝地點、傾斜角等)，藉由傳統氣象資訊找出最適條件，藉此估算未來24小時之發電曲線，以期降低估算誤差，對於太陽能發電所形成鴨子曲線能夠即時掌握，以期能提供調度運轉參考。"
    },
    {
        "resulNum": "31.",
        "title": "考慮多種數值天氣預報及資料前處理程序之風力發電預測研究",
        "link": "https://hdl.handle.net/11296/v22u44",
        "description": "風力發電是間歇性能源，因此會導致電力系統的可靠性和穩定性產生負面影響，準確的風力預測是目前最有效的解決方法，與確定性預測相比，機率性預測可以提供有關風能不確定性的資訊，有助於降低電網的運行與維護成本，並大幅增加電力系統的可靠性。目前許多研究利用數值天氣預報（NWP）與風能的歷史資訊進行風力發電的預測，但忽視了資料前處理的重要性。本論文利用台灣中央氣象局（CWB）獲得的三種不同的數值天氣預報數值進行時間序列組合，與福海氣象塔真實資料進行比對，挑選出最佳的時間序列。接著利用常見的訊號前處理方法：主成分分析與經驗模態分析，突顯出數值天氣預報的特徵，最後使用台灣澎湖縣的湖西風場提供的風力發電站資料以及三種不同的數值天氣預報進行決定性預測與機率性預測，利用兩種預測模型分別是極限梯度提升決策樹(XGBoost)與人工神經網絡（ANN）進行比較與分析。在機率預測模型方面皆採用是上下限估計法，此方法可直接從輸入資料中直接預測出50-90%的預測區間(PI)，研究結果指出本文提出的預測模型在極限梯度提升決策樹(XGBoost)與人工神經網絡（ANN）皆能有良好的表現。"
    },
    {
        "resulNum": "32.",
        "title": "離岸風力發電機維護運轉成本最佳化",
        "link": "https://hdl.handle.net/11296/ey83w7",
        "description": "當今全球暖化的加速，再生能源的發展顯得相當重要，我們所即將面臨能源短缺的危機，在台灣擁有世界上風況最好的20處離岸風場，其中臺灣海峽即占16處，且加上政府推動發展離岸風電產業，有機會搶攻亞太市場，在全球快速發展風力發電的情況下，未來20年將進入風機運轉維護的重要週期，運轉維護工程將帶來龐大的商機。而一個好的風場，最重要的任務是要能有效的發電，供電後所產生的盈餘是任何一個風場，所要達到的最大目標，然而在風機建置完成後，往後20年的維護與營運工作將是一個風場最大的關鍵，其中運轉維護成本占整個離岸風場的15~20%，有效降低運轉及維護成本及規劃出最佳維運策略將是風場管理者最關心的議題，因此本研究探討影響離岸風力發電機發電量之因素包含到港距離、海氣象條件、風機可靠性等重要影響因子，並探討在符合各項作業安全的條件，且考量風機效能的狀況下，進行海上維護作業，以彰濱外海海氣象資料進行研究，以單日維護模型建構、三日維護模型建構、評估調整後維護模型建構進行離岸風力發電機維護運轉成本最佳化求解，以達離岸風力發電機維護運轉成本最佳化。研究結果顯示，在資源充分的情況下，選擇單日維護模型進行維護將為最佳的選擇方案，而選擇三日維護模型將有機會降低船租成本，但同時也可能須承擔其他因素"
    },
    {
        "resulNum": "33.",
        "title": "浮動式離岸風力發電機可維運天候週期分析之研究",
        "link": "https://hdl.handle.net/11296/st6w9j",
        "description": "隨著近岸海域風場即將完成開發，下一階段的離岸風場開發將往更大水深海域。當離岸風場建設開發往更大水深海域時，基於風能開發建設成本效益考量，離岸風場開發建設及後續維運成本將關係著風場開發成效，浮動式風力發電機將取代固定式風力機成為下階段的風機型式，且風場可可維運天候次數(長短)也是關鍵性的一環。緣此，本研究以浮動式離岸風力發電可維運天候分析作為研究的主題，探討以臺灣第三期風場開發為情境的假設，進行假定風場之歷年風向、示性波高等氣象資料的分析評估。研究之進行，以美國國家海洋暨大氣總署(NOAA)，並利用NOAA大氣模擬資料，與中央氣象局的新竹浮標資料進行比對分析，顯示模擬結果與觀測資料呈現高度相關及可信任性，可以在成本較低的條件下，應用在天候窗評估分析上，重現目標場域的長期資料。後續再以情境區塊作為假設，利用英國Rounds 1 and 2的開發經驗，以四種作業環境限制條件下，推估該假定風場出24、48、72小時可連續工時增加下，除了在4~8月可執行連續工作的機率較高外，其餘月份在東北季風來臨時，機率是較低的。"
    },
    {
        "resulNum": "34.",
        "title": "啟發式最佳化方法為基礎的太陽光電系統發電推估之研究",
        "link": "https://hdl.handle.net/11296/qn7p86",
        "description": "太陽光電是易於受周遭環境影響的發電系統。太陽輻射除了會因為地球運轉軌跡改變之外，遇到多雲的天氣，會擾動得更為劇烈，由於太陽能的自然時變特性，使得太陽光電發電量預測成為維持電力系統穩定度的重要課題。根據官方統計資料，台灣近年來太陽光電系統的裝置容量不斷增加，尤其是民營獨立發電廠的成長率。在整體電力系統管理上，台電公司目前仍是一個上下整合與獨佔發、輸、配電三大資源的公司，對於不同型態負載用戶有提供可靠電力能源的義務。依照目前國家政策的推動方向，當太陽光電發電量逐漸大到擁有影響穩定供電之關鍵能力時，若無法精確預測太陽光電發電量，或發電量可以即時傳送至調度中心進行監控，可能導致電力系統運轉的風險與成本大幅升高。本論文從資料收集與處理的基本工作開始進行推估模型的建置研究。大量數據來自於實際運轉的太陽光電廠發電紀錄及中央氣象局開放資料網的氣象資料，透過統計方法將資料轉換成為資訊，首先建置起一組推估短期太陽光電發電量的多元迴歸模型，依照統計檢定來評定模型之可信度與擬合度，同時確認影響發電量推估的較關鍵因素，以簡化後續研究的問題維度。此迴歸模型的殘差項符合常態、恆等與獨立的三大特質，證明模型已經擁有解釋系統發電量的能力。再者，利用取得的太"
    },
    {
        "resulNum": "35.",
        "title": "基於機器學習和相似日方法的短期太陽能發電量預測",
        "link": "https://hdl.handle.net/11296/g96vu3",
        "description": "隨著近年《再生能源發展條例》修正，再生能源邁向自由化，雖然為民營業者提高了售電的自由度和議價能力，但同時也意味業者必須自行準備儲能設備以及電網調度計畫，其中即包含了發電量預測；過去有研究以歷史相似日的輻射量作為預測輻射量，然而在挑選相似日的方法上仍存在部分缺陷，本研究提出一種改進的相似日方法，透過對複數相似日取樣，減輕因為相似日判別錯誤而產生的輻射量和發電量誤差；實驗證明改進的方法可以降低 10% 的輻射量預測誤差（正規化日均方根誤差）和 5% 的發電量預測誤差；在基於氣象服務預報判斷天氣類型的架構中，本研究集成 3 種服務的結果，以不同預報服務的互補性減輕預測誤差，平均可以降低 1~3% 的發電量預測誤差（正規化日均方根誤差）。"
    },
    {
        "resulNum": "36.",
        "title": "低成本全自動化太陽能清潔機器人設計及智慧型太陽光電發電短期預測",
        "link": "https://hdl.handle.net/11296/46vhwg",
        "description": "臺灣規劃於2025年建置20GW太陽光電發電系統、6.7GW風力發電系統及推動其它再生能源建置以達到再生能源占總發電量20%目標。然而2021年5月臺灣皆於傍晚時間發生兩次大停電，除了人為疏失、氣候變遷及離峰用電日漸遽增因素外，與太陽光電發電系統夜間無法供電及其他發電機組啟動併網需要數小時時間有關，顯見太陽光電發電效益及短期發電量預測與經濟電力調度息息相關。本文主旨在於設計一低成本全自動化太陽能清潔機器人以確保太陽光電發電效益，並研製一智慧型太陽光電發電短期預測機制以精確掌握每小時太陽光電發電量。由於太陽光電發電原理是藉由陽光照射在太陽光電板進而吸收光能使之發電，當太陽光電板因髒污使得陽光無法完全照射到太陽光電板上時，容易導致發電效率降低。當前唯一能解決該問題的方式，即是擬定相對應的清潔計畫，定時清潔可以有效的去除太陽光電板上的髒汙，使太陽光電發電系統的發電效益維持在一定的水準之上。本文提出一新型太陽能清潔機器人，以低成本且全自動化為目標，不反覆搬運太陽能清潔機器人來降低施工危險性及增加清潔便利性，清潔人員只需要在安全處準備清潔相關設施，透過手機及開關即可遠端對太陽能清潔機器人下達控制命令以達到完整清潔效果。本文所提出太陽能清潔機器人之機"
    },
    {
        "resulNum": "37.",
        "title": "台灣西部海域離岸風力發電選址自然災害風險評估之研究",
        "link": "https://hdl.handle.net/11296/nf92v6",
        "description": "隨著經濟不斷發展，近幾年來受到全球暖化的影響日益加劇，對此環保意識逐漸抬頭，而聯合國永續發展目標亦有多項指標對於環境保護有所規範。考量到國外再生能源發展之技術成熟性及台灣本島地狹人稠等諸多特性，離岸風力發電為永續能源之最佳選擇。政府政策亦朝前揭目標邁進，全力推動離岸風力發電。目前台灣離岸風場之選址主要以風能密度作為考量，對於該場址自然災害所造成的風險較無著墨。為此，本研究將以空間資訊之技術，結合美國航空暨太空總署現代研究應用回顧分析之風力資料、中央氣象局-臺灣海域各地浪高週期波向觀測月統計資料、台灣地震危害度分析之475年回歸期的機率式地震危害度分析資料、台灣電力公司落雷監測歷史資料，首先對於台灣周圍地區之自然災害，利用專家問卷，以模糊層級分析法解算出離岸風力發電機各部件所受到自然災害之影響程度，綜整上述數據，最後建立起台灣西部海域離岸風力發電自然災害選址風險評估模型，以供後續選址規劃之使用。本研究之成果，各零件機組受自然災害影響比重，發電機、轉子葉片、轉子機頭皆受到風力影響的程度最高；塔受到地震的影響程度最高；變壓器受到雷擊的影響程度最高。而就風機整體而言，風力被評定為最具威脅之自然災害，其次為雷擊、海浪、地震。本研究成果針對各"
    },
    {
        "resulNum": "38.",
        "title": "應用深度學習於太陽能發電量預測",
        "link": "https://hdl.handle.net/11296/bbmkv4",
        "description": "隨著生活品質的提高及產業的成長造成用電量的逐年增加，對電力網的負荷也逐漸加重。近年來由於《前瞻基礎建設特別條例》的施行，為落實能源轉型，政府規劃再生能源發電佔比將於民國114年達總發電量之20%，現行太陽能發電中存在著瞬間時變率變動大供電問題，屆時太陽能發電設備迅速增加併網對於現在及未來電力供應的穩定性將會是一個必須克服的難題。本研究使用新式方法找尋循環神經網路最佳輸入過去數據量，並使用小波閥值去噪作為預處理方式。太陽能發電量預測使用CNN-RNN-DNN複合模型，使用Hyperband演算法找尋最佳超參數設定，並運用TensorRT加速該模型。輸入資料為台灣中部電廠變流器實際所記錄數值，並將鄰近自動氣象站量測值與自製時間參數合併輸入模型，針對十分鐘至兩小時多個時段太陽能發電量預估上探討，各時段99%預測誤差可於6.7%內，可提供電力調度人員作為重要參考依據。本研究可搭配邊緣運算預測架構實地部署，並提出未來電力公司可使用之更準確、更節能的預測架構，與現有方法相比能有效降低運維費用、減少全國停電損失、用戶用電效率提升效益，以謀求人類共同福祉。"
    },
    {
        "resulNum": "39.",
        "title": "車流量及發電對空汙的影響力分析",
        "link": "https://hdl.handle.net/11296/9xy8xb",
        "description": "空氣污染對健康產生的不良影響已經引起多數人的關注，空污形成的原因很多，擴散的範圍也很廣泛，除了季風所引起的境外汙染，境內汙染也是影響的因素之一，而在境內汙染中交通影響尤為重要，此外發電及氣象也是影響的要素。對於空汙的模型分析，若只著墨於大氣模型，對於政策上的措施較為被動，且要素的選擇不夠全面，本研究主要的研究目的是透過大數據的機器學習方法，將發電和交通一起與氣象納入其中，從而探討發電量與交通量對空污PM2.5影響因子的敏感度，藉由分析逐步減少各汙染源以達到較理想PM2.5數值的環境條件。研究結果先透過逐步廻歸的方式篩選較為重要的條件，使用剩下來的參數建立模型後，將交通、發電各自的條件因素透過敏感度分析，所欲分析的PM2.5數值以環境條件逐步10%百分比遞減，從0%至100%所有預測組合的PM2.5數值挑選最低的前110組繪製成條件熱圖，清楚了解若想降低PM2.5數值最有成效，需往哪些變數調整並且調整範圍大概坐落何處，最大化經濟效率的同時也兼顧環境的保護。在此研究的基礎上，能繼續發展使用有關時間因素的LSTM深度學習模型，預測未來參數的數值，再結合本研究模型與手法，以未來參數變化程度對未來的空汙數值影響，能預先防範類似空汙指數紫爆的風險。關鍵字：空氣汙染、機器學習、敏感度分析、車流量及發電"
    },
    {
        "resulNum": "40.",
        "title": "應用機器學習預測太陽能案場發電量",
        "link": "https://hdl.handle.net/11296/8jq27z",
        "description": "預測太陽能案場發電量能夠幫助案場管理者制定各種決策。目前大部分的研究都只關注於數分鐘到數日的短期發電量預測，而由於中長期氣候的不可預測性與資料量不足的問題導致中長期發電量預測的研究少之又少。因此本研究透過美國國家航空暨太空總署（NASA）提供近30年的每日輻射資料擴增案場資料解決資料量不夠的問題，並應用類神經網路以及支援向量迴歸等機器學習方法建構台灣太陽能案場隔年發電量的預測模型，然後比較持久性模型、類神經網路以及支援向量迴歸之預測績效。實驗結果顯示使用NASA資料來擴增訓練資料能有效提升預測模型績效，並且發現使用歷史資料年數越多時預測績效越佳。而在短期發電量預測中，天氣分類已被證明能夠有效提升隔日發電量預測績效，但是台灣氣象機構沒有提供歷史天氣類型。因此，我們提出一個方法透過K-means可以自動標註歷史資料的天氣類型以便進行後續的天氣分類與發電量預測，並使用晴空輻射優化天氣分群方法。首先，在自動標註天氣類型中，使用晴空輻射處理的案場輻射來做分群績效比使用原始案場輻射還要優。第二，透過使用卷積神經網路預測隔日天氣類型績效優於支援向量機與類神經網路。第三，使用轉換的一年中的第幾天（DOYT）能夠提升預測隔日發電量績效。第四，透過天氣分類的預測發電量"
    },
    {
        "resulNum": "41.",
        "title": "使用長短期記憶人工智慧方法預估分散式太陽能系統發電之研究",
        "link": "https://hdl.handle.net/11296/5j9448",
        "description": "為了有效利用太陽能發電與確保電力品質，本研究利用Python程式語言，採用日照度、溫度等氣象數據，搭配分散式太陽能發電系統發電成果，配合機器學習中由遞歸神經網路（RNN）衍伸而來的長短期記憶（LSTM）演算法，進行太陽能發電預測模型的訓練與測試。LSTM透過三個控制記憶的機制，分別為Input、Output與Forget Gate，使機器學習透過太陽能發電紀錄與氣候資料自主學習三個閥門的開關，由此決定長短期記憶的權重並判斷哪些資料是雜訊，特別適合具時序關係之物理量估測。相關演算法特性與邏輯、數據的取得與預處理方式與太陽能發電預測模型的訓練與測試結果將會加以說明，並比較透過不同的參數設定或方法分析其所造成的影響，例如：LSTM方法、RNN方法、輸入與輸出的時間步長、一次性多步預測與漸進式預測…等，最後提供1到10分鐘的短期預估成果並加以討論，最後探討訓練決策方法與實際應用的可行性。"
    },
    {
        "resulNum": "42.",
        "title": "市電併聯型太陽光電發電系統之優化模擬分析",
        "link": "https://hdl.handle.net/11296/38p5r4",
        "description": "本論文使用 PVSyst 太陽光電模擬軟體，對位於新竹市香山區裝置容量 93.025kWp併聯型太陽光電發電系統進行分析及模擬，並使用 Solidworks 及 Sketchup 3D 建模軟體繪製 3D 圖，再帶入 PVSyst 中以完成進階遮蔭模擬分析，將實際監測日照強度及溫度帶入 PVSyst 軟體中以模擬發電量，再與實際發電量比較及計算誤差百分比。本文也探討不同傾斜角與方位角對太陽光電系統發電量的影響，以達到優化的目的。對於實際案場依現行躉購費率作經濟效益分析，以計算出太陽光電發電系統的回收年限。本文並針對鈍化射極與背面電池技術、半切片及多柵線三種不同製程的太陽能模組作發電量分析，以探討模組製程的發展方向。PVSyst 太陽光電模擬軟體使用內建氣象資料模擬結果，全年發電量與實際發電量誤差平均值約-11.6%，使用實際日照數據帶入模擬軟體，模擬發電量與實際發電量平均誤差百分比降為-4.58%。本文探討不同傾斜角與方位角對發電量的影響，得出其最佳發電量之傾斜角為 15.3 度，太陽能模組架設於正南為最佳，其年發電量為 118.23MWh。使用 PVSyst 太陽光電模擬軟體之經濟效益分析，得出本案場回收年限約為 8.6 年。對於不同製程太陽能模組發電量分析結果，多柵線太陽能模組優於半切太陽能模組及 PERC M4太陽能模組，2020 年一月到五月平均發電量多柵線模組優於 M4 模組百分比為 3.59%。半切片模組優於 M4 模組百"
    },
    {
        "resulNum": "43.",
        "title": "太陽能發電出力快速間歇變動下系統頻率變化之研究",
        "link": "https://hdl.handle.net/11296/47mxpy",
        "description": "再生能源發電於我國電網中的發電佔比逐漸增長，政府規劃於2025 年設置太陽能發電系統達20 GW，風力發電達5.7 GW，再生能源發電將佔整體發電量的20 %。由於再生能源間歇性的發電特性，過高的發電佔比將對電力系統穩定度、電力品質及發電機組調度造成影響，因此，即時電力調度必頇納入輔助服務。太陽能發電大量導入系統後，雲遮效應造成太陽能發電量快速變化，對系統穩定度的衝擊無法忽視，而因應太陽能發電的瞬時變化特性，需有快速反應(毫秒~秒)備轉容量之輔助服務。本論文即針對雲層厚度對太陽輻射量的影響，及風速對太陽能發電造成的輸出功率變化，進行研究，以期進而解析該種快速變化現象對系統穩定度的衝擊。由於台灣本島的氣象資料暨輸電線路與發電機組資料，數量龐大，不易取得，因此，本研究以金門電力系統為模擬測試對象，使用PSS® E 軟體，在假設太陽能發電量佔比20 %的情況下，對於不同的雲遮效應，探討太陽能發電出力瞬時變化對於系統頻率的影響，以作為未來本島快速反應及調頻備轉容量評估之參考。"
    },
    {
        "resulNum": "44.",
        "title": "風場資料分析與年度發電量評估",
        "link": "https://hdl.handle.net/11296/x9c76q",
        "description": "摘　　要以本文澎湖風力發電站的風速與發電資料，年發電量可以達到18.765百萬度，探討風速特性與風機發電量的相關性。分別利用各月份時間解析度1分鐘、5分鐘丶30分鐘及1小時的風速資料與原廠的風機功率曲線來估算發電量，與風機實際總發電量比較，並探討其差異，也比較各月份的風速機率分布與所擬合的韋伯函數的差異，來呈現風在不同月份的特性。至於年度發電量的評估，本文比較了風速資料統計的風速機率分布、所擬合的韋伯函數與實測的逐時風速資料，分別在參考原廠功率曲線及擬合功率曲線的情況下估算的年度總發電量，並分析這些結果之間的差別。同時，引入容量因數和正規化平均輸出功率，進行最佳效率的分析，以探討如何隨風場特性的不同來選擇最合適的風機。分析結果顯示，不同解析度風速估算結果的誤差小於4 %，顯示利用氣象局的每小時的風速資料也足以用來評估不同月份的發電量。韋伯函數分布與實際機率分布的比較，指出冬天風速會較集中出現於某些速度區，而春、夏季節風速則較隨機出現。另外，分析顯示在只有原廠功率曲線可參考的情況下，無論使用風速資料統計所得的風速機率分布或所擬合的韋伯函數來估算，都可獲得準確可靠的年度發電量，而且發現最佳效率的額定風速比平均風速大約多3m/s，這可作為風機選擇的參"
    },
    {
        "resulNum": "45.",
        "title": "小型風力機發電性能之研究",
        "link": "https://hdl.handle.net/11296/46325u",
        "description": "台灣海峽擁有全球最佳的風場，平均風速約12~10m/s，十分適合發展風力發電，在2011年政府推動的「千架海陸風力機」計畫，政府規劃新能源政策目標於114年提升再生能源發電比例至20 %，以構安全穩定、效率及潔淨能源供需體系，邁向2025年非核家園。本文將建置一風力發電模擬動力平台，依據多年在國立澎湖科技大學風車公園收集到的風力氣象資料作為資料依據，模擬研究風力發電機在各種風速下之性能特性曲線，藉此找出各轉速下最佳功率，並與戶外實際測量數據比較，以找出面對澎湖風場下時，該如何設計與改善小型風力發電機，以達到有效降低風力發電機損壞及改善發電效率之可行性。"
    },
    {
        "resulNum": "46.",
        "title": "全天空日射量資料應用自動化機器學習建立太 陽能發電量預測模型用於成本效益分析之研究- 以市電併聯型為例",
        "link": "https://hdl.handle.net/11296/n9txj5",
        "description": "過去相關太陽能發電系統成本效益分析研究中，在年發電量評估方式中大部 分是使用歷史日射量數據評估。因此，本研究嘗試撰寫網路爬蟲將中央氣象局歷 年日射量與日照時數統計資料抓取並應用 Google Cloud Platform AutoML 建立迴 歸分析模型，並與實際案場年發電量比較，研究發現其評估的發電量與實際案場 發電量數據相當接近，將此發電量評估方法應用於市電併聯型太陽光電系統之成 本效益分析能得到客觀的估算結果。另將發電量預估數據實作成網頁版成本效益 分析軟體，讓建置者可以簡易且快速地進行成本效益分析。最後與經濟部能源局 試算網頁作分析比較差異，供讀者評估要使用何種方式分析。"
    },
    {
        "resulNum": "47.",
        "title": "大型太陽光電發電系統之模擬與性能驗證",
        "link": "https://hdl.handle.net/11296/t648xq",
        "description": "本文使用PVsyst模擬軟體，分析及驗證972.3kWp及499.8kWp兩個大型太陽光電發電系統的發電性能，其中972.3kWp案場位於湖口，499.8kWp案場位於麥寮。PVsyst模擬所需要的氣象參數是以模擬軟體內建的氣象參數及案場實際監測的氣象參數進行模擬，模擬結果再與實際發電量、發電性能比值計算誤差百分比，以瞭解模擬值與實際值之差異，藉以修正模擬參數及作為系統設計之參考。本文以現行躉購費率及太陽光電發電系統建置成本完成經濟效益評估，以計算太陽光電發電系統之回收年限。經過PVsyst模擬的結果，972.3kWp案場在簡易設置條件下，以實際氣象參數模擬發電量誤差百分比為0.944%，以內建氣象參數模擬發電量誤差百分比為0.989%，加入3D模型圖後，以實際擬氣象參數模數發電量誤差百分比為0.736%，以內建氣象參數模擬發電量誤差百分比為2.901%，499.8kWp案場在簡易設置條件下，以實際氣象參數模擬發電量誤差百分比為-0.591%，以內建氣象參數模擬發電量誤差百分比為-3.161%，加入3D模型圖後，以實際氣象參數模擬發電量誤差百分比為0.071%，以內建氣象參數模擬發電量誤差百分比為-4.407%，兩個案場皆是以實際監測氣象參數的模擬結果較接近實際的發電量，本研究結果可作為太陽光電發電系統設置及性能評估之參考。"
    },
    {
        "resulNum": "48.",
        "title": "太陽能板積塵 對發電效率影響分析",
        "link": "https://hdl.handle.net/11296/53mfk8",
        "description": "本論文主要是探討積塵對太陽能板發電效率影響之研究，灰塵是廣泛存在於大氣中的微粒，太陽能板表面灰塵顆粒的沉積會嚴重影響太陽能板發電效率，導致發電效率降低，減短太陽能板的使用壽命。為分析太陽能板表面灰塵分佈情況，本論文採用離散元法建立灰塵顆粒與太陽能板間的力學模型，並針對不同太陽能板傾角、風速及風向等條件下，模擬分析太陽能板表面灰塵分佈情況。此外，為量測室外太陽能板表面灰塵積塵程度，本論文利用可程式自動化控制器(Programmable Logic Controller, PLC)與PM Designer圖控軟體，設計一套微型氣象站及積塵自動偵測平台來實測實際積塵情況以驗證模擬結果，比較模擬結果與平台上量測到灰塵顆粒分佈情形，得到相當接近的結果。後續並模擬1個月及3個月無雨無清洗情況，以分析最嚴重積塵的分佈情形。最後選擇兩組位於同一地方且具有相同氣象條件的2kW太陽能發電系統進行實驗，透過兩組太陽能系統發電量的對比實驗，分析積塵對發電量造成的影響。"
    },
    {
        "resulNum": "49.",
        "title": "基於SVM之風力發電預測",
        "link": "https://hdl.handle.net/11296/n4xm92",
        "description": "再生能源的間歇性發電問題，經常造成供電的不穩定，且未來當大量再生能源發電併聯電網後，對於我國孤島型電力系統勢必造成很大的影響。然而，隨著我國能源結構的改變，未來在評估電力系統所需要儲備的容量時，必須考慮到再生能源發電可能造成的影響。因此，如何準確預測再生能源之發電量，對系統來說影響非常大，在能夠維持電力系統品質及可靠度的前提下，又能兼顧成本考量，相信是一項相當重要的課題。本文主要目的是針對風力發電預測的準確性，能增加預測的準確性相當重要，供未來在評估風力發電量時在電力系中的佔比作為參考。本研究以觀園發電站所提供之發電機資料為研究基礎，並使用由大氣水文研究資料庫所提供的氣象資訊，包括了溫度與濕度，在利用空氣密度公式，推導出空氣密度，透過支持向量機中的分類與迴歸來進行風力發電量的預測。先透過EXCEL主觀分類與SVM(Support Vector Machine)比較其中差異，在模型方面分為風速風向與風速風向溫度濕度，在案例方面有全年，非夏季與夏季。爾後將模擬結果分析比較，探討非夏季與非夏季和全年在訓練與驗證方面的準確度。關鍵詞：風力發電預測、支持向量機。"
    },
    {
        "resulNum": "50.",
        "title": "含儲能系統住宅型太陽光電發電系統之分析及實例探討",
        "link": "https://hdl.handle.net/11296/7kwth2",
        "description": "本論文旨在分析及探討含蓄電池儲能系統之市電併聯型太陽光電發電系統，利用 HOMER Energy套裝軟體對小型智慧型電網模擬與實測驗證，針對台灣北部地區住家安裝4.88kWp太陽光電發電系統及2.4kWh儲能系統，採用HOMER Energy套裝軟體及其內建的氣象資料，探討一般家庭設置太陽光電發電系統加裝儲能系統，在正常情形下的購、售電分配及負載間之電能調度，藉以瞭解系統最佳配置之淨現值成本、每度電用電成本及投資成本所需之回收年限。本文之研究可提供民眾欲安裝住家型太陽光電發電系統時最佳配置及設計決策之參考。以桃園某住家為例，探討自用的發電系統，依現場環境估算可安裝的太陽光電發電系統及蓄電池容量，若市電停電，太陽光電及儲能系統仍可繼續運作，以達不斷電系統的功能。本文研究加入現行能源成本及環境參數，利用HOMER Energy套裝軟體實施模擬，可提供一般設置者參考。"
    },
    {
        "resulNum": "51.",
        "title": "太陽能發電建置效益評估",
        "link": "https://hdl.handle.net/11296/39wk55",
        "description": "我國缺電逐漸嚴重尤以北部地區因人口及經濟、商業區繁忙因此缺電更為嚴重。目前反核聲浪逐漸重視核安問題，政府鼓勵新能源政策經濟部能源局在中華民國107年01月08日頒布最新能源躉售購電方案。本文考慮能源局最新躉售購電價標準分為北部(苗栗以北、宜蘭、花蓮加成15%)及南部。本論文探討太陽能發電系統設置與評估效益，主要分析探討太陽能電池安裝相關儀表設備及發電量。本文利用氣象站之實際日照量及溫度資料，用以評估設置太陽能系統之依據，可做為太陽能發電量參考資料並以最新躉售購電價標準估算回收之電價以評估建置效益。本論文以三種方案評估效益：1.不考慮折舊率。2.考慮折舊率。3.融資利息攤平的回收效益。由研究成果顯示北部地區回收較慢。南部地區回收年限早。關鍵字: 躉售購電、太陽能光電發電系統、折舊率、融資、效益"
    },
    {
        "resulNum": "52.",
        "title": "建構氣象資料監視系統",
        "link": "https://hdl.handle.net/11296/pvqax3",
        "description": "　　空氣污染的問題一直存在於各個國家中，環保署之下各氣象局做自動化儀器監測各氣象資料己有數年。但各氣象站從溫度，濕度到空氣品質等所測得的資訊提供的皆是整體大範圍的數值，在小區域的氣象資料準確度上難免有落差。而台灣近年來的空氣污染的問題除了從中國大陸的空污甚至霾害漂洋過海，也有台灣本地的工業區因為密集生產而產生的空氣汙染。甚至因為車輛密度高排放的廢氣多，再加上政府政策因提倡廢核提高火力或天然氣發電的發電量，其在燃燒發電的過程產生的污染物包含了懸浮在空氣中的微粒子PM2.5或PM10與其他污染物（SO2,NO2,CO,O3等）。　　氣象站的大範圍偵測可以取得大區域的整體結果，但使用微型氣象監視系統監視其小區域的氣象資料配合環保署本身的資料應可以提升小區域氣象的準確度。本論文提出使用ESP8266來監視氣象資料的變化，利用此氣象監視系統持續監控氣象相關資訊並回報到使用者手機或提供給使用者由web查詢。"
    },
    {
        "resulNum": "53.",
        "title": "開發雲端監控平台於太陽光電系統之發電預測",
        "link": "https://hdl.handle.net/11296/6ucu46",
        "description": "近年來，再生能源的探勘與開發正如火如荼地展開。根據我國經濟部能源局之能源產業技術白皮書揭露預計在2025年再生能源佔總發電量20 %。這反映了再生能源將對電力系統的穩定性造成潛在的衝擊。由於分散式電源(DER)的多樣性和多重的電力供應，因此分散式電源彼此間的資訊整合變得更加複雜。目前的太陽光電站點僅以單一控制器儲存太陽光電資訊，將造成大量資訊儲存問題。此外，於私人網域傳輸資訊，將造成網路資訊安全以及能源管理問題。在這種情況下，一種基於IEC 61850可延伸訊息與存在協定(XMPP)雲端平台創新的物聯網(IOT)架構分散式電源管理系統被提出。本文依照IEC 61850-7-420建置PV模型並依IEC 61850-8-2藉由XMPP協定架構將PV資訊上傳至雲端並可視化PV發電資訊。應用倒傳遞類神經網路於太陽光電系統之發電預測。透過中央氣象局所發佈之天氣預報資訊進行神經網路模型之分類訓練。根據預測結果得知，應用此一方法能使發電預測之誤差下降為平均絕對百分比誤差(MAPE)20 % ~ 50 %之範圍，有利於提升PV發電預測之精準度。"
    },
    {
        "resulNum": "54.",
        "title": "以機器學習預測太陽能發電量：龍井太陽能電廠案例",
        "link": "https://hdl.handle.net/11296/adz3e9",
        "description": "太陽能發電系統容易受到外在天候變化因素之影響，相對於傳統、大規模集中式發電的方式更具不穩定性，因此預測就顯得更加重要，透過精準的預測太陽能發電量並預為妥善因應，將可降低其不穩定性的衝擊影響。而本研究之目的在於透過準確的太陽能發電量預測結果，提供當地電力用戶、再生能源發電業者與電力公司有可以參考的科學數據。本研究使用台中龍井地區太陽能發電量資料以及中央氣象局觀測資料查詢系統之開放資料，選取時間範圍為2015年至2017年止，共三年之歷史資料，首先藉由變異數分析、獨立樣本T檢定等統計方法來分析台灣四季與乾溼季的變化對太陽能發電量之影響程度，其次透過支援向量機、倒傳遞類神經網路和隨機森林等演算法建立太陽能發電量預測模型，接著使用最小絕對壓縮挑選機制進行天氣變數的特徵選取，以找出與太陽能發電具有關聯性之天氣變數，並比較三種演算法之預測準確度優劣。最後藉由敏感度分析來探討模型的訓練資料與測試資料之比例是否會影響模型的預測準確度。實驗結果發現，在四季與乾溼季氣候方面，經由統計分析之後，其結果為春季、夏季與乾溼季之氣候變化對太陽能發電量具有顯著性影響，然而秋季與冬季之間的氣候轉換，對於太陽能發電量的影響性則不顯著。在太陽能發電預測模型方面，夏季之"
    },
    {
        "resulNum": "55.",
        "title": "探討大漢溪流域供水及發電之氣候變遷衝擊與調適",
        "link": "https://hdl.handle.net/11296/54k4bc",
        "description": "　　近年來，在全球氣候變遷下，氣象異常、降雨時空分配不均，且開發新水源較困難的情形下，使得既有水庫的有限水源更顯珍貴。此外，水庫淤積造成有效蓄水量逐年降低，水庫操作供水難度提高，影響水庫之供水與發電功能，因此如何管理有限的水資源，增進水資源有效利用，達到水資源最佳化調配逐顯重要。而過去往往只針對單一水資源課題進行研究，但在人口壓力、都市化等因素下，日漸重視水、糧食、能源三者彼此間的依存關係，期望透過分析不同部門之間的關連性以及交織的節點，提出一個全面性且可操作的政策來解決所面臨的問題。因此本文以大漢溪流域所含涵蓋之桃園地區為研究區域，配合VENSIM建置水資源供水系統動力模式，模擬石門水庫之操作運轉，同時考量水-糧食-能源鏈結之相關性，探討桃園地區在未來氣候變遷下對水資源供需情況及發電量之衝擊，分析不同的調適政策下之缺水風險，並討論對糧食及能源可能造成的影響。　　水庫供水系統模擬結果顯示，現階段尚可滿足需求水量，但隨著目標年需水量逐年增加，以及氣候變遷情況下，缺水指標顯示缺水風險有上升的趨勢，增加新水源亦或增強多元化水源供給仍是未來不可忽視的問題；而水力發電在氣候變遷的情境下有減少的趨勢，由於水力發電主要為電力系統尖峰負載之調整，若未來水力發電量減少，而尖"
    },
    {
        "resulNum": "56.",
        "title": "利用多種MCP法於彰化地區離岸風場風能與最高發電量預估之研究",
        "link": "https://hdl.handle.net/11296/h385ey",
        "description": "台灣地小人稠，陸域風場開發有其很大的限制條件。相較於陸域風場，台灣之離岸天然風場具有相當豐富的風力資源且尚未被開發，具有潛在的高度開發價值。但如何獲得更可靠的台灣西部海域風能估算數據，以利後續台灣西部離岸風場之實質開發更顯重要。台灣海峽的地理位置得天獨厚，根據國際研究機構調查，台灣沿海地區風力平均密度超過750 W/m^2，特別是常年風速高達每秒7公尺以上，是世界上少見的高品質風電場。這其中以彰化離岸風電場為最，其面積達2,300平方公里，蘊藏4 GW龐大風電容量，屆時，彰化離岸風電場將可提供480萬戶的全年用電量，占全台風力發電量的56%。一個離岸風力發電場投資開發動輒百億至千億，場址的風能評估就顯得格外重要，它會是一個投資獲利關鍵。台灣離岸風力發電處於剛起步的階段，目前對於彰化風場的風能的研究亦不多。因此，本論文的研究目標為利用多種MCP(Measure Correlate Predict)模擬方法於彰化地區離岸風場進行風能與最高發電量預估，本研究有別於衛星觀測或數值模擬風能方式，利用台電公司剛建置完成海氣象觀測塔搜集之風能資料，我們使用多種MCP法，來迴歸彰化風場十年的風能資料，藉以更精確客觀分析出彰化場址風能及預估計算風場發電量。"
    },
    {
        "resulNum": "57.",
        "title": "建置太陽能發電系統之財務分析",
        "link": "https://hdl.handle.net/11296/bvg42r",
        "description": "2011年福島核災，再次喚起核能安全問題，政府推出非核家園的願景，積極推廣再生能源，透過FIT電能躉購機制、陽光屋頂百萬座及綠能屋頂全民參與等政策加速推展。近十年全球低利環境及再生能源躉購制度之施行，為太陽光電系統業者提供了合理的利潤。此外，太陽能建置成本亦逐年降低，使投資太陽光電系統成為當前值得探討之投資途徑。筆者任職金融業，面對新能源公司向銀行尋求資金支援，對於業者投入龐大的建置成本後，其發電效能是否真如其所預期，為其帶來利潤並保障銀行還款來源，實值得探討，因此興起研究本議題之念。本文利用淨現值、內部報酬率、還本期間及獲利指數等方法，以裝置容量為499瓩之屋頂型高效能太陽能發電系統為研究對象，將台灣北到南到東，分12個地區進行財務分析，利用蕭子訓、黃孔良及張耀仁(2017)所蒐集2004年至2016年間中央氣象局全天空日射量資料，以此資料評估各地發電量，並依其資料進行敏感性分析。發現台灣各地區於正常發電情形皆適合投資建置太陽能發電系統；於敏感性分析部分，發現遜於正常發電、發電效能加速遞減及折現率、融資利率提高等之情形下，基隆市不適合建置太陽能發電系統；另南部較北部適合建置太陽能發電系統，而北部苗栗因躉購價格加成下亦屬適合建置地區。另於正常發電及敏感性分析之5種情境下"
    },
    {
        "resulNum": "58.",
        "title": "大型水平軸風力發電機於非定常風場中之動態分析",
        "link": "https://hdl.handle.net/11296/6rmb4e",
        "description": "• 在此研究中主旨在於開發，一個有助於風力發電機設計，加速改進或了解一新水平軸風力發電機的數值計算方法，此方法不同於傳統藉由實驗或是經驗公式，找出風力機的轉速後，才可進行數值分析，而是基於直接於ANSYS Fluent 求解器，進行流體-固體耦合計算，並記錄葉片轉子六自由度物體運動性質。• 葉片的轉動性質可藉由 ANSYS Fluent 求解器中，開啟使用者定義函數，使得動態網格隨著流場性質而被動的運動，再藉由使用Excel 及Tecplot 軟體，對所自動記錄的網格運動性質進行後處理，來了解風力機自靜止到達最大穩定轉速過程中的各種轉動性質隨時間的變化。• 為了計算機械能的輸出，及驗證各風速下最大角速的大小，分別使用了動量理論與葉片元素理論，並運用Q-blade 風力機設計工程軟體，進行驗證。• 本研究挑選Grumman Windstream 33 水平軸風力發電機，最為研究對象 ，並參照原始測試報告，設定10、15、20、25、30、35 英里每小時的六種風速作為數值計算的邊界條件，同時也參考各氣象研究，假想一個具14%震幅，具4 或8 秒周期的餘弦函數的，暫態風場，對此方法對的時間響應狀況進行測試。結果分為轉動性質與發電預測兩部分• 轉動性質:• 各項轉動性質(角速度、角加速度)之間都呈現相似性極高的現象• 最大角速度在各週期之內呈現極佳的線性分布，在不同的周其風速中具有1:1.14 的比例關係• 發電預測:• 動量理論在10-25"
    },
    {
        "resulNum": "59.",
        "title": "太陽能發電系統設置區位研究",
        "link": "https://hdl.handle.net/11296/44yzxr",
        "description": "依據經濟部能源局統計，臺灣99.35%的能源必須仰賴進口，進口能源易受到能源短缺及價格波動影響，國內能源供給難以穩定，因此有必要推動再生能源發電的設置，經濟部能源局於2016年提出「太陽光電2年推動計畫」，目標於2018年達成太陽能光電1.52GW設置量，相關單位亦釋出使用率較低之土地提供發展太陽能光電使用，並逐步推動大規模地面型太陽能光電系統的設置，以提升國內能源自主性並降低環境的迫害。太陽能發電系統的發電量主要受自然環境及氣候狀況影響，本研究以中央氣象局觀測之日照時數統計資料，建立臺灣地區日照時數分佈情形，可見日照量由北向南遞增，以南部地區較具發展潛力，並透過地理資訊系統，與釋出作太陽能光電發展基地疊圖分析，探討政策之合理性、基地的適宜性及發展潛力。國內太陽能光電的開發，仍有用地取得或生態保育問題，目前非都市土地開發審議規範業增修相關要點，但開發時效仍受法令限制及環境保育等課題影響，本研究進一步探討開發中之太陽能光電專案，皆尚有生態保育、地理環境等議題尚須克服。"
    },
    {
        "resulNum": "60.",
        "title": "以資料探勘技術預測太陽能發電與需量反應方案之整合應用",
        "link": "https://hdl.handle.net/11296/seve48",
        "description": "電力，是現代生活不可或缺的要素。台灣近十年的發電結構，主要仍是以火力發電為主，其次為核能。然而近年來環保意識抬頭，非核家園的概念生成，隨著核一廠的發電機組即將除役，台電在供電吃緊的情況下提出需量反應方案，鼓勵電力高壓用戶抑低尖峰與減少用電。除此之外，台灣開始尋求再生能源的發展，其中，發展太陽能發電是最積極、直接的手段。若是能將兩者結合應用，便能創造虛擬電廠的概念，產生更高的雙贏價值。因此，本研究的重點在於使用太陽能預測之發電量、太陽能發電統計量與減少用電方案之計算公式，整合成一高壓電力用戶選擇方案之系統。高壓電力用戶可以衡量本身之作業特性，以簽訂之契約容量、用戶之必要用電需量與基準用電容量等變數做為系統之輸入變數，系統便可分析抉擇出該用戶最具效益之減少用電方案。然而，若電力用戶得出最佳結果為需量競價措施，便可利用太陽能發電預測系統，預測隔日發電量，進而評估隔日是否要進行需量競價。本研究以台中某太陽能科技公司提供之太陽能發電數據與觀測資料查詢系統CODiS中的過去氣候資料作為研究資料。經由資料預處理從太陽能發電數據與過去氣候數據建立太陽能發電預測模型，並根據四季、不分季與不同之氣候型態作為區分，進而選出最佳之預測模型在模型建立上使用時間序"
    },
    {
        "resulNum": "61.",
        "title": "含儲能設備小型再生能源發電系統之情境規劃及經濟效益分析",
        "link": "https://hdl.handle.net/11296/sjvx42",
        "description": "各國過度使用化石能源造成的全球暖化及極端氣候問題，開發潔淨的再生能源已成為必要且刻不容緩的事實。臺灣為亞熱帶海島型氣候國家，其日照及風能條件非常充足，非常適合再生能源發電系統開發。但由於再生能源之初始建置成本較高，以及臺灣各地太陽能及風能的資源分佈不同，如何善用各式費率手段或有效配合儲能設備的設置，利用經濟誘因影響民間投資設置再生能源發電系統之意願，持續刺激再生能源的成長，將是十分重要的推動模式。利用一套混合太陽能模組、風力發電機與儲能系統之市電併聯式小型再生能源發電系統，本論文研究各式不同費率情境下，如何在臺灣各地設計出最佳的再生能源發電系統配置狀況，並探討其系統運轉後之經濟效益。利用包括二段/三段式時間電價及再生能源躉購費率兩種主要費率，以2016年實際在台灣、日本、美國、英國及德國實施使用的費率當作測試情境，另外並考慮了五種負載模式進行模擬測試，包括學校實驗室、餐館、住宅、醫院、旅館，探討此市電併聯式混合小型再生能源發電系統的最佳配置。運用各式費率情境下的經濟誘因，有效調節控制儲能系統之充放電時機，可以提昇系統經濟效益減少建置再生能源發電設備的成本收回年限。使用了台灣中央氣象局26個局屬氣象站整年度之實測逐時風速、日輻射量"
    },
    {
        "resulNum": "62.",
        "title": "以資料探勘方法預測台灣地區太陽能發電量之研究",
        "link": "https://hdl.handle.net/11296/kku833",
        "description": "太陽能發電等再生能源隨著非再生能源的消耗日益重要，但如何決定優先建造的太陽能裝置的地點呢？透過一些高精密的儀器的測量結果，可以用來衡量一個地點是否適合太陽能發展，但其高精密儀器耗費太高，因此可以透過預測的方式，作為判斷一個地點是否適合發展太陽能的根據。本研究利用太陽能發電量數據與氣象局網站資料，資料時間範圍從2015年1月1日到2015年12月29日，經過合併資料、篩選變數、建立多個預測模型，利用類神經網路與支援向量機等演算法，多次反覆訓練模型，並調整隱藏層神經元個數與核函數，藉此找出預測台灣太陽能發電量的最佳模型。研究結果發現使用類神經網路預測台灣地區太陽能發電量較為準確，並且從原先十六個變數中，去除影響程度較低、資料取得困難的變數，最後十個變數的模型7(MAPE: 12.25%)有最佳預測結果。同時期盼台灣能有更多的太陽能發電量數據與其他外在因素、氣象資料，以便能有更加精準的模型與預測結果。"
    },
    {
        "resulNum": "63.",
        "title": "建置太陽能發電系統之效能影響因子與成本效益研究",
        "link": "https://hdl.handle.net/11296/w78d2k",
        "description": "本研究探討台灣地區太陽能發電潛力和經濟規模可行性，考量未來若要廣泛應用太陽能源，除了公家機關、各級學校、體育場館、農雞舍、廢耕汙染農地等場所之外、太陽能發電系統勢必大量建置於家庭供電，因此本研究之案場來自選定地點的小型家庭式太陽能發電系統。此類發電系統主要由太陽能電池模組與直流接線箱組成，若要為交流負載供電，還需要配置交直流電轉換器、交流盤及電表箱等。研究中使用的降水量、日照時數、全天空日射量(MJ/m2)、能見度和其他氣象數據，來自氣象局及環保署觀測站之網站。研究發現，由太陽能電池模組可產生的理論發電度數與實際監測到的發電度數的比值約為85~90%，若發電衰減率以1%計算，以此估計小型家庭式太陽能發電系統約8~9年可以回本，平均年投資報酬率約為10.8%，以目前經濟環境不甚理想的大環境下，推廣建置家庭式太陽能發電系統應是很好的時機。"
    },
    {
        "resulNum": "64.",
        "title": "利用監控系統觀察降雨型態影響因落塵造成太陽能發電的損失-以台南地區為例",
        "link": "https://hdl.handle.net/11296/k8g2x9",
        "description": "落塵沈積在模組表面上時，是導致太陽能系統發電效率降低最主要的一個問題，而所造成的經濟損失也引起系統管理者的關注，當太陽能光電模組設置在戶外時，降雨現象則是自然環境氣候中，被認為是最有效的天然清潔過程。但太陽能光電模組表面的落塵污染程度愈嚴重，降雨量閾值就會愈高。為了了解降雨形態與落塵對太陽能光電系統發電效率所產生的影響，故筆者選擇在台南巿仁德站進行研究，將太陽能光電系統設置在戶外，並利用中央氣象局及Solar Bank太陽能光電遠端監控平台取得該研究站在2013年12月至2014年1-12月，共13個月的相關資料，以每日平均太陽能光電系統直流發電比(RA值)及每日累積降雨量做為變數因子，並利用敘述性統計(Descriptive Analysis)、及迴歸分析(Regression Analysis)，進行研究探討與分析。這個研究將台南巿一年的氣候分為乾季與雨季，在乾季時，落塵沈降會使太陽光電系統RA值平均每月下降4.2%，而單一降雨量0.5毫米就可以發揮清潔太陽能模組上落塵的功能；但在雨季時，會因為落塵的溼沈降效應，使太陽能光電系統的發電量下降。且無論是在乾季或雨季時的降雨量，均無法將太陽能模組上的落塵完全清除，使模組發電效率恢復至100%，在2014年台南仁德站RA值最高為98.08%。"
    },
    {
        "resulNum": "65.",
        "title": "以類神經網路建構四季太陽光電系統發電量預測模型之研究",
        "link": "https://hdl.handle.net/11296/652gdd",
        "description": "太陽光電系統容易因氣候、日照量、模組溫度影響其發電效率。本論文選擇大氣水文資料庫2016年之全天空日射量、紫外線指數、平均溫度、相對濕度等氣象資料，預測臺北科技大學太陽光電發電系統春、夏、秋、冬四季之發電量。預測標的為70.38kWp太陽光電發電容量，太陽光電系統發電量效率與太陽光電模板溫度有很大的關係，故本論文也會將模板溫度納入預測輸入參數。本論文使用靜態類神經網路建構預測模型，將上述選定輸入參數進行神經網路訓練，探討模型之可行性，經由調整隱藏神經元，並做正規化處理，使用試誤法進行輸入資料分析，使其預測結果與2016年已知四季實際發電量比對，將學習後模型作驗證，透過RMSE(均方根誤差)判定預測模型精準度，並比較在不同輸入參數下對模型學習之影響。"
    },
    {
        "resulNum": "66.",
        "title": "應用K-means聚類分析與改良型支撐向量機於風力發電預測",
        "link": "https://hdl.handle.net/11296/bs7wmv",
        "description": "因應全球永續趨勢，以及配合政府發展再生能源政策，風力發電為關鍵的發展項目，然而風的波動性與間歇性造成風力發電供應不穩定，將直接衝擊電網的運行以及安全，不僅增加電力調度難度更是使電網運轉操作成本負擔沉重，因此研究風力發電的預測技術，有助於改善風電對於電網的不良影響，亦是發展風力發電的重要配套機制。本文透過歷史數據建構風力發電模型，藉由預測海象風速與結合本文建構的發電模型進行風力發電預測驗證。首先應用K-means聚類分析技術，將大量的氣象資訊以聚類方式選出較有意義的訓練資料，藉以減少建模資料筆數與提高運算效率。接著根據挑選出的風場進行發電模型建構，以相同的聚類方法減少樣本訓練空間，提高樣本有效性。在預測模型建構上，以支撐向量機原理為基礎，建構迴歸模型，執行一時與一日的風速預測後，結合發電迴歸模型，實現風力發電的間接預測。為了降低預測誤差，本文以最低誤差為目標，使用改良具時變加速度係數粒子群最佳化演算法解決支撐向量機參數設置的問題，不僅增加預測模型的完整性，亦能提高預測準確性。"
    },
    {
        "resulNum": "67.",
        "title": "營建工程考量風不確定因素影響下之工期預測研究－以風力發電機組興建工程為例",
        "link": "https://hdl.handle.net/11296/6frvkt",
        "description": "台灣地區天然資源蘊藏不豐，自產能源匱乏，98％以上的能源供給仰賴進口，化石能源進口依存度高，為減少對能源進口的依賴度及全球溫室氣體減量的壓力下，並為打造非核家園之目標邁進，我國政府全力積極推動各類再生能源計畫，例如「千架海陸風力機」計畫與「陽光屋頂百萬座」計畫。由於台灣位處大陸板塊與海洋交界處，每年因受到強勁的東北季風吹襲，使得台灣本島沿岸暨許多離島地區，年平均風速超過每秒4公尺以上，風能蘊藏相當豐富；且風力發電具備低環境污染、低發電成本及永續發展之優點，為具潛力的再生能源之一，故風力發電機組興建工程將在台灣積極開發推動建置。為確保風力發電機組興建工程能在規劃期程內完成並開始啟用供電，在台灣，目前大多數的風力發電機組興建工程合約大都採用日曆天計算工期。惟規劃這些日曆天時並未仔細考量風不確定因素影響所產生之風險，目前工程界實務上對於受天候影響之工期預估大多是根據經驗法則以概估方式處理，惟此概估方式常因人而異，若風不確定性因素之影響超乎預期，則工期延誤之風險相應而增加。因此，承包商需承受更多的風險。好的專案管理（project management）係要減少不確定因素所造成之不良影響，而使專案時程能依循所規畫之排程進行；同時，亦能動態地調整所規畫之排程俾利符合專案實際執行情況"
    },
    {
        "resulNum": "68.",
        "title": "太陽輻照度對太陽能發電影響-於住宒應用之研究",
        "link": "https://hdl.handle.net/11296/68dyna",
        "description": "對人類而言，太陽是非常重要的一顆恆星，從一億五千萬公里之外發出巨大又灸熱的能量，為人類提供無窮無盡的光和熱。近年來，能源使用造成氣候變遷、氣候異常..等危機，讓世界各國開始嚴肅面對環境永續的課題。能源，是我們人類生存和社會發展的物質基礎，而太陽能具有資源豐富，取之不盡、用之不竭，處處均可開發利用的優點。台灣位處亞熱帶，日照充足，具有豐富的太陽能源可供使用，如何有效的利用是目前政府正極力推廣應用的政策項目之一。由於太陽能源屬於間歇式能源，常受到日照變動、遮蔽效應、天氣時陰雨的影響。因此，太陽能的研究和應用成為現今人類能源發展的主要方向之一。本研究以太陽能功率感測器(亦稱:太陽能輻照度計)，實測台南安平區7-12月，太陽光照射於早晨至日落的太陽輻照強度(輻照度)，分析晴天與陰天時的輻照度，以及晴天時但有遮蔽物的輻照度..等；以圖、表方式呈現，並參照對比能源局與中央氣象局地面觀測的全天空輻射量、日照時數、降雨天數等的數據，主要以2015~2016年兩年的資料為作為計算時的實測數值；論證太陽輻射的強度以及全天空輻射量與太陽能的發電有正相關性。針對政府正推動的陽光百萬屋頂計劃案中，太陽能發電系統的裝設與現有用電方式的配合使用，在研究中發現若將臺灣地區分六大區域，以全天空輻射量的數"
    },
    {
        "resulNum": "69.",
        "title": "分散式太陽能發電系統調節台灣尖峰用電量之分析",
        "link": "https://hdl.handle.net/11296/u852j7",
        "description": "本研究主旨為分析分散式太陽能發電在台灣尖峰用電時所能負擔供電比例及不同模組發電分配靈活運用之探討。本研究是以公路總局及高工局所得之省道及國道資料，依照實地及google map模擬設置分散式太陽能光電發電裝置，模擬規劃出全台灣將可設置分散式太陽能發電系統容量，依設置方法不同，預估在4797MW到15795MW，再比對氣象局及先前許多研究記錄加以推估，得知實際發電量均可達設置量80%，若能以相關的模擬軟體如sun monitor加以推估，研究預設裝置量會更加容易預估發電量。從台電公開的網路資料比較分析得知，太陽能發電系統發電模式在太陽光日照足夠時可以達到裝置容量的最佳發電量。由每日實際發電曲線，可以得知本研究之分散式太陽能發電對台灣尖峰用量備載容量提升有很大的幫助，日後台電的智慧型電網如果順利完成，分散式太陽能發電將可依不同區域調節供電或是儲能。未來相關的發展研究可活絡台灣本土經濟科技，後續相關研究建設在電業法修正開放後，更可經由全民參與更加完備。"
    },
    {
        "resulNum": "70.",
        "title": "以類神經演算法建構太陽光電發電量預測模型之研究",
        "link": "https://hdl.handle.net/11296/6sae8d",
        "description": "太陽光電系統隨著相關技術成熟，相關應用日益普及，如並聯於電網發電、偏遠離島替代市電供應、海上助導航燈標、行動電話基地台及道路指示標示皆有應用。然而，太陽光電系統容易受日照量、氣候影響發電量。本論文選擇中央氣象局紫外線指數等氣象資料預測光電系統日發電量，希望達成先期預測發電量俾利建立有效電能管理策略。本論文使用倒傳遞類神經演算法建構預測模型。其建構預測標的分別為，臺北科技大學綜合科館的太陽光電發電系統日發電量及臺北市市中心之全天空日射量。其模型挑選，紫外線指數、日最高氣溫、雨況等有可對應氣象預報之資料並搭配距夏至日數為輸入參數，探討實現先期預測發電量及日射量可行性。實驗經由分析輸入資料特異性及調整神經元個數使其模型適度學習，以達成合理推廣能力。建構之模型經與實際資料比對、模型間互相比較並藉由輸入人工假定資料探討及檢視其反應後，本論文建構之模型有合理之反應及預測能力。"
    },
    {
        "resulNum": "71.",
        "title": "福島核事故情境下之台灣核能發電廠事故劑量評估",
        "link": "https://hdl.handle.net/11296/b66p9z",
        "description": "本研究改進高斯軌跡煙流模式，加入全球網格再分析資料與日本地面氣象資料，前七天逐時輻射物質釋放量取自日本原能會評估排放量。2011年福島核災之模擬結果顯示觀測與模式模擬沉降量分布一致，相關係數為0.35。進一步運用世界衛生組織（WHO）推算2011年福島核災的放射性物質排放量，搭配軌跡模式進行臺灣核四廠的放射性輻射物質劑量評估。根據美國考慮地面反射及食入每年不超過50毫西弗做為撒離原則下，研究結果顯示，氣象狀態對於輻射物質的飄散有顯著的影響，其影響區隨發生事件時之氣象狀況而異。若核災發生於東北風盛行的9月至隔年4月，汙染面積會更廣，而夏季則影響較小。根據2011年3月11日後計365日風場分析，全台平均有11%機率的土地輻射劑量超過50毫西弗。以位於貢寮鄉的核四廠為例，若發生福島等級的核災，北部大都會地區，包含北北基、桃園市、新竹市、宜蘭縣，合計居民約一千萬人，各縣市土地達50毫西弗的機率分別為基隆市51%、新北市48%、臺北市38%、桃園市30%、新竹市18%、宜蘭縣15%。結果亦顯示中央山脈的西部山谷地區(多數水庫所在地)及最南端的屏東縣亦有3%的機率達疏散區。意即，在東北季風的狀況下，西部所有地區皆可能成為水資源匱乏區。"
    },
    {
        "resulNum": "72.",
        "title": "太陽能光電系統及其發電效率分析—以彰化地區為例",
        "link": "https://hdl.handle.net/11296/q3cxqb",
        "description": "本  論文探討太陽光電系統的發電原理及提升其轉換效率之方法，並以民國102年底前裝置且已試併聯運轉的系統，設置於彰化地區第三型的太陽光電併聯案場，以民國103年及104年實際躉購電度數作分析，分析這2個年度彰化地區各鄉鎮市平均每天/瓩的發電度數及最佳發電效率月份，再搭配氣象局降雨資料及各鄉鎮市地理環境等資料，綜合分析考量環境因素及氣候因素最適合裝置太陽光電系統的鄉鎮市。以民國105年能源局所公告的躉購費率推算各鄉鎮市裝置太陽光電的預估回收年限。"
    },
    {
        "resulNum": "73.",
        "title": "離岸風場海事施工安全作業準則之研究－以「台電彰化海氣象觀測塔新建工程」為例",
        "link": "https://hdl.handle.net/11296/j8au98",
        "description": "為達能源永續，各國均積極投入綠色能源之開發，台灣得天獨厚之地理環境，具有可觀的風力資源，惟陸域風能之開發受限於嚴峻地形，反觀海域風能仍蘊含豐富且尚未開發；然台灣包括碼頭、防坡堤、填海造地等近岸海事施工技術雖有顯著發展，卻鮮少有離岸海事工程之施工經驗，加上施工風險較高，造成國內許多海事工程營造公司對承攬此類工程望而卻步之原因之ㄧ，進而減緩離岸海事工程本土化之落實及海域風能之發展。本研究以海事工程作業準則為研究主軸，針對離岸風場海事施工安全作業進行分析探討。藉由挪威、德國、中國、美國等離岸風電海事工程作業準則綱要、國內海事工程案例之研析，並針對海上施工可借鏡之內容，納入研擬離岸風場海事工程施工安全作業準則之參考。同時，調查國內營建及海事工程初步危害分析、施工災害初步分析成果，歸納適用於離岸風電海事工程之主要作業項目與施工方法，且進行安全評估前期之初步分析(初步危害分析、施工災害初步分析)，提出符合台灣海域特性之安全評估因子。另以105年年初完工之「台電彰化離岸風力發電計畫-南區海氣象觀測塔新建工程」為例，針對海上運輸、吊裝、打樁、固著(防沖刷及灌漿)、水下防蝕等實務經驗，綜整安全評估因子及離岸風電海事工程施工安全作業準則之內容，將重要共識適度"
    },
    {
        "resulNum": "74.",
        "title": "小型風力發電場之風機配置最佳化研究",
        "link": "https://hdl.handle.net/11296/swgj2r",
        "description": "在一小型風力發電場中，因為場址有限，每一座風力發電機彼此間的距離亦受到限制，下游風機的迎風速因上游風機尾流的影響，常會低於其原始風速，導致無法達到額定發電量，間接使整座風場發電效益受到影響。在一固定場址的小型風力發電場中，本研究探討如何避免前述問題，以最佳化方式裝置固定數量的垂直軸式風力發電機。我們採用中央氣象局所紀錄蘭嶼2014年的逐日平均風速，藉由尾流模型及風機發電功率模型，計算每一座風機的迎風速及發電量，再利用基因演算法及內點法求得各風機在固定場址內的最佳排列方式，使風場獲得最大的發電效益。本研究依據四種情境建構最佳化問題的目標函數，包含固定風速下風場最大發電功率、風場最大全年總發電量、風場最小逐日與逐月發電量變異、以及同時考慮最大發電量與最小逐月發電量變異之雙目標最佳化，本研究並針對情境二的最佳風場進行驗證，同時亦探討風機裝置數目對最佳化分析結果的影響。綜合前述四種情境的分析結果與討論，若風場為獨立供電網，需將最大發電量視為主要目標時，以最佳化方式配置風力發電機可讓風機間尾流效應的影響達到最小，使風場獲得最大發電量；但若風場與市電系統相連，僅作為輔助供電系統，需將穩定發電當作主要目標時，以最佳化方式配置風力發電機亦可讓風場逐日與"
    },
    {
        "resulNum": "75.",
        "title": "基於RSCMAC結合氣象資料與小波分析之太陽照射度預測系統",
        "link": "https://hdl.handle.net/11296/6yuwbg",
        "description": "近年來受到地球暖化影響，各國開始重視再生能源，在政府極力推廣之下使的再生能源發電系統總裝置容量逐年增加，而太陽光電系統是其中重要的一環，因此能否準確的預測太陽光電系統發電量對於電力調度相對性重要。而太陽照射度為影響太陽光電系統發電量的最大原因，將會影響整體電網的電力配置、排程與穩定度。本研究著重於太陽照射度的短期預測，以回歸型最簡類化型小腦模型控制器為基礎，結合氣象資料建立一太陽照射度預測模型。更進一步，本研究另外在依太陽照射度的峰值與變化量建立出標準波訓練範例作為太陽照射度預測模型使用，以解決訓練與測試因為天氣預報錯誤、訓練波型不夠泛化等原因所造成之誤差，從實際模擬測試結果亦獲得優異之結果。"
    },
    {
        "resulNum": "76.",
        "title": "獨立型混合發電系統最佳容量設計",
        "link": "https://hdl.handle.net/11296/zu9y49",
        "description": "本文提出利用微粒群-攀爬演算法來求取獨立型混合發電系統的最佳容量，此獨立型混合發電系統是由太陽能發電設備、風力發電機、蓄電池及柴油發電機所組成。運用中央氣象局三座測候站之每小時日照量、溫度及風速等氣象數據進行發電量模擬，並搭配工業、商業及住宅三種標準負載型態，以最低總成本為目標函數，進行系統最佳容量設計。測試結果顯示，本文所提出之微粒群-攀爬演算法比傳統基因演算法求解結果更為精確及快速。"
    },
    {
        "resulNum": "77.",
        "title": "多晶矽系統和薄膜型系統與季節所對應的發電效率",
        "link": "https://hdl.handle.net/11296/zzbe73",
        "description": "本研究旨在探討在同緯度下的相近區域，CIGS薄膜太陽能電池模組與多晶矽太陽能電池模組的效能差異，尤其在不同季節之比較。本研究採用實際太陽能電池模組的發電數據統計，針對中油公司在加油站屋頂架設的4套商用型太陽光電發電系統，在緯度相近與最佳的架設角度設計下，經過整理分析一整年的數據，並收集最容易影響發電的氣象資料，來進行統計分析，主要結果顯示：一、多晶矽或是CIGS模組，在5~10月的發電效能皆比11~4月好，這是因為北半球的夏季太陽會直射北迴歸線附近，可獲得較高的日射量。二、台灣的8月會受到颱風或陰雨的影響，發電效能會較其他夏季月份表現差。三、1月雖然為台灣傳統的冬季，日射量較不足夠，但因為累積雨量較少，卻能有不輸給夏季的發電效能。四、本次研究中發電效能最高的月份為10月份，因為此時太陽照射於北迴歸線和赤道之間日射量充足，且10月份平均降雨量只有2mm，所以除了太陽直射的影響外，    氣候也是影響太陽日射量的重要因子。五、CIGS薄膜太陽能電池因為有弱光性和較不易受高溫造成的影響所以發電效能較多晶矽太陽能電池模組高。關鍵詞：太陽能發電效益、季節"
    },
    {
        "resulNum": "78.",
        "title": "台灣地區太陽能發電系統投資效益分析",
        "link": "https://hdl.handle.net/11296/g422yj",
        "description": "本研究除依據再生能源發電設備設置管理辦法探討設置型式的適用性外，另將台灣的六個都會區，依據第三型系統容量、躉售電價及所定義的各項財務參數假設估算等條件，應用Excel軟體載入運算，後續以淨現值、內部報酬率、折現後回收年限及自償率等財務評估方法與決策準則，分析各區域自有資金及融資等資金方案的設置效益，最後再透過個案敏感度分析，整理影響因子的風險等級。為使各參數估算較具有參考價值，採用2004~2012年中央氣象局各地區之日射量資料，載入太陽能專用之發電量模擬軟體PVsyst，以推算出各地區的年發電量，並探討躉售公式中年可售電量參數的合理性。而於系統造價部分，採用工作分解結構及單價分析之方式編列預算書，以推算出較接近市場行情之系統建置成本。經分析後發現第一、二型的太陽能系統型式，於建築物如交大光復校區同屬分散的座落型態，應適當的放寬併聯及躉售的規定，以符合經濟投資及節能減碳的多重效益。於計畫成本與收益部分，發現除模組及逆變器兩項關鍵設備約為造價的50%。年可發電量約為日射量的80%，於計畫初期藉此比例關係可快速推估出造價及年發電量外，並得知台中以北的新竹、台北地區年可發電量與躉售公式中全台灣統一訂定為1,250kWh(度)的差異達24.45~31.23%，有失鼓勵民間參與再生能源政策的公平精神。經效"
    },
    {
        "resulNum": "79.",
        "title": "建立台灣在經典氣象年中的太陽能資料庫",
        "link": "https://hdl.handle.net/11296/d64a3q",
        "description": "摘要題    目 ：建立台灣在經典氣象年中的太陽能資料庫研 究 生 ：嚴偉倫指導教授 ：張克勤　　在日本福島第一核電廠核災後，台灣已經掀起了一波反核能的浪潮，又顧慮火力發電所需燃料大多依賴進口，並且有空氣汙染的問題，故台灣極力發展再生能源，其中由於台灣位於北迴歸線附近，日照時數長，所以太陽光電及太陽光熱的應用在台灣再生能源中扮演著很重要的角色。但在台灣太陽能應用評估的數據上，缺乏漫射率資料，並且中央氣象局在2003年4月以前所裝置之日射量測儀器皆有誤差，故本研究為了更新並補齊台灣太陽能資料庫，使用中央氣象局2004年至2013年十年間全台30個氣象觀測站之氣象資料，將其氣象觀測站缺少資料利用三階方程式進行補齊，並按照經典氣象年的規範與步驟整理出三種加權函數下的經典氣象年，此經典氣象年之氣象資料可代表該地區的常態氣候狀況，且應用在不同的領域可選擇不同之加權函數。往後在評估太陽能應用時可做參考本研究所選取之經典氣象年氣象資料。　　太陽能輻射量通常可分為兩種形式：直射輻射量與漫射輻射量。而漫射率則為兩者之間的比值，其漫射率直接影響某些太陽能應用之效率，故本研究以2014年國立成功大學歸仁校區量測之漫射率資料進行內差補齊並刪去不符合物理意義之量測值，最後迴歸成一條三階經驗方程式， 以"
    },
    {
        "resulNum": "80.",
        "title": "利用外型變更法降低風力發電機的雷達回波值",
        "link": "https://hdl.handle.net/11296/f4abrx",
        "description": "風力發電機是一種大型電導體，當它們經雷達照射過後會產生巨大回波。這些強烈反射波會對航空雷達、岸際監控雷達與氣象雷達造成強大的干擾。本次論文提出了數種用來降低風力機塔柱雷達截面積(RCS)的外型變更法。其中一種方法中，嘗試將原本的風力機塔柱模型的表面，增加水平與垂直的凸狀結構。於是乎當塔柱被雷達照射時，部分雷達波被反射至不重要的方向，因此雷達回波降低。另一種塑模方法是將風力機塔柱塑模成圓錐外型，這種外型的塔柱能將雷達回波反射至天空使其偏離反射主線，進而降低塔柱RCS。為了更進一步降低塔柱RCS，同時結合了凸紋結構與圓錐塔柱製成新塔柱，來測試塔柱們降低RCS的效果。實驗結果顯示，本文提出的方法能有效降低風力機塔柱上的RCS。然而，凸狀結構的數量與高度、圓錐塔柱的錐率以及雷達波的頻率也對我們方法的效能產生極大的影響。所以本研究同時也進行不同條件下的測試。"
    },
    {
        "resulNum": "81.",
        "title": "應用類神經網路於具再生能源發電之配電饋線短期負載預測",
        "link": "https://hdl.handle.net/11296/rq4nz3",
        "description": "負載預測在電力調度作業中扮演著極為重要的角色。精確的負載預測可提供較正確的機組排程與規劃，進而提高供電品質，尤其在大量再生能源發電併入系統後，提高負載預測的精確度更是增加系統調度安全及降低成本的治本之道。再生能源雖然取之不盡、用之不竭，但卻難以穩定且持續的供電，將使電力調度帶來相當的不確定性。因此若以傳統化石燃料機組配合再生能源機組操作，則需要更為精確的負載預測方法，以降低電力營運的風險與成本。本研究擬以考量再生能源發電與氣象資訊及饋線負載之關聯，進而提出一套更精確的負載預測方法，以應用在太陽光電與風力發電併接於同一饋線的狀況。本論文除了應用類神經網路對於配電饋線執行逐時負載預測外，更針對同一饋線上併接之太陽光電與風力發電裝置進行逐時發電量預測，並以台電雲林橋村變電所及苗栗山佳變電所的饋線資訊進行實際測試，測試結果證實可確實地改善負載預測的效果，進而提高饋線的供電品質並提供電力調度單位更彈性的調度策略。"
    },
    {
        "resulNum": "82.",
        "title": "考量大型風力發電場併網系統衝擊之最優輸電網擴充規劃",
        "link": "https://hdl.handle.net/11296/nff7d6",
        "description": "近年來，再生能源發展蓬勃，如：風能、太陽能、生質能、海洋能、地熱能等，其中，風能扮演著重要角色。因此，本論文提出考量風力發電之最優輸電網路擴充規劃，內容包括風力發電對經濟效益及系統暫態穩定度之影響。首先，本論文提出一個以圖脈理論為基礎的輸電網路擴充規劃(TNEP)方法，藉由圖脈理論中的最小切集(cut sets)來優化TNEP成本。本研究的首要目標在找出輸電網路的瓶頸及其通過的最大電力潮流。所提出之演算法主要目標式為新增線路之建置成本，新增線路是指在既有輸電網路中，必須新增並與過載線路並聯之線路，使能滿足給定未來負載之需求。本研究使用四個基準測試系統來展示與驗證所提出之方法，分別為：Garver的六母線系統、IEEE的廿四母線可靠度測試系統、IEEE的廿一母線系統及六十三母線系統。簡言之，Garver六母線系統用於展示所提出之演算法，其餘的系統則是用來比較所提出方法與其他近期所提出方法在多種情境下之效能。接下來，在經濟分析上，本研究應用澎湖與東吉島氣象站所取得之長期風速資料，分別以商用軟體Wind Atlas Application Program及RETScreen Software，模擬與分析澎湖島上8座岸上及1座離岸風力發電場之發電量與經濟效益。模擬結果顯示，上述9座風力發電場之容量因數在44.5%至49.1%間。研究結果顯示，澎湖地區每年將因此減少二氧化碳排放約680,977噸。最後，本研"
    },
    {
        "resulNum": "83.",
        "title": "[論文]考量未來裝設太陽能發電系統併入澎湖電網之衝擊分析量",
        "link": "https://hdl.handle.net/11296/2v7gdk",
        "description": "台灣位處於亞熱帶地區，日照量非常充裕，不論在沿海、離島或高山等地區均蘊藏大量的太陽能資源。非常適合太陽能發電。太陽能發電是替代能源的主力之一，深切期望太陽能未來可以替代一定比例的能源需求。本論文在探討澎湖本島地區配電系統饋線是否有足空間設置太陽能發電系統。依據臺灣電力公司所提供民國102年各饋線的負載量及中央氣象局所提供澎湖地區每小時太陽日照量資料，針對澎湖本島地區十二饋線併入太陽能發電系統後，進行系統衝擊分析。基於臺灣電力公司電壓調整率2.5%以下的規定，論文中評估各饋線所能安裝的太陽能發電容量，做為電力公司或相關單位未來設置太陽能發電系統的參考。"
    },
    {
        "resulNum": "84.",
        "title": "含儲能設備混合再生能源發電系統之經濟效益分析",
        "link": "https://hdl.handle.net/11296/g2gnjm",
        "description": "本論文探討混合式再生能源發電系統考慮了多國用電電價及再生能源躉購費率後，系統之最佳成本與容量配置規劃問題；其中再生能源發電系統包括蓄電池、太陽能模組以及微型風力發電機組，系統之發電量優先供給負載，以確保負載全年不缺電。利用中央氣象局2013年28個局屬氣象站之逐時風速、日輻射量及氣溫實測數據，並以南臺科技大學A棟之實際負載模型，求得各測試區域之最佳容量配置解。發電系統成本函數為扣除系統餘電躉購所得之20年運轉成本，在求解出系統最佳配置解時，並求得各地區系統建置之回收年限與發電系統盈餘。利用儲能系統充放電控制模式能控制充電及售電時機，本論文分別利用英國、德國、夏威夷、日本以及台灣之2013年再生能源躉購費率進行測試，分析不同躉購費率及時間電價下，對系統之營運成本效益造成之影響。模擬結果顯示，加入儲能充放電控制後能有效降低混合式再生能源發電系統之回收年限。另外，再生能源躉購費率之高低，直接影響系統之經濟效益與回收年限及再生能源發電設備容量配置之大小，費率越高系統之回收年限就越低。"
    },
    {
        "resulNum": "85.",
        "title": "大型風力發電機聲功率量測與噪音模擬分析",
        "link": "https://hdl.handle.net/11296/4zrgv9",
        "description": "本研究探討兩部分，第一部分為大型風力發電機聲功率量測，第二部分為大型風力發電機噪音模擬分析。大型風力發電機聲功率量測係依據IEC 61400-11 風力發電機噪音量測技術(Wind turbine generator systems Part 11 Acoustic noise measurement techniques)。採用此規範針對國內三處不同大型風力發電機機型進行聲功率調查，並與原廠所提供之風力發電機聲功率值進行比較，比較結果差異為1dB。噪音模擬分析使用聲學軟體Cadna A模擬，建立大型風力發電機運轉噪音之預估模式。首先個別探討地形高程、地面吸音、氣象因素，聲功率參數，指向性等現場環境因素，對大型風力發電機運轉噪音模擬影響作比較分析，最後探討綜合五個影響噪音參數後的風力發電機噪音分佈影響。本研究模擬結果顯示影響噪音參數中，以地面吸音的影響最大，現場地面吸音率差的地質會造成噪音增量，其次為氣象因素，隨風向改變噪音分佈有變化，本研究三處地形皆是平坦地形，故地形影響最小。風力發電機噪音分佈影響結果，現場基準位置之量測值與模擬基準位置之模擬值，在誤差±3dB(A)內之要求，驗證此噪音預測模式的可用性。噪音影響參數與噪音預測模式可做為風力發電機噪音環境影響的評估參考。"
    },
    {
        "resulNum": "86.",
        "title": "陸上風力發電機組工程受風影響下之工期規劃",
        "link": "https://hdl.handle.net/11296/ed76j4",
        "description": "近年來永續發展的意識逐漸提高，政府對於再生能源也十分積極地推動，台灣擁有良好的風能條件，風力發電亦是永續能源之一。而工程上，傳統在預估工期，人員雖已將天候影響因素納入考量，但這種方式可能造成誤差，因此，本研究以台灣地區，曾經參與興建風力發電機組工程之專業人員，進行專家問卷統計，另外，本研究運用模糊理論來繪製梯形隸屬函數圖形，用以處理問卷模糊語意的數據，配合中央氣象局風速歷史資料計算，並根據上述參數，建立風力發電機組新建工程所適用之排程輔助系統，模擬案例「桃園蘆竹風力發電機組新建工程」中，受風影響較大之作業項目，於不同風速情況下各別作業項目的工期，以及「風力機組現場安裝」至「96小時連續運轉測試」作業項目之合計工期。本研究根據建立的排程輔助系統，運用新屋氣象測站2008年到2013年的風速資料，模擬了不同情況所造成之工期，其中在不同年份，但開工時間與「桃園蘆竹風力發電機組新建工程」相同，皆於7月27日進行風力發電機組安裝作業，結果顯示，施作「風力機組現場安裝」及「風機配線」作業時，風速較小，則其所需工期較短，相反地，「風機試車」、「風機會同業主功能測試」及「96小時連續運轉測試」作業項目，則需要配合風速大的時候施作，工期較為縮短；另一模擬情況為不同年份，於不同月份開始進行風"
    },
    {
        "resulNum": "87.",
        "title": "深澳火力發電廠關廠前後對大氣環境的影響",
        "link": "https://hdl.handle.net/11296/hva5hk",
        "description": "2007年9月底，位於臺灣東北深澳火力發電廠停止運轉。火力發電廠是主要空氣汙染的點排放源之一，根據環保署TEDS8.1版資料庫(以2010年為基準年)，臺灣東北部硫氧化物最主要的排放源是協和火力發電廠。因此深澳發電廠關廠後，當地汙染源排放的減少對空氣品質改變的情形，值得分析與討論。硫氧化物濃度下降的因素有三：風場改變、降水增加與當地硫氧化物濃度排放減少。選擇臺灣東北部環保署空氣品質監測站電廠關廠前後五年八方位風向比例，相關係數達0.8以上，中央氣象局人工測站更達到0.9以上，說明電廠關廠前後的風場環境變化不大。2002至2012年期間臺灣東北部地區降水時數上升趨勢顯著，電廠關廠後各測站秋、冬兩季降水量增加，春季降水量減少。電廠關廠後各測站乾日比例減少，尤其以秋季最明顯，但春季在電廠關廠後，多數測站的乾日比例增加。SO2關廠後乾日濃度值小於關廠前濕日濃度值，表示電廠關廠後SO2濃度的下降，降水量對汙染物的移除機制絕非主要因素，因此可以確定基隆地區SO2濃度下降一定與當地汙染物排放濃度減少有關。SO2 10%濃度極大值以協和發電廠為主，1%濃度極大值在深澳發電廠關廠前，深澳與協和發電廠影響程度各半。電廠關廠後五年東風分量SO2濃度下降最多，西北風分量下降最少，由此即可區別深澳與協和發電廠對大氣環境的"
    },
    {
        "resulNum": "88.",
        "title": "導入氣候因素之太陽能發電系統電腦模擬",
        "link": "https://hdl.handle.net/11296/54ywvq",
        "description": "由於陽光照度、溫度變化等不確定之氣候因素，因此，本論文加入氣象局歷史資料，使用擬合分析(curve-fitting)求出一個可周而復始皆可使用的照度曲線；研究目的為建立一套太陽能發電系統電腦模擬介面。其內容包括從一開始太陽能板擺放角度，太陽能電池特性，日照度修正方法，以程式計算最大功率點與實驗室開發的分散式(DPV)與集中式(CPV)系統，兩者相較下，可於遮陰模組匹配選擇上獲得優勢，進而使用本軟體來評估分散式及集中式系統之發電效率。本研究使用單二極體模型模擬太陽能模組，將模擬結果與實驗進行比較。藉由本軟體的建立，可預先評估太陽能發電系統的發電量；最後對於八片太陽能模組合而成之集中式或分散式太陽能發電系統在受到部分遮陰條件時於一整年進行電腦的模擬。"
    },
    {
        "resulNum": "89.",
        "title": "應用類神經網路技術在金門風場之長時間風力發電預測",
        "link": "https://hdl.handle.net/11296/68fw4j",
        "description": "由於風力發電機輸出不穩定主要原因在於風速發生變化，風力發電機輸出也跟著變化，而影響風速的因素包括地形、溫度、濕度等。因此，風力發電預測是一種非常複雜、多維度且高度非線性的系統。類神經網路技術的優點在於能學習輸入與輸出間的關係而不需要提供轉換的數學函式，可完成複雜的非線性映射、聯想、資料分類、知識處理等工作，且類神經網路具有並行處理能力可減少運算時間，故適合應用於數量眾多風機組之發電量預測。本論文的目的在於應用類神經網路技術於預測長時間之風力發電量，並分析金門風場之風力發電量預測效果。最後，利用MATLAB實現一類神經網路結合氣象資料之風力發電預測系統，具有領前時間1~48小時之風力發電預測能力。"
    },
    {
        "resulNum": "90.",
        "title": "七美地區太陽光電風力發電系統衝擊與成本效益分析",
        "link": "https://hdl.handle.net/11296/hf6j99",
        "description": "本文主旨在探討七美地區配電系統三條饋線中，三條饋線中，模擬饋線上併聯太陽光電系統和風力發電系統，進行系統衝擊分析，找出電壓變動率最想的饋線。根據氣象局澎湖地區每小時太陽日照量與每秒平均風速資料，推估太陽能發電量和風力發電發電量，並求解注入責任分界點之最大太陽能發電量及風力發電發電量，探討在生命週期內，以太陽光電系統與風力發電系統之期初投資額和每年收益，推導系統之回收年限，以獲致最佳成本效益。"
    },
    {
        "resulNum": "91.",
        "title": "PV 追日機發電預測模型與分析",
        "link": "https://hdl.handle.net/11296/27x8de",
        "description": "　　本論文研究之目的為建立簡單且容易使用的太陽光電(photovoltatic，簡稱PV)發電預測模型，以提供太陽能發電設備投資時的評估。此模型以實際量測氣象資料對不同地區考慮日射量與電池溫度之影響，並採用全年逐時之發電量進行計算。同時也納入不同類型PV追日機（包括固定式、單軸、雙軸追日機）追日時造成之能量損失的偏差角計算。　　以本論中所發展之模式，針對中壢(24.97°N)及恆春(22°N)安裝之太陽光發電裝置進行不同條件之理論發電量分析，結果顯示追日機與固定式相較之下晴天時較具優勢，陰天時則幾乎沒有差別。全年發電量來看，雙軸追日與單軸追日相近，雙軸追日多約2%~3%；傾斜固定與水平固定相近，傾斜固定多約0%~3%；整體而言，追日機較固定式多約15%~16%，恆春較中壢多約34%~36%。單軸追日之最佳傾角於中壢為15°，於恆春為18°；固定式之最佳傾角於中壢為14°，於恆春為17°；且容許全年發電量下降1%的角度範圍約±10°。單軸追日之避免陣列遮陰模式中，「反向追日」比「復歸平面」全年發電量僅多約3%~4%。　　另一方面，為驗證本論文所建立發電預測模型準確性，本論文亦與現有軟體、實測資料等進行比較。與商用PVsyst軟體比較，兩者之全年發電量差異約3%~4%。與國內能源局提供資料比較，兩者之全年發電量差異約7%~8%。由安裝於中央大學與屏東科技"
    },
    {
        "resulNum": "92.",
        "title": "新式垂直阻力型風力發電機組之開發研究",
        "link": "https://hdl.handle.net/11296/z48ucv",
        "description": "　　本文主要在設計發展一組具重量減輕、設計簡單、經濟價值高等特點的多扇葉阻力型之垂直軸風力發電（Multi-Blade, Vertical-Axis Wind Turbine; MVAWT），經數學模擬研究以及計算流體動力學分析，並與製造及實驗相結合來進行一個完整的風力發電機之研究發展。初步的設計過程中，當阻力型垂直軸風力發電運轉在迎風面（Upwind）時，數值與實測皆觀測到大量的負阻力產生。爲了減少迎風負阻力的影響，本文進行葉片翻轉機構的設計開發，接著按照IEC61400-12規格來規劃設計與製造安裝，一台小尺寸的多扇葉阻力型之垂直軸風力發電機及其性能測試平台，以進行風力發電功能與葉片翻轉機構的性能觀察。爲了將環境資訊與功率因數等資訊記錄到測試平臺，在此將發電機、加載系統（Loading System）、氣象桅杆系統(Environmental Mast)和實驗數據採集系統（DAQ）整合安裝作為一個發展風力發電機的性能測量系統。同時，把數據過濾處理和實驗結果分析整理，在LabView之架構建立成一個可靠的計算機程序；故這風力發電機系統可以運用自動化方式進行現場性能與觀察；此外，爲了取得足夠且準確的實驗數據，在程式中將引進統計概念以正確判斷執行數據處理過程。接下來，運用數學模型和計算流力模擬工作來進行分析估計，以在MVAWT操作過程整理取得其扭矩分佈和氣動力特性；經由集中於在葉片周圍的氣流相互作用之觀察，並結合葉片自動翻轉機"
    },
    {
        "resulNum": "93.",
        "title": "彰化、花蓮及臺南地區太陽能發電系統成效探討",
        "link": "https://hdl.handle.net/11296/594qkn",
        "description": "本研究蒐集中央氣象局2013年01月~2013年12月彰化、花蓮、臺南三地日照等氣候資料及發電資料，探討中部彰化裝置容量285.12 kWp、東部花蓮裝置容量197.19 kWp及臺南南科裝置容量99.3 kWp，三地點太陽能發電狀況。探討模擬發電量、實際發電量、回收效益及溫室氣體減量效益。依據2013年氣候資料統計結果，全年度日射量，臺南地區高達5.63 kW/㎡-day，平均1 kWp裝置容量日發電量為3.678 kWh；彰化地區全年度日射量達到5.18 kW/㎡-day的水準，平均1 kWp裝置容量日發電量為3.632 kWh，花蓮地區全年度日射量達到4.27 kW/㎡-day的水準，平均1kWp裝置容量日發電量為2.56 kWh。顯示臺南和彰化地區全年平均較東部花蓮具發電潛能。根據研究結果，依氣象資料及發電設備裝置量去預估發電量，實際發電量與預估發電量都會有62.16%~70.22%之落差。因此在評估回收年限及發電量時建議臺南地區參考係數0.6319，彰化地區參考係數0.7022，花蓮地區參考係數0.6216。本研究發現2013年的平均日射量較1981~2010年平均日射量有升高 趨勢。在日射量變化方面，臺南增加34.04%、花蓮增加4.14%，臺中則增加了23.8%之多，有利於太陽能發電。每1kWh之發電成本計算結果，以彰化最低為3.02元，花蓮最高達29.83元。換算設置成本回收時程，花蓮屬於建材一體型原始造價高，須46.25年，彰化則須7.06年回收。以2013年發電狀況推算3地區20年"
    },
    {
        "resulNum": "94.",
        "title": "應用支撐向量回歸和模糊推論於光伏電池發電量預測",
        "link": "https://hdl.handle.net/11296/6v4q9z",
        "description": "本文使用支撐向量回歸和模糊推論方法，預測未來一天的光伏電池發電量。論文中使用的支撐向量回歸已經成功的運用在分類和回歸分析上，支撐向量機則使用最佳超平面來得到線性或非線性的高維特徵空間。本文提出的預測方法在訓練部分，支撐向量回歸用來訓練收集的歷史資料，包含最高溫度、降雨機率和相似時且相同天氣的照度，訓練資料的分類則採用模糊推論方法。在預測部分，根據台灣中央氣象局提供的未來一天天氣資料經由模糊推論方法，選擇適合的已訓練完成之預測模式。為測試提出的方法，本文實際採用台灣中央氣象局一年完整天候資料，以測試一光伏電池發電系統之發電量，並以實際結果比較其預測準確度。數值結果顯示本文所提的預測方法比起單一支撐向量機方法和傳統的類神經網路方法有較高的預測準確率。"
    },
    {
        "resulNum": "95.",
        "title": "類神經小波網路用於太陽能電池發電預測之研究",
        "link": "https://hdl.handle.net/11296/hbus62",
        "description": "現今油價居高不下，在許多可替代再生能源中，太陽能對台灣較具發展優勢，且太陽能電池生產技術台灣領先全球居領導地位，台灣南部又擁豐富的日照及光電產業發展健全，故以南部某光電產業太陽能電池發電資料為基礎，預測太陽能發電量，可做為政府或民間廠商設立太陽能發電廠的參考資料。本文太陽能發電預測方法主要將太陽能發電歷史資料藉由Matlab小波轉換後，再將小波轉換後所產生資料經由倒傳遞類神經網路訓練，進而預測未來一天至未來一周的太陽能發電量。其中因太陽能發電受天氣影響其預測發電準確度，例如日射量、氣溫、降雨量皆會影響發電量，因此將太陽能發電預測依季節分為春天、夏天、秋天、冬天，以提高發電量準確度。本論文使用的氣候參數包括參考氣象預報之太陽照度時數及降雨量，數據包括台南地區2011年8月到2012年9月年的氣象資料。經由模擬結果顯示本論文使用小波轉換加倒傳遞類神經網路預測，較一般傳統類神經網路預測其平均相對誤差(Mean Relative Error)準確度提高46.3%、均方根誤差(Root Mean Squared Error)準確度提高18.5%。"
    },
    {
        "resulNum": "96.",
        "title": "無人飛機電力系統運用太陽能發電技術",
        "link": "https://hdl.handle.net/11296/mrts5e",
        "description": "本研究之目的為設計一套太陽能供電系統，藉由太陽能板的持續輸出電源供給無人飛機使用，以延長無人飛行載具滯空時間，達到長滯空之目的，並以此無人飛機進行氣象偵測。無人飛機以太陽能板搭配電源轉換系統，將太陽能板輸出之電壓電流穩定輸出，本研究中使用之太陽能電源供應無人飛行載具上的制動系統，以太陽能電力推動各翼面之伺服馬達，改變控制面角度達到控制飛行姿態的目的。本研究並以裝置太陽能系統之無人飛機實際進行氣象資料偵測，量測飛行路徑上之風場資料，飛行路徑經規劃後由GPS定位系統與自動駕駛系統控制無人飛機沿規畫路徑飛行，實驗結果驗證太陽能供電系統能持續穩定提供飛行控制所需之電源，驅動無人飛機控制面精確沿規劃路線飛行，完成風場量測。"
    },
    {
        "resulNum": "97.",
        "title": "考慮再生能源發電併網之配電系統規劃與保護協調",
        "link": "https://hdl.handle.net/11296/cye4dh",
        "description": "本文運用再生能源(Renewable Energy)的發電特性，收集氣象局日照強度歷史資料，應用馬可夫隨機模型，建立太陽光電發電機組(Photovoltaic, PV)的隨機發電模型，在設定失能指標(Loss of Load Expectation, LOLE)的條件下，推估PV發電機率與主變故障機率組合後其失能指標之分佈，並探討不同PV發電模組滲透率下，配電系統於目標年的主變容量擴充策略。然而配電系統併聯再生能源會造成系統之電壓及故障電流分佈之問題，因此本文利用自行開發之程式進行三相電力潮流的模擬，在系統尖、離峰之運轉狀況下，推估配電系統饋線在併聯再生能源後之電壓變動率，並根據模型推估結果，提供饋線併聯再生能源的運轉操作策略之參考。另外，對於配電系統的饋線與其它饋線的轉供策略，在併聯再生能源發電機組情況下，藉由環路電力潮流控制器(Loop Power Controller, LPC)可有效改善饋線間轉供時的線路損失，並使饋線間負載達到平衡，推估饋線間加裝與未加裝LPC之線路間電壓、角度及功率之變化分佈。在先進配電自動化系統(Advanced Distribution Automation System, ADAS)概念下，系統可有效即時監控配電系統上的各項設備，當風機併聯容量及投入位置改變時，可迴授信號至主站伺服器，透過程式運算之檢討結果，重新進行保護電驛的標置檢討，配合系統開關狀態與併聯風機容量的改變，提出合適化的電驛標置設定，以維護配電系統運轉之安全。總結本文主要貢獻主要分為二方面"
    },
    {
        "resulNum": "98.",
        "title": "以RSCMAC為基礎結合氣象資訊之太陽能功率預測",
        "link": "https://hdl.handle.net/11296/ymrbg7",
        "description": "在政府立法及世界潮流的鼓動推行下，使得太陽光電發電系統設置越來越多，裝置量也越來越大。終將影響到整體電網穩定度，而其電力調度之可行性亦更形重要。為了有效率的運用隨天候變動之太陽能發電系統發電量及穩定電網系統，預測其極短期未來功率輸出將會隨設置量增加愈來愈重要。本論文目的希望能建立一個有效之太陽光電發電系統預測模型，能對於太陽光電發電系統之電力整體配置與評估用。因此本研究以清雲科技大學10kW太陽光電發電系統作為目標，以回歸最簡定址架構之類化型小腦模型控制器(RSCMAC)為基礎建立預測模型，輔以自行架設小型氣象站提供之氣象資訊，預測10分鐘後之瞬時功率。最後以2011年11月做為測試，獲得優異之測試結果。"
    },
    {
        "resulNum": "99.",
        "title": "建立風力發電結合建築物雨水再利用系統設計平台",
        "link": "https://hdl.handle.net/11296/3qb2wh",
        "description": "本文主要目的在建立風力發電結合建築物雨水再利用規劃系統平台，首先利用Microsoft Office Access 2003資料庫軟體，建立1990年~2009年台灣北部七個不同縣市:基隆市、台北市、新北市、宜蘭縣、新竹縣、新竹市、桃園縣之日雨量和日帄均風速之氣象資料庫，其中資料來源包括9個中央氣象局、15個台灣電力公司及57個經濟部水利署之氣象資料；並結合ESRI ArcGis 9.2軟體與Microsoft Visual Basic及ESRI ArcObjects物件，建立獨立型、市電並聯型、自來水補注型、標準型4種系統供水量與發電量之計算程式，該模式能提供使用者評估雨水貯及系統與風力發電系統配置之選擇。本研究模擬假設各地區依4種系統以不同地面貯水槽容量與頂樓水塔來做搭配，探討用水及用電量之變化情形。分析結果顯示基隆市與宜蘭縣因發電量和降雨量充足，平均替代率基隆為55%、宜蘭為50%，適用於獨立型之配置；新北市、台北市、新竹縣與新竹市，平均替代率新北市為45%、台北市為25%、新竹縣與新竹市各為15%，因發電量不足，將適用於市電並聯型之配置。本研究景提供設置建議，使用者可依據其目標與用途上進行選擇配置。"
    },
    {
        "resulNum": "100.",
        "title": "基於RSCMAC及區域氣象資訊之太陽照射度預測系統",
        "link": "https://hdl.handle.net/11296/k3qzj6",
        "description": "近幾年由於太陽光電發電系統如火如荼地架設，使得太陽光電發電系統總裝置容量朝向愈來愈大的趨勢，將對於整體電力規劃有所影響。因此預測太陽照射度對於太陽光電發電系統發電量設置效益評估相對地重要。而影響太陽光電發電系統發電量最大的莫過於太陽照射度，將影響整體電網之穩定度、電力配置及排程。本研究建立一個高準確性的太陽照射度預測模型，預測太陽光電發電系統也對於未來大型電網太陽光電發電系統或太陽光電發電站的評價。本研究目的是應用RSCMAC預測極短時間的太陽照射度。對於太陽照射度預測研究，大都著眼於每小時全天空照射(Global Hourly Solar Irradiations, GHSI)，其用途在太陽光電發電系統中用來預測發電量，做為設置效益評估用。因此以氣象資料及回歸型最簡定址架構之類化型小腦模型控制器(RSCMAC)為基礎建立一太陽照射度預測模型，並驗證其準確度及可行性。"
    }
]