[
    {
        "resulNum": "1.",
        "title": "國小自然與生活科技領域多媒體教材發展之研究---以「天氣的變化」單元為例---以「天氣的變化」單元為例國小自然與生活科技領域多媒體教材發展之研究---以「天氣的變化」單元為例",
        "link": "https://hdl.handle.net/11296/9ccwhv",
        "description": "本研究以國小南一版自然與生活科技第七冊第四單元---「天氣的變化」中的水的形態變化（雲與降水）的內容為主軸，設計發展出「天氣的變化」的多媒體教材，進而利用此多媒體教材進行教學實驗，選擇以桃園縣中壢市某國小五年級一個班為研究對象，進行四節課的實驗教學，並以多媒體教材評卷問卷、教學前後自然科學習成就測驗、多媒體教學意見調查表等資料，進行質性與量化分析，用以探討（一）如何發展出一套配合國民小學學習天氣變化的多媒體教材。（二）學習者使用多媒體教材教學後的學習情形。（三）學習者對多媒體教學的接受程度。研究結果與發現如下：一、透過課程分析與學習理論的探討，研究者發展出一套配合國小自然與生活科技領域「天氣的變化」單元的多媒體教材，此教材包含了「認識雲雨霧」、「認識霜露雪」、「酸雨介紹」、「沙塵暴」及「課後練習」等五個單元。二、進行教學實驗和成就測驗之後，發現透過多媒體教材，學童的前、後測得分有顯著差異，學童在學習成效方面有明顯的提升。此多媒體教材對於高分組學童與低分組學童，同樣呈現顯著差異的成果，皆能有效提升高分組學童與低分組學童的學習成效，這樣的結果表示此多媒體教材對所有的學童皆適用，並不局限於某一個群體的學童。三、根據學童作答的「多媒體教學態度量表」"
    },
    {
        "resulNum": "2.",
        "title": "天氣與生活STEAM課程對三年級學童的天氣概念、探究能力與科學態度之影響研究",
        "link": "https://hdl.handle.net/11296/mwq7hu",
        "description": "本研究旨在探討天氣與生活STEAM課程對國小三年級學生的天氣概念、探究能力與科學態度之影響。採準實驗研究前後測設計，研究對象為新竹縣竹北市之新新國小（化名）三年級兩個班的學生（51名），其中選取一個班為實驗組，於天氣與生活單元進行四週STEAM課程，另外一班為控制組，於天氣與生活單元進行一般教學。研究工具包括：「國小中年級學童天氣概念二段式問卷」、「國小中年級做科學探究能力問卷」與「對科學的態度量表」。資料分析方法包含：成對樣本t檢定和單因子共變數分析。本研究主要結論如下：（一）不管是一般教學或是本研究所設計之天氣與生活STEAM課程皆能顯著增加學生的天氣概念，但學生之天氣概念不會因參與不同教學活動而有顯著差異。（二）本研究所設計之天氣與生活STEAM課程對於提升國小三年級學生「雨」向度的天氣概念之效果顯著優於一般教學，但「濕度」、「雲霧」、「氣團」、「風」及「溫度」向度上，兩種教學的效果沒有顯著差異。（三）不管是一般教學或是本研究所設計之天氣與生活STEAM課程皆無法顯著提升學生整體探究能力，且學生的整體探究能力也不會因為進行一般教學或STEAM課程而有顯著差異，不過STEAM課程對於提升學生「界定問題」能力的成效，顯著低於一般教學，但對於提升「設計規劃」的能力，兩者並無顯著差異。（四）關於「實"
    },
    {
        "resulNum": "3.",
        "title": "以相機為天氣感測器 : 從影像預估天氣資訊",
        "link": "https://hdl.handle.net/11296/aspwdk",
        "description": "我們提出一個從單一影像預估天氣資訊的系統。透過分析天氣資訊，我們可以得知現實世界的事件如何影響人們在網路上的行為，另一方面，天氣資訊也能作為電腦視覺應用中的一項重要性質。 利用現有的影像資料庫及GPS資訊，我們從線上天氣平台以及電子地圖服務蒐集了大量影像以及相對應的天氣資訊和海拔高度以供分析。藉由這個跨平台的異質性資料庫，我們探討天氣與影像資料的關聯性，從而建立以隨機森林為基礎的模型來推估出一張影像裡的天氣型態為何。在本篇論文裡，我們描述人群行為與天氣型態之間的關聯性，並且驗證影像的天氣資訊對於電腦視覺應用有所幫助。"
    },
    {
        "resulNum": "4.",
        "title": "利用天氣資訊創造價值 —以天氣風險管理開發股份有限公司為例",
        "link": "https://hdl.handle.net/11296/2j9m9y",
        "description": "隨著氣候的變遷與溫室效應的影響，自然災害發生頻率越來越高，海嘯、地震、風災等自然災害，所造成的經濟損失更是屢創新高。天氣不再只是一個數據或是一個資料，精準的天氣資訊，將為人類帶來極高的經濟價值與經濟效益。近年來，天氣資訊的服務產業也已經在世界各地蓬勃的發展。天氣風險(WeatherRisk)管理開發股份有限公司是台灣第一間民間成立也是目前台灣規模最大的天氣資訊服務公司。此研究使用Osterwalder and Pigneur 的商業模式來對WeatherRisk公司進行個案分析，探討其如何利用準確的天氣資訊創造並傳遞客製化、減少風險與保證等的價值給顧客。本研究亦發現WeatherRisk 公司在面對強大的全球競爭者進軍台灣時，須將自己定位為閃避型的企業:即基於其在台灣已有先進者的優勢，爭取成為全球競爭者合資的夥伴，透過合作的關係，鞏固台灣市場並拓展至海外市場。"
    },
    {
        "resulNum": "5.",
        "title": "天氣對台灣不同類股報酬的影響",
        "link": "https://hdl.handle.net/11296/h3x679",
        "description": "股票市場上有許多現象無法由效率市場假說解釋，因此行為財務學家開始 尋找市場不效率的原因，有許多學者研究發現天氣會影響人們的心情及行為，好天氣使人愉悅，且對未來抱持樂觀，壞天氣則使人鬱悶，對未來不具期待，因此天氣因素影響人們的心情，進而影響行為，甚至在股票市場上的決策，或許這就是造成股票市場不效率的原因之一。本研究主要探討天氣因素是否對電子股、農糧股、觀光股及航運股報酬造成影響，天氣變數包含溫度、溼度、日照時數及雲層量，研究期間為2015年至2019年。由於天氣變數與四大類股報酬皆為時間序列資料，針對資料進行了單根檢定、自我相關及異質變異分析，發現資料存在自我相關及異質變異，因此無法以一般線性迴歸進行分析，本文選擇GARCH(1,1)模型進行分析，實證結果發現，電子股報酬會受到日照時數與雲層量的影響，農糧股、觀光股、航運股報酬會只會受到濕度的影響，濕度是影響最多類股報酬的天氣因素。另外本研究亦在GARCH(1,1)之變異數方程式中加入天氣變數來探討四大類股是否會受到天氣而影響波動，實證結果發現四大類股當天的波動皆會受到昨天的天氣影響。"
    },
    {
        "resulNum": "6.",
        "title": "以訊號分析資料探勘方法探討PM2.5污染傳播時空特徵及相應之天氣條件",
        "link": "https://hdl.handle.net/11296/8ugty3",
        "description": "由於對人體及環境的危害甚鉅，空氣污染為當今重要的研究議題，尤其是細懸浮微粒(PM2.5)。本研究建立了污染源及傳播特徵萃取流程，以分析台灣中部地區PM2.5複雜的環境系統之物理機制。首先以移動平均結合區域極值建立半自動選取污染事件機制；接著以交叉小波計算延遲時間空間分布(定為傳播情況)，透過主成分分析萃取出六個主要傳播特徵；最後，以各傳播特徵之主導事件探討小尺度氣象因子及大尺度天氣系統對於PM2.5傳播特徵之影響。結果顯示PM2.5濃度日變動呈現雙峰模式—約於上午6:00~9:00及傍晚17:00~20:00左右開始累積，當污染事件發生時，PM2.5累積量約21.35μg/m3，而濃度平均升高時間(開始累積至峰值所需時間)約在8~9小時。第一至六主成分(PC1~6)對中部地區傳播情形解釋力分別為20.43%、14.36%、10.48%、10.10%、9.66%及8.15%，其中PC1為在東北風影響下，污染物由海岸往內陸傳遞的情況，其日均風速(1.6 m/s)與濃度升高百分率(82%)皆為六特徵之首；而污染狀況最嚴重PC5，處在大環境較弱的天氣條件，亦觀察到南風影響，有較高日PM2.5濃度(55.3μg/m3)及較低日風速(1.2m/s)，而其他傳播特徵主要受夾雜高壓出海及高壓迴流之天氣場影響，而台中火力發電廠(中火)在PC4~6等較為破碎的傳播特徵發生時，台中市區較高機會出現較差的日空氣品質，有較PC1~3高的PM污染。總結而言"
    },
    {
        "resulNum": "7.",
        "title": "基於深度學習並同時考慮用戶與基地台配對以及天氣變化之室外定位",
        "link": "https://hdl.handle.net/11296/ukjhcg",
        "description": "通道預測,戶外定位,指紋識別,UE-BS關聯問題,距離追踪,LTE,DL,LTE,DL,channel prediction,outdoor localization,fingerprinting,UE-BS association problem,distance tracking,基於深度學習並同時考慮用戶與基地台配對以及天氣變化之室外定位"
    },
    {
        "resulNum": "8.",
        "title": "以天氣資料設計解決方案之探討",
        "link": "https://hdl.handle.net/11296/832kf5",
        "description": "對一般企業來說，天氣資料可應用於避免天氣現象造成的獲利減損；對一般人來說，則可以中和生活中因為天氣現象所帶來的不便，可說是具有相當價值的資產。在這篇研究中，我們將幫助一支具有豐富天氣資料、並且具備超前技術，能夠架構用AI演算法模型來做天氣預測的團隊。他們目前仍在解決方案打造的前期，而我們將從市場的角度，協助他們將解決方案商業化。本研究採用半結構式的訪談作為研究方法，招募5位受訪者，並且根據他們具備的資格，分別讓他們參加相應的3個訪談，包括：給氣象專業研究員的訪談、給企業客戶的訪談，以及給個人用戶的訪談。我們使用價值主張畫布的理論，在調查企業客戶及個人用戶的任務、獲益和痛點之後，我們針對如何為他們打造有效的解決方案提出建議。此外，我們使用科學溝通策略作為指引，來發展改良使用者體驗的洞見，希望由此發展良好的顧客關係，並進一步開拓潛在的客戶群。"
    },
    {
        "resulNum": "9.",
        "title": "冬春季連續弱綜觀天氣日細粒狀汙染物在台灣複雜地形背風側之分布",
        "link": "https://hdl.handle.net/11296/us9ab5",
        "description": "本研究使用觀測資料和高解析模式，探討細懸浮微粒濃度(fine particulate matter, PM2.5)的空間分布在台灣冬春季連續弱綜觀天氣下的變化。根據台灣天氣型態資料庫、地面降雨和位於台灣東南風場下的上游測站石垣島探空資料，在2008至2019年台灣冬春季中，有302天被定義為弱綜觀天氣型態。另外，將台灣各個地面空氣品質測站的日均PM2.5濃度與各個測站該年冬春季均PM2.5濃度的比值定義為各測站的PM2.5比率，再計算弱綜觀天氣的日子下各個地面測站PM2.5比率大於1的頻率，此無因次頻率指標(無單位)代表各個測站在弱綜觀天氣下PM2.5相較於季節背景的加強程度。在弱綜觀天氣下PM2.5被增強的高頻率(大於0.65)測站位置，和背景東南風場下的背風側弱風區域相符。在連續弱綜觀天氣的日子下，台灣區域綜觀風場會由東南東風向轉為南南東風向，而位於背風側測站的頻率指標也會提高至大於0.8；此外，在連續弱綜觀天氣下，台北盆地PM2.5加強的頻率會在第二天大幅增加。觀測分析結果顯示連續弱綜觀日在台灣北部的日均PM2.5相較於各個測站冬春季背景有最顯著的增加；此外，在台灣複雜地形下，上游風場的風向改變對於背風側局地環流有重要的影響，並且會進一步影響粒狀汙染物在背風側的分布和傳送方向。為了進一步探討背景風場的方向轉移對細粒狀汙染物傳送的影響，我們利用"
    },
    {
        "resulNum": "10.",
        "title": "比較極端天氣條件下，探討塑膠微粒之豐富度與分布概況：以臺灣東北角為例",
        "link": "https://hdl.handle.net/11296/aynew4",
        "description": "近年來，社會大眾以及科學家們對於塑膠垃圾汙染的相關議題越來越重視，然而大多數的相關研究往往著重於模型分析以及電腦模擬，而忽略了野外實地獲取真實樣本的數據。我們致力於瞭解塑膠微粒與極端天氣事件 (如：颱風) 的關聯性。塑膠微粒的採樣地點位於新北市貢寮沙灘，為台灣人口最為稠密的縣市之一。採樣從2018上半年年開始至2019年年底附近，總共合計採樣九次；為達成完整時序的目的，包含了四個季節，其中每個季節至少有兩次以上的採樣。本論文裡要探討的塑膠微粒的在貢寮海灘一帶的數量多寡及分布，並分為1 – 5毫公分 (microplastic) 及 5 – 25毫公分 (mesoplastic) 兩個族群。在這些樣本中，觀察到極端天氣或是颱風之後的採樣，皆能觀察到塑膠微粒的汙染程度增加以及數量上升。論文內所提及的三個颱風皆有被中央氣象局發布過海上及陸上颱風警報。其中又以米塔颱風距離貢寮海灘最近，強烈的暴風圈影響之下，採集到的塑膠微粒1 – 5毫公分合計1837個、塑膠微粒5 – 25毫公分合計221個。塑膠微粒的汙染程度屬於2019年10月2日米塔颱風來襲之後採集到的最為嚴重，達到70.65個塑膠微粒每0.25平方公尺；於2018年4月27日乾季的塑膠微粒汙染程度較輕，僅7.96個塑膠微粒每0.25平方公尺。都市逕流、下水道排水系統、工業發展、觀光以及漁業活動是個大幅提高在颱風季裡塑膠"
    },
    {
        "resulNum": "11.",
        "title": "基於深度學習之天氣雷達回波強度預測與評估：以台灣地區做實證",
        "link": "https://hdl.handle.net/11296/j2tjy4",
        "description": "目前中央氣象局使用雷達回波外延法推估降水預報，但是大氣系統為複雜非線性，而外延法預報法採用簡單外推計算雷達回波強度，導致預報能力會隨時間拉長而快速下降。深度學習中的時空序列模型能同時捕捉氣象資料的時空關係，逐漸被應用在雷達回波預測。然而，雷達回波變化複雜且高強度回波資料不足，容易導致高強度回波預測不準確，且有低報的問題。文獻中，有學者提出將預測遞歸神經網路時空序列模型結合雙重注意力機制之模型，在雷達回波預測上有不錯的效果。因此，本研究會修正上述模型之超參數，並以加權損失函數取代此模型的損失函數來解決資料不平衡問題，建立一個適合台灣周遭範圍的雷達回波預測模型。在加權損失函數中，本研究根據台灣天氣變化及本研究提出模型，找出雷達回波強度分類和對應的權重值。最後，建立之雷達回波預測模型會對全臺未來一小時雷達回波強度進行預測，再和氣象局現行預報作業結果進行比較。本研究將針對資料量與加權損失函數權重的相對關係進行實驗，建立最佳預測模型，並在四個不同天氣變化型態的個案中進行測試，藉由和觀測結果、外延預報法預報結果的比較，驗證模型是否具有泛化能力。實驗結果顯示，個案一為局部降雨，本研究提出模型相較於雷達回波外延預報法，在門檻值40和45時，CSI改善程度分"
    },
    {
        "resulNum": "12.",
        "title": "季節性銷售： 探討房屋交易和天氣因子對家用冷氣機銷售的影響",
        "link": "https://hdl.handle.net/11296/2b263y",
        "description": "有效的前進部署，能夠控制銷售中的投入以及降低損失，掌握產品以及物流的安排。對於季節性產品來說，他們本身具有銷售週期，而週期不全然是完全相同，有時也會受到外在條件的影響而提早或延後。此外，不單是季節時間影響銷售，進一步理解真正影響季節性的原因很重要，以便在進入市場的最佳時機前，做好前進部署。本研究以家用冷氣機的銷售為研究目標，將房屋交易和天氣因子作為探討影響銷售的因子。本研究運用多元迴歸分析，分別採用虛擬變數和固定效果模型等方法，從不同觀點探討這些因子如何影響家用冷氣機的銷售。同時，特徵價格模型也在本研究中運用，分析異質性產品的特徵和價格的彈性。結果顯示，房屋交易和相關天氣因子對家用冷氣機的銷售具有影響力。另一方面，節能指標的產品特徵、年耗電量，以及機台樣式(窗型、分離式、一對多分離式)等特徵明顯地對家用冷氣機的價格有影響。這也反映出當今的節能政策，以及家用冷氣機的購買傾向。基於這些分析結果，在考量外部因子的變化後，可以建立前進部署策略，以便掌握家用冷氣機市場的銷售。"
    },
    {
        "resulNum": "13.",
        "title": "結合衛星近海表面風場與多雷達觀測對反演劇烈天氣系統之動力結構的影響：OSSE實驗",
        "link": "https://hdl.handle.net/11296/npwdt8",
        "description": "本研究主要目的為同化衛星近海表面風場以改善洋面低層大氣之三維 動力場，因此設計一系列實驗組檢驗其帶來之效益。透過觀測系統模擬實 驗(Observing Systems Simulation Experiment, OSSE)，並利用多都卜勒雷達 風 場 合 成 方 法 (WInd Synthesis System using Doppler Measurement, WISSDOM)，以數學變分法極小化各項約束條件以反演三維風場，故設計 二理想個案探討同化衛星近海表面風場並搭配雷達觀測以檢驗對底層三維 風場之影響，第一個是2013年06月23日在台灣南部外海之西南氣流個案， 第二個是2017年06月01日在台灣北部外海之梅雨系統個案。西南氣流個案結果說明同化衛星觀測風向及風速能大幅改善第一層水 平風場，並將其資訊向上傳遞至較高層大氣;梅雨系統個案則顯示只同化 衛星觀測風速對風速能夠大幅改善，但對底層大氣改善程度有限。從二理 想個案指出同化衛星觀測點數量越高，改善底層風場的效果越佳。本研究的優點是新增同化衛星觀測方法並改善低層大氣動力結構。並 期望未來能探討衛星觀測對熱動力場及數值天氣預報的影響。"
    },
    {
        "resulNum": "14.",
        "title": "預測PM2.5等級與降雪天氣型態之深度神經網路比較與優化",
        "link": "https://hdl.handle.net/11296/m38s8w",
        "description": "本論文使用八種電量數據來預測降雪天氣型態，以及使用多種空汙因子濃度數據來預測PM2.5等級。過去在降雪天氣型態的預測，我們分別使用八種電量數據來訓練各個長短期記憶模型，而一次使用全部八種電量數據來訓練分類器。接著將長短期記憶模型的預測值輸入到分類器進行預測。雖然得到很高的預測準確率，但是預測不降雪的準確率為98.34%，而預測降雪的準確率為0%。為此我們使用六種數據平衡方法重新訓練分類器，雖然可以改善預測降雪的準確率，但同時會降低預測不降雪的準確率。因此我們改為一次使用八種電量數據來訓練長短期記憶模型，並且在模型最後的全連接層加上softmax激活函數以取代分類器。為了嘗試改善準確率，我們進一步利用了粒子群最佳化來優化一維卷積神經網路與長短期記憶模型的結合。過去在PM2.5等級的預測，我們分別使用三種空汙因子濃度數據來訓練各個長短期記憶模型，而一次使用全部三種空汙因子濃度數據來訓練分類器。接著將長短期記憶模型的預測值輸入到分類器進行預測。為了嘗試改善準確率，我們使用粒子群最佳化演算法來優化一維卷積神經網路與長短期記憶的結合，並在模型最後的全連接層加上softmax激活函數以取代分類器。我們也比較了其他深度神經網路模型，一次使用三種或五種空汙因子濃度數據來訓練"
    },
    {
        "resulNum": "15.",
        "title": "用於可再生能源應用的低成本天氣數據採集系統開發",
        "link": "https://hdl.handle.net/11296/7tggch",
        "description": "本論文研製之在開發低成本的天氣數據採集系統。小型化的5軸自由度機械臂部署為太陽運動的機械接口。迷你太陽能面板和攝影鏡頭連接到末端執行器的機械臂。 捕獲天空圖像以進行對齊調整太陽能電池板的關節角度，將微型太陽能電池板暴露在太陽下機械臂。迷你太陽能電池板的功率輸出為太陽輻射照度是實時估算的。嵌入式處理器控制該系統。系統能夠實時追踪太陽，而且成本低廉有助於為複雜的應用提供低精度替代方案昂貴的感測器。在本論文中，進一步提出了基於熱傳導原理的風速風向測量系統開發。安裝在恆溫加熱器上的散熱器作為測量風速和風向的接觸零件，而安裝在散熱器頂部的紅外線陣列模組用於收集溫度數據。將從紅外線陣列模組收集到的溫度數據用於訓練人工神經網絡。使用提出的感測器收集風速和風向數據，並使用傳統的旋轉式風速計、風向計作為測量的基準參考。將數據分為兩部分，用於訓練神經網絡的96小時數據和用於執行準確性測試的72小時數據。將所提出神經網絡模型的性能、線性回歸和支持向量機模型進行比較。此外，所提出設備的整體精度表明它可以成為傳統旋轉風速計和風向計的可行替代方案。通過結合提出的太陽輻射照度、風速風向測量系統，建構出低成本天氣數據採集系統。"
    },
    {
        "resulNum": "16.",
        "title": "天氣、都市綠地特徵與公共自行車使用之關聯性",
        "link": "https://hdl.handle.net/11296/w54ejy",
        "description": "隨著都市化程度日漸攀升、人口不斷往都市集中，導致市區的生活環境變得擁擠，也使綠地空間的重要性逐漸提升。都市綠地能提供民眾宜人的休憩空間，並提升通勤路程的舒適程度，其產生之效益不容小覷。過往以都市綠地為研究主題的文獻，多著重於探討綠地與身體、心理健康之關聯性，或是分析綠地在不同大小、品質、距離等條件下，和民眾身體活動行為是否相關等等，較少專注於研究都市綠地與自行車使用之間的相關情形。此外，現有文獻針對此議題的探討，大多透過有限的問卷調查來瞭解自行車道的綠地環境對騎乘行為之影響，缺乏直接以自行車租用的大數據作為研究資料。故本研究欲透過對臺北市公共自行車(YouBike)租借紀錄資料的分析，以探討都市綠地特徵與公共自行車使用之關聯性。本研究首先針對天氣資料與公共自行車租借量進行分析，發現使用者確實會因為炎熱天氣而降低騎乘自行車的意願。而為了瞭解都市綠地環境如何影響騎乘條件以緩解熱天對公共自行車租借量的負面影響，本研究將都市綠地分為綠地組成面積與綠蔭條件兩項目進行分析，前者利用國土利用調查中公園綠地廣場、農業利用土地等組成，計算站點周邊綠地面積大小，以探討其是否會影響民眾的休閒遊憩意願；後者則計算站點周邊及行經路段周邊的行道樹密度與NDVI值，以分析綠"
    },
    {
        "resulNum": "17.",
        "title": "天氣變數對網路團購銷售之影響—以T公司為例",
        "link": "https://hdl.handle.net/11296/8nsh3y",
        "description": "因網路快速發展，全球上網人數持續增加，網路不僅改變了傳統零售業的型態，隨著消費者的消費行為改變，零售業結合電子商務已經成為趨勢了。在面對龐大的商機，網路團購也成為新的商業模式。本研究將利用台灣網路團購網站的交易資料做為研究標的，並使用中央氣象局的氣象觀測資料，與消費者交易資料結合，來補充過去文獻缺少網路團購與天氣相關的研究。運用機器學習找出最理想的預測模型，來協助電商平台進行行銷。對於本個案線上團購平台整體而言最重要之天氣變數是體感溫度和日照時數。高體感溫度類主要受體感溫度影響，其次是相對濕度，低體感溫度類中重要性最高之變數為風速，其次為體感溫度。期望透過添加天氣變數，可以提高線上團購銷售預測，並由研究結果發現體感溫度為重要之天氣變數，因此本研究增加其分析多元性。"
    },
    {
        "resulNum": "18.",
        "title": "數位遊戲融入自然科教學對國小三年級學習成效與學習動機之影響-以認識天氣單元為例",
        "link": "https://hdl.handle.net/11296/ppe3yk",
        "description": "　　本研究旨在探討數位遊戲學習融入國小三年級自然與生活科技學習成效與學習動機之影響。研究對象為研究生任教之國小三年級學生，本研究實施國小三年級班級共兩班，一班23人為實驗組接受數位遊戲教學融入自然與生活科技科目中；另一班21人為對照組進行傳統教學。而在教學實驗後進行學習成效測驗，並進行獨立樣本t檢定；學習動機量表則在教學實驗前進行前測、教學實驗後進行後測，並進行單因子共變量分析。　　實驗組教學過程中使用之數位遊戲軟體為研究生自行開發的數位遊戲，遊戲內容是依照國小三年級第二學期南一版自然與生活科技第四章認識天氣之單元來製作，遊戲遊玩方式是2D卷軸冒險類遊戲。遊戲開發使用資訊系統開發模式之瀑布模式進行開發，而介面設計部分參考Nielsen(1993)所提出使用性工程(usability engineering)之概念進行設計。在程式部分則是使用遊戲設計模式(Design Patterns)中GoF提列的23種模式的State狀態模式與Strategy策略模式。　　本研究結果如下：一、使用數位遊戲融入自然與生活科技領域對於實驗組與對照組之學習成效上未達顯著差異，然而，實驗組學習成效較對照組高分，顯示數位遊戲具有一定功效。二、使用數位遊戲融入自然與生活科技領域對於實驗組與對照組之學習動機上達顯著差異。　　根據研究結果，本研究提出數位遊戲式學習之建"
    },
    {
        "resulNum": "19.",
        "title": "考慮多種數值天氣預報及資料前處理程序之風力發電預測研究",
        "link": "https://hdl.handle.net/11296/v22u44",
        "description": "風力發電是間歇性能源，因此會導致電力系統的可靠性和穩定性產生負面影響，準確的風力預測是目前最有效的解決方法，與確定性預測相比，機率性預測可以提供有關風能不確定性的資訊，有助於降低電網的運行與維護成本，並大幅增加電力系統的可靠性。目前許多研究利用數值天氣預報（NWP）與風能的歷史資訊進行風力發電的預測，但忽視了資料前處理的重要性。本論文利用台灣中央氣象局（CWB）獲得的三種不同的數值天氣預報數值進行時間序列組合，與福海氣象塔真實資料進行比對，挑選出最佳的時間序列。接著利用常見的訊號前處理方法：主成分分析與經驗模態分析，突顯出數值天氣預報的特徵，最後使用台灣澎湖縣的湖西風場提供的風力發電站資料以及三種不同的數值天氣預報進行決定性預測與機率性預測，利用兩種預測模型分別是極限梯度提升決策樹(XGBoost)與人工神經網絡（ANN）進行比較與分析。在機率預測模型方面皆採用是上下限估計法，此方法可直接從輸入資料中直接預測出50-90%的預測區間(PI)，研究結果指出本文提出的預測模型在極限梯度提升決策樹(XGBoost)與人工神經網絡（ANN）皆能有良好的表現。"
    },
    {
        "resulNum": "20.",
        "title": "以天氣資訊結合資料探勘技術預測藥品耗用量",
        "link": "https://hdl.handle.net/11296/zd64cy",
        "description": "本研究利用資料探勘的方式，以天氣資訊預測易受天氣影響的四種類型疾病之藥品耗用量。四種藥品為心臟血管系統用藥、皮膚科用藥、全身性抗感染用藥與呼吸系統用藥。實驗將採用最近鄰演算法、類神經網路、支持向量迴歸及決策樹四種演算法。期望能夠透過資料探勘的方式來確認這四類藥品耗用量是否確實受到天氣因子變化而影響，進而確認是否能透過歷史天氣資訊來預測藥品使用量。未來希望能夠運用在藥品庫存耗用中做為相關藥品類別訂貨量的參考數據之一。"
    },
    {
        "resulNum": "21.",
        "title": "結合不同高緯電位模式之太空天氣資料同化系統於2015年聖派翠克節磁暴的現報和預報比較",
        "link": "https://hdl.handle.net/11296/t45622",
        "description": "劇烈的太陽磁暴所造成之電離層擾動會影響人類活動及民生系統，如定位與導航、電力或高頻通訊系統等，因此要如何準確地預測電離層在磁暴時的狀態是目前重要的課題。本研究使用資料同化的技術發展一套太空天氣預報系統 — Data Assimilation Research Testbed / Thermosphere-Ionosphere-Electrodynamics General Circulation Model 2.0 (DART/TIE-GCM 2.0)，將全球地面GPS觀測之全電子含量運用系集卡爾曼濾波的方法 (由同化軟體DART執行) 同化至電離層物理模式TIE-GCM 2.0中，以重建2015年3月聖派翠克節磁暴的電子濃度三維結構與預報；再進一步於DART/TIE-GCM 2.0系統中結合Heelis、Weimer和AMIE三種不同的高緯度電位模式，並以方均根誤差以及方均根誤差百分比來評估這三個模式於此次磁暴事件，在低、中和高磁緯度地區的預報能力。研究發現造成此三個模式之電子濃度預報的差異不僅受高緯度能量輸入的影響，也和F層的緯向電場、F層傍晚的風場以及中性大氣組成，尤其是氧原子和氮分子的比值有重要的關聯。"
    },
    {
        "resulNum": "22.",
        "title": "應用卡爾曼濾波於車用光學雷達在惡劣天氣下訊號改善之研究",
        "link": "https://hdl.handle.net/11296/8w3pek",
        "description": "目前自動駕駛汽車主要問題之一就是光學雷達受到惡劣天氣如大雨、下雪、濃煙、濃霧等影響回波的偵測能力會大幅衰減，真正訊號往往非常微弱或淹沒在大量的雜訊中，影響光學雷達判斷外面環境，導致自動駕駛汽車無法行駛，所以急需解決這個問題，以便提高後期立體影像準確性，本研究提出了結合卡爾曼濾波器與鄰近點雲分割演算法應用光學雷達在惡劣天氣中數據改善，實驗整體架構是光學雷達在一個長與寬2公尺、高0.6公尺的空間內進行測試，在模擬正常天氣與三種惡劣天氣下（雨天、濃霧、雨天及濃霧）進行實驗，本研究結果可由光學雷達在惡劣天氣量測的數據還原正常天氣的數據，能有效改善光學雷達立體影像，本研究方法的改善率在10%至30%之間，未來這種方法可大量發展運用在光學雷達的技術上。"
    },
    {
        "resulNum": "23.",
        "title": "以機器學習理論建置氣候因子和天氣災害因子與潛在水稻損失預測模型",
        "link": "https://hdl.handle.net/11296/3fy733",
        "description": "聯合國指出21世紀極端的氣候將會更頻繁與廣泛，氣候變遷所造成的災害已成為全人類的安全問題。近年人工智慧(AI)的興起及機器學習(ML)應用，在環境應用方面的影響也不遑多讓。在農產業水稻方面，雖有天氣預測支援農民進行相關防護措施，但突如其來的天災降臨時，造成的水稻損失是逐年增加。若能提早得知天災造成的水稻潛在損失，即能提早做好災前的應變，減少人民財產損失。本研究旨在導入ML之概念，利用ML軟體，如：SPSS，做環境衝擊因數對水稻造成的災害預測及氣候模擬分析。將氣象因子及天然災害因子列為變數，再藉由獨立樣本T檢定及類神經網路進行變數篩選。利用機器學習理論基礎之決策樹進行模型訓練，並使用特徵曲線(ROC)圖及曲線下面積(AUC)衡量模型的準確度及預測價值，再利用IPCC RCP 4.5預測值進行長短期預測。本研究所得決策樹結果共有四種模式，做為水稻潛在損失之長短期預測使用。在短期預測之結果方面單一月份預測成果和實際值差異過大，但單一事件的預測結果卻很精準，水害可使用模式一；寒害可使用模式三；病蟲害可使用模式二。而在長期預測分析結果共有兩部分：第一部分(2020)結果得知，預測值與實際值差異率為83%。相較於以觀測值進行水稻潛在損失金額的預測結果優，表示此模式適合以未來氣象預測值進行水稻潛在損失的預測。第"
    },
    {
        "resulNum": "24.",
        "title": "天氣對股票報酬的影響：以台灣股市為例",
        "link": "https://hdl.handle.net/11296/buurmj",
        "description": "天氣是影響人類情緒的重要因素，因此可能影響投資人在股票市場中的行為。本研究旨在探討股票報酬與天氣變數之間是否存在關係，以溫度、濕度和雲量三項天氣變數在不同期間對台灣股市的影響。研究期間為2018年1月15日至2019年7月16日之日資料，使用ADF單根檢定、GJR-GARCH模型等方法。將樣本期間分為兩個期間，分別探討在不同期間下的天氣與股票報酬的關聯性。實證結果顯示，在全部樣本期間，溫度與雲量具有顯著影響，其中以溫度的影響最為強烈。在美中貿易戰的前期，不存在天氣的影響，而在後期，天氣變數對股票報酬皆有影響，其中以雲量最具影響力，即雲量越少時，股票報酬會越高。至於在模型估計的部分，在股票波動方面，存在不對稱效果，當市場有壞消息時，股票報酬的波動會上升，在條件變異數中涵蓋天氣變數有助於對GJR-GARCH模型的建模。針對交叉影響的部分，天氣變數的交互作用確實佐證天氣影響，並以濕冷的天氣在不同期間皆有影響。整體來說，天氣確實對股票報酬有影響，有助於投資人作決策。"
    },
    {
        "resulNum": "25.",
        "title": "應用資料探勘技術探討天氣及空氣品質因子於營造工程人員重大職業災害之影響",
        "link": "https://hdl.handle.net/11296/4a2y69",
        "description": "營造業屬於高風險產業，根據我國勞動部勞動檢查年報針對近十年(98-107年)全產業職災千人率調查結果顯示，營造業職災千人率高居第一位(12‰~16‰)，明顯高於其他產業。勞工安全措施方面多數較注重於施工安全設備以及職業安全衛生之教育訓練。然而近年政府因應高溫氣候以及空氣品質惡化可能引發職災發佈相關預防指引，可見環境因素對於職災發生有一定影響程度。本研究蒐集2007至2019年營造業職災案例，並結合天氣及空氣品質資料共1725筆。採用MATLAB作為分析工具，以資料探勘方法挖掘天氣及空氣品質因子於營造業職災之分布及相關性，以及是否存在特徵及可預測之模型。研究結果顯示營造業勞工於整體職災發生機率為男性(3.915‰)略高於女性(3.306‰)。男性勞工於多數職災之發生機率高於女性，其中女性勞工發生「跌倒」、「物體飛落」以及「不當動作」之機率高於男性勞工。而各類型職災中墜落、滾落發生比例最高，其中男性勞工發生墜落、滾落之機率(1.061‰)明顯高於女性(0.796‰)。勞工年齡方面15至24歲以及50歲以上營造業勞工職災發生率較高。而各項職災中以墜落、滾落及跌倒與年齡有明顯之趨勢關係，勞工年齡介於15歲至59歲之間，其發生機率隨著年齡增加而上升。營造業職災好發時段方面為上午8點至11點以及下午1點至4點之間所發生之職災案例數"
    },
    {
        "resulNum": "26.",
        "title": "應用公車和機器學習實現即時天氣監控與預測",
        "link": "https://hdl.handle.net/11296/7dq8s8",
        "description": "準確的天氣數據對於規劃我們的日常活動來說非常重要。為了要檢測和預測天氣資訊提出了一個兩階段的天氣管理系統，該系統結合訊息處理、公車移動性、感測器和機器學習技術來提供即時天氣監測和預報。基於公車量測的結果，這項工作包含本地訊息處理和公車移動性的優勢，以增加量測範圍並提供新的感測數據。在第一階段，給定天氣感測數據，使用測試環境的溫度、濕度和氣壓值來訓練和驗證在遞歸神經網路(RNN)中的LSTM模型上。在第二階段，將訓練的模型應用於預測時間訓練的天氣資料。為了要評估系統效能，我們將預測天氣數據與環境保護局(EPA)台中觀測站的實際感測數據比較以評估感測的準確性。從結果來看，所提出的系統在天氣監測方面具有可靠的性能，且通過訓練完的模型可以很好的預測一天的天氣預報。"
    },
    {
        "resulNum": "27.",
        "title": "一個基於行車紀錄器影像與深度學習神經網路的天氣分類系統",
        "link": "https://hdl.handle.net/11296/wy7duk",
        "description": "天氣狀況不僅影響我們的日常生活，對於像是戶外監視、車輛駕駛輔助等各種運用視覺的系統也都有影響。目前視覺系統多數建立在視覺情況良好的情況下，像是光線充足、影像清晰等，但是實際情況卻不是這樣，多變的天候狀況(像是下雨、下雪以及起霧等惡劣天候)都會使視覺系統受到影響，因此視覺系統應該具備能夠判斷當下天氣狀況的能力，以做出相對應的處理，提高系統效能。現今，天氣分類的任務多數依靠昂貴的感測器來完成，且要偵測特定的天候都需有相對應的感測器，例如：霧偵測儀、雨水感測器等。為了降低設備成本，且避免使用眾多儀器，我們希望統一使用電腦視覺技術來偵測所有天候狀況，透過最常見的鏡頭所拍攝的影像，來精準地對天氣情況進行分類。在本論文中，我們探討如何使用VGG16 和Resnet50 這兩種深度學習網路，將天氣影像分為四類(雨天、雪天、霧天與晴天)，最後將此技術應用於行車紀錄器影像中。實驗結果顯示：VGG16 的執行速度比ResNet50 快了約1倍，且兩者在單張畫面天氣分類的準確度上都可達到93%以上；而若以連續的多張畫面為天氣分類依據，則VGG16 的準確度甚至可以達到100%，因此VGG16 在行車紀錄器自動天候分類上是極佳的選擇。"
    },
    {
        "resulNum": "28.",
        "title": "應用虛擬實境於天氣視覺化之創作",
        "link": "https://hdl.handle.net/11296/h9whu6",
        "description": "現在已經進入大數據的時代，如何將這些資料呈現出來，並告訴人們是非常重要的議題，且資料的複雜性也越來越高，要呈現這些高維度的資訊還是一大難題，筆者希望透過虛擬實境來解決，虛擬實境資料視覺化具有提供更容易的模式來辨識資料，可以呈現傳統圖表無法呈現的資料維度。當資料轉換後，可在三維空間中呈現時，可以通過使用顏色、形狀、物件、動畫、物理效果等來理解更多的數據維度。除了平時熟悉的二維圖像，它們還具有不同的視角，讓人們更直觀的數據理解以及對數據中直覺感知關係的更好解釋。作者認為這方面可以透過虛擬實境來實現，利用虛擬實境或增廣實境的技術來呈現數據，透過更加真實的模擬環境，將抽象的數據與虛擬世界互動，不僅單只是數據呈現，多了與資料的互動性，讓體驗者可以更快速了解天氣的感受。本創作目的將天氣資訊以真實模擬的方式呈現出來，讓體驗者相信虛擬世界所建構出來的天氣，就是那刻的天氣，根據尚．布希亞 (1981)的擬像論透過電腦科技所模擬出來的環境，比讓日常生活的體驗還要更豐富也更具吸引力，超現實的環境是根據現實世界環境的多媒體模擬，比真實還要更有真實的感覺，對觀者而言影像才真實，實際上的實體是否存在已經不重要了 。筆者想透過高端電腦影像的圖形運算能力，重現天氣環境讓體驗者感受由虛"
    },
    {
        "resulNum": "29.",
        "title": "天氣對審計品質的影響",
        "link": "https://hdl.handle.net/11296/pc6g84",
        "description": "本研究主要探討天氣狀況對審計品質的影響。跳脫審計文獻過往思維融入心理學觀點，參考行為財務學文獻使用會計師事務所分所城市之雲量覆蓋值做為天氣變數來衡量審計人員之心情，藉以連結與審計品質的關聯性。實證結果顯示去除季節性影響後，天氣狀況與審計品質呈正相關，天氣狀況愈晴朗(雲量覆蓋值愈低)誘發審計人員心情更加愉悅，產生樂觀積極正向的想法，誠實地遵守道德決策，增進其獨立性，並提高其生產力、自信心與解決問題的能力，進而提升審計品質。此外，額外實證發現具產業專精之審計人員的審計品質較不受天氣狀況影響。"
    },
    {
        "resulNum": "30.",
        "title": "天氣是否影響會計師的報導決策？",
        "link": "https://hdl.handle.net/11296/d2q4e8",
        "description": ",,天氣是否影響會計師的報導決策"
    },
    {
        "resulNum": "31.",
        "title": "天氣因子與電子商務平台產品銷售量關係－以尿布產品為例",
        "link": "https://hdl.handle.net/11296/cv54z9",
        "description": "過往有許多研究探討那些影響人們消費決策的因素，而關於外在環境的探討無可厚非的就會提及到天氣。天氣為一非常特殊的自然系統，不管是對經濟活動或是日常生活皆有巨大影響力；對於零售業而言，不少產品都會因天氣狀況不同而有大幅的銷量變動，例如冷氣機、電暖器以及像是一些日常生活必需品等。近年來，消費管道已不僅僅侷限於實體通路，時代的演進促成電商的崛起，更改變了人們的生活，在幾乎人人都有過網購經驗的現代社會，天氣是否還會影響人們在消費上的決策即是本研究欲想探究的問題。本研究以日常快速消費品－尿布為研究標的；在研究樣本單位上，筆者縮小至全台的第三級行政區位－鄉、鎮、縣轄市、區，並以距離該地最近的氣象站觀測數據做為該地天氣因子數值。資料期間為2018年10月1日至2019年10月7日，為期一年多的每日交易資料。在控制銷售量之時間趨勢、各地0~5歲人口數後，並使用固定效果模型加以分析，而後再以季節區分和交互作用解析下，研究結果發現，電商平台上所販售之民生必需品仍有「1°C效應」，當氣溫比起平均氣溫上升1°C時，銷售量會減少0.3%，而此效應在夏季尤其明顯，並會隨著降雨量、相對濕度狀況不同而有所改變。"
    },
    {
        "resulNum": "32.",
        "title": "使用家居電力數據預測降雪天氣型態",
        "link": "https://hdl.handle.net/11296/7umbre",
        "description": "降雪天氣會對於交通與農業方面產生影響，甚至造成生命及財產的損失。長期以來，降雪一直被認為是導致冬季失事率上升的主要原因，同時國外研究也證實降雪的嚴重性對交通事故發生有一定的影響力。像是馬路上如果積雪過深就會阻礙交通，而薄薄的雪覆蓋在上面容易打滑導致交通事故的發生。降雪還容易壓碎植物或凍結非耐寒性植物，造成農業損失，房屋破碎，並造成人員和牲畜傷亡。如果我們能有效的預測未來是否降雪，則可以減少或避免這類損害的發生。當降雪的時候，往往會減少人們的戶外活動。相對的因為待在室內的時間變長，所以會增加各類電器的用電量。本研究提出了一套機器學習方法，該方法使用家用電器用電量數據訓練LSTM和分類器模型，然後分類器使用LSTM預測結果對是否下雪進行分類。我們引入RMSE及R^2來評估預測結果並比較六種LSTM模型，發現六種LSTM皆有良好及相似的準確度。對於預測各種用電量的LSTM模型，我們利用模型參數(Params)來找出最低訓練成本的模型。五種分類器的準確率皆高達98.34％，但因為數據呈現不平衡的問題，所以計算不降雪與降雪的個別準確率時可以發現預測不降雪的準確率幾乎皆高達100％，但降雪的預測準確率皆為0％，以至於無法透過降雪預測來達到防災的效果。因此我們透過刪除不降雪數據的六種方法將原始數據作平"
    },
    {
        "resulNum": "33.",
        "title": "無須重訓練模型之多變壞天氣交通物件偵測方法",
        "link": "https://hdl.handle.net/11296/ewy9fy",
        "description": "近年來針對智慧交通的研究越來越多，例如交通燈號調控、自動駕駛等，這些研究主要是為了提高安全性和降低事故發生。其中交通調控常以人工方式進行，但無參考相鄰路口時容易導致車流更為混亂，若駕駛者能提早得知各路口車流，提早更換路徑或交通號誌提早自動調整燈號，即可有效紓解交通進而達到道路安全。在分析車流上先進行物件偵測，接著才可利用物件資訊達成車流分析，而物件辨識主流目前以機器學習為主，因此本論文提出了基於深度學習之輔助物件偵測演算法，以傳統電腦視覺方法輔助和增強深度學習。本論文中將自適應產生有效背景描述圖，經由自適應背景和當下畫面，可觀察出深度學習物件偵測所遺漏的交通物件，且同時利用場景分割取得自適應ROI約束物件出現範圍，而後過濾有效物件，同時降低重覆框在同一物件上的可能性，最後以達有效提升在多變場景中的物件偵測準確度和降低誤框之可能性。"
    },
    {
        "resulNum": "34.",
        "title": "運用Arduino與Raspberry Pi結合ThingSpeak實現校園環境天氣監測系統",
        "link": "https://hdl.handle.net/11296/u9g7jt",
        "description": "近年來地球暖化與空氣汙染因素，許多人因沒有注意室外溫溼度與空氣品質而造成身體的熱傷害及呼吸道過敏症狀，教育部校安中心依照中央氣象局的氣象預測與環保署的空氣品質監測，提醒校園師生注意當前環境天氣因素，視情況判斷是否減少戶外活動。本論文主要是運用物聯網的概念，提供一個能在校園實現監測環境天氣的系統；本研究提出的監測系統使用Arduino MEGA 2560作為開發板，配合各式感測器監測校園內的環境天氣數值，再透過Wi-Fi模組ESP8266將資料上傳至資料庫，並運用Raspberry Pi 3 B+與網路攝影機觀看校園環境的即時影像，最後以網頁來實現校園環境天氣監測工作。網頁方面與IoT-ThingSpeak的API結合，並運用ThingSpeak雲端平台提供的MATLAB運算介面，判斷是否通報校園師生減少戶外活動，目的為打造一個方便監測校園環境天氣的監測系統，避免校園師生有熱傷害事件及呼吸道過敏症狀的發生，以利維護校園安全。"
    },
    {
        "resulNum": "35.",
        "title": "天氣對保險購買行為之影響分析",
        "link": "https://hdl.handle.net/11296/7p7j6u",
        "description": "行為財務學主張天氣對於投資人情緒與風險判斷有顯著影響，天氣會影響消費者的心情與情緒，進而影響消費者對風險的偏好與判斷，根據文獻指出晴朗的天氣與樂觀的情緒有關，會使消費者增加對風險的偏好，此即「陽光效應」。本文主要探討保險是否也會受到天氣影響而產生天氣效應，天氣是否影響要保人情緒，進而影響風險偏好而反映在保障額度的選擇上，以驗證陽光效應是否一樣存在與於保險消費行為中。本文以回歸模型檢定某壽險公司實際投保2015-2019年間的傷害保險資料，分析保戶投保金額與天氣因子之間的關係。行為財務文獻發現天氣越好，導致越樂觀也越積極投資的「陽光效應」，但實證結果顯示保險交易中，則存在天氣越不好，導致情緒低落風險意識提高投保更高保險金額的行為。由於陽光此時與保險金額之間為反向關係，為避免混淆，本文將此陽光對保險金額之影響稱為「烏雲效應」。同時文中也將天氣資料進行分群並連結至要保人的情緒，分別探討在該情境下要保人對於陽光以及其他不同天氣因子的反應。根據本文的實證結果，未來保險公司在銷售商品時，建議可以針對不同的情境來因應消費者不同的情緒，並根據陽光及其他天氣因子的差異來調整行銷策略。"
    },
    {
        "resulNum": "36.",
        "title": "導入AI機器學習之天氣預測系統專題課程對高中學生AI學習成效影響之研究",
        "link": "https://hdl.handle.net/11296/j74bs6",
        "description": "近代人工智慧的技術快速成長，商業應用的領域與範圍也隨之擴大，然而在高中教學現場中，仍少見可引導學生實際應用人工智慧技術的課程。本研究之目的，在於研發以「機器學習」為主題的人工智慧專題實作課程，課程內容以天氣預測為目標，依據Burke的6E教學模式進行設計，以機器學習中「監督式學習」為課程的主軸，規劃兩大實作單元。核心內容主要是透過Arduino、感測器等硬體設備，實現資料蒐集與狀態顯示，並導入機器學習演算法的實作，以Python程式語言實現之。研究對象為南部某公立高中二年級自然組、及社會組學生為研究對象共 68名；主要研究變項為「人工智慧」知識概念的理解、運算思維、及學習態度。資料分析採量化統計為主（含描述統計、t考驗、ANCOVA），質性分析為輔的方式進行。依據研究結果與討論，本研究提出結論與建議如下：一、本研究之「機器學習」實作課程，有助於學生在「人工智慧」基礎概念的知識理解。二、在參與「機器學習」實作課程前後，社會組及自然組學生在運算思維能力上皆有顯著的提升。三、在參與「機器學習」實作課程前後，學生對人工智慧之學習態度無顯著改變，但整體而言皆持有正向看法。四、不同學習成就的學生在「學習態度」的表現上，僅有高分與中分組間，在貢獻階層的態度上有顯著差異。未來建議能依據不同程"
    },
    {
        "resulNum": "37.",
        "title": "天氣因子對墾丁國家公園不同遊憩區遊客人數變動趨勢之分析",
        "link": "https://hdl.handle.net/11296/as7f88",
        "description": "天氣因子對戶外休閒有顯著影響，合適的氣候會為每個風景區帶來更多遊客，同時提高他們在遊憩活動期間的品質及舒適的體驗，藉此提升來客量及回流的可能性。本研究係以墾丁國家公園為例，探討園區內十三處遊憩區在2008~2017年間，遊客的變動量與天氣因子的變化關係。以園區內的恆春氣象站所提供的氣象數據-溫度、濕度、降雨量、降雨天數、日照時數、風速等，代入三種天氣指標~舒適度指數(THI)、旅遊氣候指數(TCI)及人體舒適度指數(SSD)。發現室內及濱海遊憩景點的遊客人數會隨溫度、日照時數、降雨量及降雨天數的增加，有正向的影響，但與風速呈負向相關；對戶外廣大的遊憩區而言，溫度、降雨量則是明顯的負向影響。三種天氣指標在評價園區舒適度感受與遊客量關係，受限於旅遊習慣及景點特徵而不如預期。將墾丁各景點按淡旺季的概分為三種類型，而在秋季遊客量表則現一般。觀光產業的主管及業者可從這點去努力，搭配當地的生態或特色去做推廣或連結，以延續當地的觀光命脈。"
    },
    {
        "resulNum": "38.",
        "title": "通過多任務學習和二維遞歸神經網路預估影像中的天氣屬性",
        "link": "https://hdl.handle.net/11296/352t9g",
        "description": "在本文中，我們嘗試使用卷積神經網絡提取視覺特徵，通過多任務學習和二維遞歸神經網路預估影像中的天氣屬性。我們預估了四個常見的天氣屬性，包括溫度、濕度、能見度和風速。基於先前已經完成的溫度預測工作，我們進一步從兩方面擴展此工作。首先，考慮深度多任務學習，我們基於相同的視覺信息共同預估四個天氣屬性，以一個統一的模型同時做到溫度、濕度、風速以及能見度的預估。其次，我們建議考慮天氣特性的時間演變，提出不同尺度的屬性預估。我們特別開發二維遞歸神經網絡預測一圖片序列中最後一張圖片的天氣屬性。在實驗中，與最新模型相比，我們顯示出更好的預測準確性。此工作是第一個基於多任務學習的二維遞歸神經網絡，應用於視覺天氣屬性預估。"
    },
    {
        "resulNum": "39.",
        "title": "臺灣西北部梅雨鋒面上中尺度對流系統引發劇烈天氣之研究",
        "link": "https://hdl.handle.net/11296/hu7hvb",
        "description": "梅雨鋒面,劇烈降水,屏障噴流,Meiyu Front,Severe Precipitation,Barrier Jet,臺灣西北部梅雨鋒面上中尺度對流系統引發劇烈天氣之研究"
    },
    {
        "resulNum": "40.",
        "title": "天氣預測對捷運搭乘者影響之研究",
        "link": "https://hdl.handle.net/11296/qu56c3",
        "description": "隨著臺灣都市化程度提升，都市計畫轉變為「大眾運輸導向發展」，透過大眾運輸系統串聯起都市內的交通。而臺北都會區的捷運系統最為密集、使用人次最高，因此探討影響臺北捷運的使用因素最為重要。在過去，有關天氣對捷運旅運量的影響研究中，大多使用官方的觀測資料進行分析，較少針對民眾的「主觀決策」進行調查。因此，本研究除使用天氣的「觀測資料」分析外，主要目的為探討「天氣預測資訊」對民眾造成的影響，為調查民眾在接收到天氣預測資訊後的運具選擇行為，本研究以問卷作為工具，採量化方法進行分析，隨機發放問卷給新北市三重區、蘆洲區的民眾，共蒐集412 份有效樣本。研究結果顯示，在「觀測資料」中：「雨日」比「非雨日」有更高的進站人次；「氣溫」與「捷運進站人次」呈現負相關；而「空氣品質指標」無顯著相關。在「主觀決策」中：受訪者認為當天氣預測資訊為「下大雨」時改變運具的比例最高，依序為「高溫炎熱」、「低溫寒流」，而「空氣品質不佳」比例最低。"
    },
    {
        "resulNum": "41.",
        "title": "天氣與購衣行為之關聯性研究",
        "link": "https://hdl.handle.net/11296/fjvht8",
        "description": "在心理學、經濟學、財務等領域的研究顯示天氣情況越佳，當地個體的情緒較為正面。當消費者的心情愈正向，往往會願意花更多的錢進行消費，本研究使用問卷方式取得來店消費者的個人基本資料、購買預算及購買品項的資訊，再透過迴歸分析檢驗天氣狀況與購買預算之間的關聯性。實證結果顯示日照水準會影響消費者的購買服飾預算；這結果呼應先前研究的結果，亦即證實陽光影響消費者情緒，使得負面情緒的減少，進而提高消費支出的水準。這個結果為文獻的影響做出了貢獻，說明外部氛圍會對消費者購物行為造成影響。"
    },
    {
        "resulNum": "42.",
        "title": "天氣對成本僵固性的影響",
        "link": "https://hdl.handle.net/11296/5q3u4c",
        "description": "本研究基於心理學文獻，陽光照射量與管理者情緒正相關，探討天氣對成本僵固性的影響，依據美國上市公司總部所在的城市天氣狀況作為管理者情緒的代理變數，實證發現天氣與成本僵固性顯著正相關。當公司銷貨收入下降，好天氣驅動的正面情緒影響管理者做決策時較樂觀，認為銷貨收入的下降只是暫時的，傾向做出減緩或不調減資源的決策，使公司的成本僵固性增加，而受壞天氣驅動負面情緒的管理者則反之，受負面情緒影響的管理者較悲觀，認為銷貨收入的下降非暫時性的，傾向做出向下調整資源的決策，使成本僵固性降低。"
    },
    {
        "resulNum": "43.",
        "title": "天氣狀態與網室栽培文心蘭(Oncidium)產量及質量之空間相關性",
        "link": "https://hdl.handle.net/11296/5598u3",
        "description": ",,天氣狀態與網室栽培文心蘭(Oncidium)產量及質量之空間相關性"
    },
    {
        "resulNum": "44.",
        "title": "海象雷達回波訊號分析受天氣因素影響之研究",
        "link": "https://hdl.handle.net/11296/e264vd",
        "description": "以海象雷達進行波浪觀測時，是利用海面的回波訊號經由波譜計算的方法獲得相關的波浪參數，因此回波訊號的特性將影響到後續的分析結果，本論文考慮天氣因素「風及降雨」對於雷達回波的影響，改進波高的計算結果。在降雨對於雷達測波的影響上，考慮到降雨會造成雜訊回波及海面回波變強影響，先針對觀測資料進行是否受降雨影響的判斷，利用回波影像的統計特性「平均值與差異係數」作為判斷標準，再進一步利用濾波方法濾除降雨雜訊的影響。另外在風的特性對於回波特性的影響上，本論文考慮風向、風速對於回波特性的影響，藉由觀測資料的分類，修正風特性對航海雷達測波的影響。在實測資料的分析上，在考慮降雨對雷達測波的影響時，利用影像的統計特性「平均值與差異係數」可有效區分降雨及非降雨的觀測資料，其準確率達九成五以上；並進一步以頻域濾波的方式來濾除降雨對回波資料的影響。在考慮風的特性對觀測資料的影響時，將觀測資料依風向、風速進行分類，在波高計算結果上，取其95 % 信賴區間的範圍分佈在±45公分之間。"
    },
    {
        "resulNum": "45.",
        "title": "應用數值模式探討臺灣空氣污染與天氣資訊關聯性之研究",
        "link": "https://hdl.handle.net/11296/353twa",
        "description": "空氣污染排放和氣象條件是影響空氣品質最重要的因素，特別是在臺灣，由於其地理位置以及複雜的地形，因此在面對空氣品質問題時必須考慮地形與氣象條件之間的交互作用，當天氣系統帶來的氣流與中央山脈產生交互作用時會在臺灣西半部產生不同區域的傳輸和累積空氣污染物，進而讓臺灣訂定控制政策和空氣品質預測更加困難。因此，本研究應用氣象模式WRF探討2011年至2018年間空氣污染好發季節之綜觀天氣與中尺度臺灣環境流場的關聯性，以及應用空品模式CMAQ了解綜觀天氣下臺灣環境流場變化型態與PM2.5污染物的時序空間分布。透過8年的臺灣環境流場判定，分類出三種不同持續時間的環境氣流變化型態代表鄰近臺灣之天氣系統不同移動速度，並發現這些型態數量皆呈現下降的趨勢，說明此種環境氣流變化型態正在逐年減少。而環境氣流變化型態可以分類為8種天氣移動類型，其中以低壓鋒面及低壓鋒面→高壓出海此兩種天氣類型的比例佔最多，且在這8年間低壓鋒面呈現上升趨勢，低壓鋒面→高壓出海則呈現下降趨勢，再進一步將PM2.5濃度對應到環境流場變化速度型態，結果發現低壓鋒面→高壓出海類型在不同環境流場變化速度之PM2.5濃度皆高於低壓鋒面類型，說明了低壓鋒面→高壓出海此種天氣類型較易產生空氣污染現象，且在天氣類型影響下同樣的環境"
    },
    {
        "resulNum": "46.",
        "title": "影響臺灣中尺度天氣系統個案模擬之研究- 以2017年6月2日梅雨鋒為例",
        "link": "https://hdl.handle.net/11296/w69c24",
        "description": "2017年首波梅雨鋒面於6月1日大陸華南地區生成，伴隨底層及高空合適的環境場下，鋒面生成後，首先影響臺灣北部，並逐漸往南移動，呈現滯留狀態。在鋒面與西南氣流的影響下，6月2日當天北部、中部及南部山區累積300 mm以上的強降雨。從6月2日的綜觀天氣圖分析來看，850 hPa有強勁的低層噴流，風速達15~25 ms-1；200 hPa可觀察到風場在臺灣海峽有分流情況出現，代表高層有輻散現象，均為有利中尺度對流系統發展之條件。6月2日馬公地區0000 UTC及1200 UTC斜溫圖分析後，各項數值均為有利中尺度對流系統發展，顯示6月2日當天臺灣地區大氣條件十分的不穩定，因此在北部、中部及南部各地造成短時強降雨。此外，0900 UTC在華南一帶有颮線系統生成，並逐漸往臺灣海峽中間一帶向東移動，於1200 UTC接觸臺灣中部並且有增強之現象，由中央氣象局自動測站所觀測的氣壓、溫度、風速來看，均符合陳泰然等(2002)所提到典型颮線系統通過測站時的狀況，包含氣壓驟升、溫度驟降及風速突變。本研究使用WRF模式3.9版本。模擬結果之累積降雨、850 hPa、200 hPa高空風場圖及斜溫圖均和實際觀測情況大致相符，850 hPa水氣通量場可明確指出水氣分布情形及風場對於水氣輸送之影響，透過垂直剖面模擬分析，更可清楚看出影響臺灣中部之颮線系統內部結構及差異。此類垂直對流結構不容易被觀"
    },
    {
        "resulNum": "47.",
        "title": "以期望確認理論及資訊系統成功模式之觀點探討中央氣象局劇烈天氣監測系統使用之組織績效",
        "link": "https://hdl.handle.net/11296/9nfg54",
        "description": "劇烈天氣監測系統(Quantitative Precipitation Estimation and Segregation Using Multiple Sensor, QPESUMS)，提供政府機關氣象防救災等相關單位即時性的天氣監測資訊，國軍部隊在其中亦扮演重要的角色，部隊平日在執行例行性的戰演訓任務期間及緊急的防救災工作，運用此系統來供應及掌握即時的氣象情資，是極為重要的工作項目。本研究以期望確認理論及資訊系統成功模式為基礎，結合相關構念，發展出本研究假說與架構，用來深入探討劇烈天氣監測系統使用者在潛在變項的影響下，對於使用意願與使用滿意度的影響，最終瞭解使用劇烈天氣監測系統對提升組織績效之影響關係。本研究以國軍專業氣象部隊為研究對象，共回收138 份有效問卷，藉由結構方程式模式執行統計分析研究架構與假說驗證，其研究結果顯示：一、系統成功模式中的系統、資訊、服務品質對使用意願與使用滿意度均有顯著的正向影響。二、期望確認理論中的期望確認對使用意願與使用滿意度均有顯著的正向影響，期望確認對認知有用性有顯著的正向影響，認知有用性對使用意願有顯著正向影響，惟認知有用性對使用滿意度無顯著正向影響。最終結果得知，劇烈天氣監測系統的系統成功及期望確認對使用意願與使用滿意度均有顯著的正向影響，劇烈天氣監測系統的認知有用性對使用意願亦有顯著正向影響，有助氣象部隊人員完善預測報工作，進而提升組織"
    },
    {
        "resulNum": "48.",
        "title": "結合季長期天氣預報與標準化降雨指標建立有勝溪斷流預警系統",
        "link": "https://hdl.handle.net/11296/wb35p8",
        "description": "近年來研究人員發現域外放流至羅葉尾溪的櫻花鉤吻鮭有向其下游的有勝溪擴張之趨勢，卻遭到有勝溪斷流事件的阻礙，羅葉尾溪成功的域外放流，卻可能因有勝溪頻繁地斷流事件而直接衝擊臺灣國寶魚棲地生態的完整性。因此，本研究欲藉由航遙測影像、雨量與流量資料之比對來探討有勝溪斷流發生機制，並結合季長期天氣預報與標準化降雨指標建立有勝溪斷流預警系統。結果顯示，有勝溪自2012年之後，河道受颱風影響從直流而成曲流的情況下，單月標準化降雨指標(SPI-1)小於0或日流量低於0.531CMS，即可能會發生斷流。因此，本研究採用中央氣象局提供季長期天氣展望資料，並配合修正後有勝溪每月雨量屬於偏高(Above)、正常(Normal)、偏低(Below)之機率分類區間的界定門檻值，依月分別輸入台北、台中與花蓮測站的季預報結果，以氣象合成模式繁衍有勝溪月雨量資料。本研究採歷史季預報預測下一個月的結果，以SPI-1小於0做為斷流預警指標，應用於推估2012年8月之後斷流事件，其準確率達57%。本研究另外發現，以IHA計算2012年前後兩時期的各項流量指標，結果並無明顯差異，顯示位在斷流處下游流量站的流量變化無法真實反映上游頻繁斷流的現象，顯示斷流河段現地觀測之必要性。"
    },
    {
        "resulNum": "49.",
        "title": "短期空氣品質應變措施於多種天氣型態之有效性分析與效益評估—以北部空品區為例",
        "link": "https://hdl.handle.net/11296/6sw83x",
        "description": "高濃度空氣污染事件可能增加民眾的健康風險、對健康產生立即性的危害，因此許多國家開始實施空氣品質管理的短期應變計畫；我國政府也在民國106年修正了<空氣品質嚴重惡化緊急防制辦法>，希望以短期空氣品質管理應變措施，減緩高濃度事件日的時間與濃度值；然而目前關於短期應變措施的研究較少，且機制模型存在短期的預測限制，無法有效得知短期作為對於實際濃度改變情形。本研究目的在於評估短期作為成效之研究方法上的不足，以北部空品區為研究地點，選定在三種天氣型態下的降載策略及一交通管制策略為案例，其中降載作為中減量的目標污染物PM10與PM2.5濃度、交通作為中目標污染物NO2、O3濃度；以深度學習的長短期記憶模型(Long Short-Term Memory, LSTM)預測無短期作為下的空氣品質惡化濃度，再利用統計檢定方法分析應變作為前後的濃度區間範圍及濃度減量的可能，並以空氣污染物傳輸模式模擬電力業降載時的影響範圍與效益，作為空間中的輔助資訊。結果顯示，預測模型在後一小時、後三小時中表現極佳；其中北部空品區禁車的短期應變作為確實使得當日的NO2與O3濃度觀測值下降，對於降載案例中的PM10及PM2.5濃度而言，實施短期應變作並沒有辦法使得濃度明顯降低，但以有效性濃度差值解釋，高壓迴流與鋒前暖區兩個天氣型態下，降載作為可使得PM10及PM2.5濃度下"
    },
    {
        "resulNum": "50.",
        "title": "利用雙偏極化雷達觀測資料進行極短期天氣預報評估─2008年西南氣流實驗IOP8期間颮線系統個案",
        "link": "https://hdl.handle.net/11296/kt8dk4",
        "description": "本研究使用雙偏極化雷達資料模擬器(polarimetric radar data simulator, PRDS)將模式輸出轉換成雙偏極化雷達參數後，與NCAR S波段雙偏極化雷達之雙偏極化雷達參數進行分析場與極短期數值天氣預報的比較。此外，使用Goddard、WSM6、WDM6和Morrison四種雲微物理參數化方案進行模擬。進行短預報前，使用WRF-LETKF雷達資料同化系統同化雷達回波與徑向風，以獲取最佳分析場。目的在於掌握較佳雲動力結構後，利用雙偏極化雷達參數驗證數值模式在雲微物理方面的表現，並了解不同雲微物理參數化方案對於雙偏極化雷達參數之模擬狀況。　　經資料同化後，系集平均分析場雨帶的強度與分佈和雷達觀測結果相近。後續則利用單一決定性預報與系集平均場短期預報進行同化效益的討論，以傳統列聯表分數之累積雨量校驗結果顯現同化後結果較佳。此外，利用contoured frequency by altitude diagrams (CFADs)進行系集平均分析場與每小時之累積預報結果，回波在四個方案中的CFAD分布和觀測相似，其中單矩量的Goddard和WSM6更接近觀測。而差異反射率在單矩量模擬中，表現較佳，但四種方案皆有高估的狀況。比差異相位差則是在對流區的掌握度較好，層狀區的改進差異不大。模式預報後第一小時結果與觀測相比後，顯示仍能維持雷達參數良好的垂直分布狀況，但隨著預報時間拉長至第三小時，垂直分布結果已和觀測大相逕庭，與未同化之單一決定性預報之"
    },
    {
        "resulNum": "51.",
        "title": "天氣因子對捷運搭乘意願影響- 以台北捷運為例",
        "link": "https://hdl.handle.net/11296/jart9z",
        "description": "隨著現今科技不斷進步，對於大量數據的收集及分析，已不再是重大難題，如何從大量的數據中，萃取出影響人們使用台灣的大眾運輸工具頻率的因素，進而利用分析的因素，激發大眾更多的動機搭乘大眾運輸。基於政府近年來致力於提供公開資料平台，而中央氣象局也公開各種天氣的資料，加上台北市捷運局提供各站旅運量資料，所以可以利用中央氣象台的歷年天氣資料以及台北市捷運局的旅運量資料做數據分析，找出天氣因子對搭乘捷運量的影響，並希望藉由分析結果可幫助做決策，進一步的提升大眾運輸工具的使用率。利用台北捷運旅運量資料做為應變數(Response)，搭配氣象資料做為因子自變數(Covariate)，將各天氣變數進行分類以及做探索，藉由SPSS做統計分析，像是多元迴歸分析，找出各個自變數是否對台北捷運運量有顯著的影響，找出影響的因子後，再加以分析，並給予實質上的建議。"
    },
    {
        "resulNum": "52.",
        "title": "高雄市空氣品質與天氣概況影響公共自行車使用行為之探討",
        "link": "https://hdl.handle.net/11296/c394n2",
        "description": "高雄市於2009年3月開始逐步實施公共自行車系統，並逐步增設各租賃站，成為公共運輸系統之一環。公共自行車使用者均為戶外環境，因應臺灣常年於冬季及春季常發生高濃度之懸浮微粒狀況，空氣中的懸浮微粒容易進入人體之呼吸道與血管內，而導致身體過敏不適或增高心血管疾病之風險，且臺灣近年因暖化現象造成極端天氣逐漸頻仍，空氣品質與氣象因子對於公共自行車的使用行為是否造成影響？本研究利用皮爾森相關係數、逐步迴歸分析方法進行資料分析，探討2015年6月至2018年12月高雄市公共自行車租借次為與空氣品質及氣象因子之間的關係，結果顯示空氣品質PM2.5無顯著關係，另與氣象因子相關變數中降雨(強度)有極大顯著，而風速次之。"
    },
    {
        "resulNum": "53.",
        "title": "天氣衍生性商品評價與風險管理：CME雨量指數二元式合約之應用",
        "link": "https://hdl.handle.net/11296/nx952g",
        "description": "本文討論了CME發行之雨量衍生性商品——雨量指數二元式合約之評價與風險管理。標的之雨量指數由兩種模型所刻畫：以一階兩狀態馬爾可夫鏈建立的發生模型，以及以混合指數分配建立的雨量強度模型。爲了捕捉降雨的季節性特徵，上述兩模型中的參數均以截斷傅立葉級數擬合，其中之係數以最大概似估計法估計，階數根據AIC與BIC判定。在以蒙地卡羅模擬獲得日降雨量模擬路徑後，計算月降雨量並以常態逆高斯分配擬合。鑒於天氣衍生性商品市場之不完備性，本文利用Esscher變換對雨量指數二元式選擇權進行評價，並以CME之真實市場價格校準獲得風險市場價格。最後，利用燃燒分析與敏感度分析討論雨量衍生性商品之風險管理。"
    },
    {
        "resulNum": "54.",
        "title": "基於天氣變化適應閾值之車道辨識及前車距離偵測",
        "link": "https://hdl.handle.net/11296/rjh36v",
        "description": "交通事故的發生往往容易造成人員傷亡及財產損失，大多數的意外來自於駕駛疏忽使得車輛偏離車道或未注意前方車距而與他車產生碰撞，因此行車安全也越來越受到重視，車輛輔助系統也逐漸的蓬勃興起。先進駕駛輔助系統 (Advanced Driver Assistance System, ADAS) ，能夠提供駕駛者在行駛時，對於車輛的工作情形與車外環境變化等進行分析，並且提早警示有可能發生的危險情況，使駕駛能預先採取因應措施，預防交通事故的發生。在本論文中，提出一個可以隨著天氣變化的前車與車道偵測警示系統，此系統能夠提供駕駛者偵測前方車輛距離警示，避免駕駛人疏忽沒注意到和前車距離而造成碰撞。伴隨時下開車族會在車內裝設行車記錄器的使用，以此裝置拍攝實際行車路況影像做為輸入，透過影像處理與演算法運算，判斷是否為車道偏移以及與前車車距過近。為了因應不同的天氣狀況，首先將輸入影像透過ROI ( Region Of Interest )感興趣區域範圍來定義環境變數，取得影像處理後的像素強度資訊與二值化閾值的關係，並依據不同的環境變數進行演算法運算來獲取水平、陰影或著車燈特徵，利用霍夫直線轉換演算法取得車道線，且計算車道線與車輛平行線之角度，用於判斷是否為車道偏離。將偵測之車道線與影像處理後區域候，用於判斷前方是否為車輛特徵，再利用前車距離演算法計算與車輛間距。論文最後將介"
    },
    {
        "resulNum": "55.",
        "title": "基於網路探勘及機器學習技術之自動化新聞研究與實作–以天氣預報為例",
        "link": "https://hdl.handle.net/11296/4qa57j",
        "description": "自2014年起，開始有多家知名媒體機構相繼使用機器人記者產生新聞。至今，已知運用自動化生成新聞的機構，有美聯社、紐約時報、洛杉磯時報等多家新聞媒體。自動化新聞目前適用於例行重複性的新聞報導，步驟通常為：收集數據、資料分析、撰稿描述、發布新聞，其中收集數據與資料分析屬於網路探勘(Web Mining)領域，而撰稿描述、發布新聞則是屬於自然語言生成(Natural Language Generation, NLG)領域。自動化新聞目前的優勢為快速產生新聞，節省更多人力，引用數據時犯錯的機率也較小。缺點則是文章重複性高，寫作風格也不像真正的記者般流暢敘述。本論文將先以交通部中央氣象局-氣象資料開放平台為例，此資料平台有許多文件採用可延伸標記式語言(Extensible Markup Language, XML)，將此文件之氣象數據收集並加以分析，再根據結構化資料自動生成生活氣象新聞稿。另外，對於未來氣象，也會以機器學習(Machine Learning)的方式，假設氣象數據之間有著迴歸關係，以歷史氣象資料及監督式學習來訓練預測模型，並預測未來的氣象數據，嘗試能降低對氣象資料開放平台的依賴，達到未來全自動化預測氣象並生成氣象預報的目的。最後的實驗結果證明，機器學習的均方根誤差(root-mean-square error, RMSE)及6小時後的預測溫度準確率皆可達到不錯的效果，未來氣象預報的自動化新聞將可節省許多例行性的工作，讓人類記者專心在新聞的豐富性及深度"
    },
    {
        "resulNum": "56.",
        "title": "EnergyPlus結合天氣預測應用於冰水主機佳化排程",
        "link": "https://hdl.handle.net/11296/3348t5",
        "description": "溫室氣體的逐年累積加上全球暖化的日益嚴重，世界各地開始出現極端氣候，造成了許多嚴重天災和無法估計的生命財產損失，因此節能減碳救地球的意識逐漸受到人們的重視。而在討論住商辦公用建築物當中的能源消耗，一定要探討到暖通空調系統HVAC System （Heating, Ventilation and Air Conditioning）的耗能狀況。而由於台灣位於副熱帶氣候區的因素，住商辦公大樓中甚少使用到暖氣的系統設備，主要的耗能來自中央空調系統中的冰水主機及其他附屬設備，而研究節能手法的方法有許多種，例如:冰水主機冰水出入溫度的控制、冰水主機冷卻水出入水溫度的控制、泵浦變頻控制及冷卻水塔的風散變頻控制….等。而本研究將探討桃園市蘆竹區某廠辦大樓案場的冰水主機的最佳化排程，透過建立建築物模型，運用建物能耗分析軟體EnergyPlus搭配氣象資料，模擬出不同季節及不同外氣條件下，該建物的能源消耗情況，再藉由比較不同排程組合的冰水主機系統耗電，推論出最佳冰水主機排程組合。最後由模擬結果顯示在夏季以平均的冰水主機排程組合的耗電來比較，一共節省了6.22%，再跟最耗能的冰水主機排程組合相比，節能率更是達到9.97%，以夏季電價計算一天可以省下一萬初元。在冬季以平均的冰水主機排程組合的耗電來比較，節省了3.45%，再跟最耗能的冰水主機排程組合相比，節能率有5.17%，以非夏季電價計算一天"
    },
    {
        "resulNum": "57.",
        "title": "天氣因子與登革熱病媒蚊卵數之相關性探討──以臺南市2017年5月至2018年1月為例",
        "link": "https://hdl.handle.net/11296/k3jp6a",
        "description": "背景：過去尚未有研究同時考慮天氣對斑蚊卵數的非線性影響及非線性遞延效應。目的：利用非線性遞延分配模型，同時探討天氣對斑蚊卵數動態變化的非線性影響及非線性遞延效應。方法：運用2017年5月至2018年1月國家衛生研究院與臺南市登革熱防治中心以誘卵桶收集之斑蚊卵數，建立天氣因子與平均卵數的統計模型，並進一步透過分量迴歸模型以探討土地使用類型、人口密度解釋天氣因子模型殘差值空間變異的可能性。結果：資料清理後，共納入2,290個誘卵桶分布於8個臺南市行政區，透過交叉相關（cross-correlation）以及運用赤池資訊準則 (Akaike information criterion, AIC)篩選之最佳模型分析，發現平均日高溫、平均常態化差異植生指標對於平均卵數的遞延效果呈非線性。而平均日降雨量及平均日高溫對於平均卵數有顯著的交互作用，當上一週平均日降雨量增加時，平均日高溫與平均卵數的負相關性會提前出現。當上一週平均日降雨量為0毫米，平均日高溫增加時，會減少未來第三週的平均卵數；當上一週平均日降雨量為5至50毫米時，平均日高溫於當週及未來第一週與平均卵數呈顯著負相關，此負相關性於未來第七或第八週再次呈現顯著。除此之外，遞延七週平均日高溫效果會直接與間接透過遞延四週的平均常態化差異植生指標影響到平均卵數。進一步透過分量迴歸模型分析，發現誘卵桶周"
    },
    {
        "resulNum": "58.",
        "title": "臺北市空氣品質與天氣概況影響公共自行車租借行為之探討",
        "link": "https://hdl.handle.net/11296/p95264",
        "description": "公共自行車系統已於臺北市實施將近 10 年的時間，隨著租借站的建置逐漸完整，儼然成為公共運輸系統的其中一環。由於公共自行車使用者騎乘路線絕大部分為戶外環境，此外臺灣常年於冬季與春季好發高濃度之懸浮微粒事件，空氣中的懸浮微粒容易進入人體之呼吸道與血管內，可能導致身體不適或提高心血管疾病之風險。另外臺灣近年來出現極端天氣的頻率逐漸增加，空氣品質和天氣概況是否對於公共自行車的使用行為造成影響？本研究利用皮爾森相關係數、迴歸分析方法進行資料分析，探討 2016 年 11 月至 2017 年 10 月臺北市公共自行車租借行為與天氣、空氣品質之間的關係。研究結果顯示天氣相關變數中降雨對於租借率為顯著負相關；氣溫、風速以及懸浮微粒濃度對於租借率無顯著影響力。"
    },
    {
        "resulNum": "59.",
        "title": "基於深度學習並整合天氣因素之行車時間長期預測",
        "link": "https://hdl.handle.net/11296/qzwmyc",
        "description": "近年來，隨著開車人口越來越多，全球氣候變化越來越劇烈，交通擁塞的發生也頻繁許多，然而政府已經可以透過車輛偵測的技術即時監控重要路段的交通情況，並且產生出大量的歷史交通資訊，包含行車時間與行車速度，這些資訊不僅能幫助政府分析交通情況並提出相對應的政策來舒緩交通擁塞的情形，也使得行車時間短期預測的研究越來越多且越來越準確。但是對於行車時間長期預測，目前仍然只有少量的研究致力於這塊領域上而且無法準確的預測，因此本論文主旨為發展一套行車時間長期預測的架構，我們覺得如果能準確的預測長期行車時間，能為更多的服務帶來好處。在本論文中，我們提出了一個基於深度學習並整合天氣因素的架構來進行行車時間長期預測，我們引入了解決資料不平衡分類問題的方法，並透過集成模型來解決擁塞情況下行車時間難以預測的情況，並進行了一系列的實驗來驗證我們提出的架構的有效性。實驗結果顯示，我們提出的架構可以有效的做出行車時間長期預測。關鍵字： 長期預測、行車時間預測、資料不平衡問題、集成模型"
    },
    {
        "resulNum": "60.",
        "title": "利用軌跡模式與天氣型態探討台中市PM2.5潛勢污染源區",
        "link": "https://hdl.handle.net/11296/9m3kun",
        "description": "本研究使用高斯煙流軌跡模式(Gaussian trajectory transfer-coefficient model, GTx)下的風場軌跡模式(Trajectory model, Traj)結合反軌跡群聚(trajectory clustering)、潛在源貢獻因子法(Potential Source Contribution Factor, PSCF)與濃度權重軌跡法(Concentration Weighted Trajectory, CWT)模式，探討六種不同天氣型態(C1 ~ C6)下台中市PM2.5傳輸途徑以及潛勢污染源區。其中主要分佈在冬季的有C1、C5與C6三種天氣型態，夏季則有C3及C4兩種天氣型態，而C2天氣型態每個月出現次數則較為平均。模式分析結果顯示，C1與C2天氣型態之高潛勢污染源區最多，大多落在台中市與苗栗縣之西部與沿海地區。此外，將這些PM2.5潛勢污染源區與TEDS 9.0之PM2.5實際排放地區進行比對，發現高潛勢污染源區確實座落於實際高排放量地區之中，顯示利用Traj結合PSCF與CWT模式所篩選之潛勢污染源區具有相當的參考價值。"
    },
    {
        "resulNum": "61.",
        "title": "天氣對投資者交易行為的影響：來自台灣期貨交易所的證據",
        "link": "https://hdl.handle.net/11296/fx45yt",
        "description": "在這篇研究中，我們探討天氣誘發情緒與指數期貨交易行為之間的關係。 我們發現天氣變量會影響國內投資者的委託單積極性，會傾向用較高的委託價與使用較多的市價單，這效果對於散戶投資人最為明顯。除此之外，我們的研究發現天氣引發的情緒影響交易行為，進而影響後續的交易表現，利用各帳戶的交易行為受天氣影響的程度，對天氣變化越敏感的散戶投資人後續交易績效越差，然而散戶當沖交易者卻不受影響。 我們還發現天氣變量和散戶投資者在天氣條件好時傾向買多於賣。 這些發現與心理學家提出的觀點相一致，即良好的天氣條件會產生正向的情緒，而正向的情緒進而影響交易行為。"
    },
    {
        "resulNum": "62.",
        "title": "探索酷熱天氣下之階層頻繁項目–以某超市為例",
        "link": "https://hdl.handle.net/11296/xfcz94",
        "description": "一直以來企業為了提高商品銷售量通常利用關聯規則探勘技術從交易資料庫中尋找頻繁項目集，判斷「何種商品」經常被一起購買，當該商品組合經常被消費者購買，則表示此商品組合能有效提升消費者之購買意圖。然而，隨著極端酷熱之天數越出頻繁，近幾年來極端氣候對人類生活之影響不斷地嚴重加劇，中央氣象局指出臺灣近年來高溫日數相較於往年大幅增加一倍之多。因此過去方法挖掘之商品組合能否適用於所有氣溫狀況，而極端高溫之條件下是否會出現不同之商品組合即為一當前值得研究之議題。為了解決上述問題，本研究提出一套新方法，嘗試從階層頻繁項目集中找到酷熱條件下特定出現之商品組合。延續過去關聯規則之概念，有別於以往利用全年交易資料進行關聯分析，本研究加入氣溫作為區間加以分析，希望找出相較於過去研究更為符合酷熱氣溫下之品項購買組合。本研究將顧客交易資料分成高溫、非高溫兩區段，透過改良之APRIORI演算法應用階層關聯規則並藉由獨立樣本T檢定之結果作為篩選條件，保留頻繁項目集中至少包含一銷售量對氣溫具顯著差異商品之組合，最後扣除兩氣溫區間頻繁項目集中重複出現之品項及頻繁項目集中屬相同分類之組合，即可得到足以代表酷熱條件下特定會出現之品項購買組合。本研究透過上述方法得到15組頻"
    },
    {
        "resulNum": "63.",
        "title": "太空天氣對Formosat-2及Formosat-3異常事件影響之分析",
        "link": "https://hdl.handle.net/11296/df9578",
        "description": "當衛星發生異常時，將對衛星運作和儀器觀測有很大的影響，可能造成衛星的運作中斷或儀器的資料錯誤。然而造成衛星異常的情況很多種，所以我們需要先了解異常的發生原因，才能提早預測異常或找出因應的解決辦法。從福衛二號以及福衛三號的衛星異常事件中，我們依照不同的異常原因做分類，將非太空天氣影響的事件去除後，對剩下的可能受太空天氣影響事件做分析。在分析的過程中，我們使用地球磁場以及太陽風資料來分析這些異常事件，並且利用這些太空資料來分析出衛星發生異常時，主要太空環境情形以及影響衛星發生異常的主要條件。"
    },
    {
        "resulNum": "64.",
        "title": "全球導航衛星掩星觀測資料於電離層數值天氣預報之應用",
        "link": "https://hdl.handle.net/11296/yhcyqx",
        "description": "本論文旨在評估福爾摩沙衛星三號與福爾摩沙衛星七號之掩星觀測資料對於電離層數值天氣預報的影響。本研究使用系集卡曼濾波技術同化電離層-熱氣層耦合模式與福爾摩沙衛星三號及福爾摩沙衛星七號所測得之電子密度剖線與斜向全電子含量資料，以期能改善電離層資料同化系統的現報與預報能力。首先，本研究將評估電離層與熱氣層之耦合作用對於電離層本身的現報與預報之影響。美國國家大氣研究中心所發展的資料同化開發模組將被用於同化福爾摩沙衛星三號電子密度剖現資料與熱氣層-電離層耦合環流電動模式(Thermosphere-Ionosphere-Electrodynamics General Circulation Model, TIE-GCM)。此資料同化開發模組與TIE-GCM之結合將有利於在數據同化與預報的過程中，電離層與熱氣層自洽性的耦合。觀測系統模擬實驗將被用來評估同化不同電離層與熱氣層變數對於電離層現報與預報之影響。實驗結果表明，電離層現報與預報之能力可藉由同時同化電離層與熱氣層的變數獲得改善，且中性大氣成分之影響尤為重要。當利用福爾摩沙衛星三號與七號所測得之全球定位系統訊號反演電子濃度剖線資料時，需假設全球的電子濃度分布為球面對稱之分布。同化電子濃度剖線會同時將此假設所造成的誤差引入到數值模型中，而斜向全電子含量的資料則無此問題。故本研究的第二部分將著重在同化斜向全電子"
    },
    {
        "resulNum": "65.",
        "title": "劇烈天氣與地震之地表垂直電場變化",
        "link": "https://hdl.handle.net/11296/4tsygr",
        "description": "\n\n,劇烈天氣與地震之地表垂直電場變化"
    },
    {
        "resulNum": "66.",
        "title": "以資訊系統成功模式及科技接受模式探討使用中央氣象局劇烈天氣監測系統工作績效之研究",
        "link": "https://hdl.handle.net/11296/dbbru6",
        "description": "劇烈天氣監測系統(Quantitative Precipitation Estimation and Segregation Using Multiple Sensor, QPESUMS)，提供即時性天氣監測訊息。國軍部隊執行戰演訓及防救災任務期間，在氣象情資供應及掌握中，運用此系統是極為重要參考之一部。本研究以資訊系統成功模式及科技接受模式為基礎，結合相關研究構念，發展研究假說與概念架構，探討劇烈天氣監測系統使用者在前揭影響潛在變項，對於使用意願與使用滿意度的影響，瞭解使用劇烈天氣監測系統對個人工作績效。本研究以國軍某單位為研究對象，一共回收182份有效問卷，並藉結構方程式模式統計分析研究架構與假說結果顯示：(一)\t除系統品質對使用意願及服務品質對使用滿意度無顯著正向影響，系統品質對使用滿意度、資訊品質對使用意願及使用滿意度、服務品質對使用意願、使用意願對使用滿意度均有顯著正向影響。(二)\t認知有用性對使用意願及使用滿意度均無顯著正向影響，認知易用性對使用意願及使用滿意度均有顯著正向關係。根據研究結果，提出建議提升系統性能或專業行動版APP，讓實際需求者在運用上有所助益。最後得知，劇烈天氣監測系統對研究對象使用劇烈天氣監測系統之認知易用性、系統品質、資訊品質及服務品質，皆能提高其使用意願及使用滿意度，提升氣象預測報能力，進而產生個人工作績效。"
    },
    {
        "resulNum": "67.",
        "title": "基於天氣預報及網路論壇資料之個人化旅遊推薦系統",
        "link": "https://hdl.handle.net/11296/45x2j3",
        "description": "近年來旅遊推薦系統逐漸受歡迎而被使用者廣泛的使用。然而，在現有的旅遊推薦系統所推薦的景點當中仍然沒有以天氣作為考量的因素。為了解決這個問題，本論文提出了一個以天氣為考量因素的旅遊推薦系統。此系統將結合TFIDF與Latent Dirichlet Allocation (LDA)演算法為基礎建立模型以達到行程快速修改的效果。除此之外，本論文所建立的旅遊推薦系統使用台灣最熱門BBS網站PTT作為分析資料並找出使用者的個人喜好。因此，本論文的旅遊推薦系統所推薦的行程除了天氣因素外，同時也會考慮使用者的個人喜好。最後在實驗部分方面證明了旅遊推薦系統的行程結果符合使用者的要求以及在更改行程的效率。"
    },
    {
        "resulNum": "68.",
        "title": "以視覺資訊預估天氣屬性",
        "link": "https://hdl.handle.net/11296/k2ub45",
        "description": "在本論文中，我們嘗試單純使用圖片的資訊，利用卷積遞迴神經網路來預估天氣屬性。我們研究了兩種情況下的天氣屬性預估:1)預估單張室外的照片溫度2)預測一序列照片中，最後一張照片的天氣屬性。第一種情況下，使用以大規模影像數據庫訓練的卷積神經網路提取視覺特徵，我們證明可獲得相當好的性能，並分析訓練數據量如何影響性能。在第二種情況下，我們考慮視覺外觀隨著時間的變化，建構出一個遞迴神經網路來預測一序列圖片中最後一張圖片的天氣屬性。與目前最先進的模型相比，我們獲得了更好的預測準確度。此外，我們研究從場景不同區域提取視覺資訊以及在不同的白天時間拍攝的照片對性能的影響。我們的方法進一步的強化僅使用圖片中視覺資訊來進行有效天氣屬性預測的這個想法。"
    },
    {
        "resulNum": "69.",
        "title": "天氣對股票市場的影響-分量迴歸分析",
        "link": "https://hdl.handle.net/11296/7c4dmn",
        "description": "本研究使用分量迴歸來檢驗天氣對台灣股市的影響。 我們考慮了壓力，最高溫度，最低溫度，相對濕度，降雨量，風速，日照率，可見度以及股票市場報酬率，報率的絕對值，周轉率，波動性，情緒指標和流動性代表股票市場特徵的六個變量。我們研究天氣對極端股票市場的影響，與極端氣候對於股票市場的影響。我們的調查結果顯示，在極端市場中很少有證據預測天氣對股市報酬率有影響。然而，天氣對交易活動有重大影響，例如周轉率、波動率、流動性。另外在極端天氣情況下中我們發現所有的天氣對股票市場都有著顯著的影響性。"
    },
    {
        "resulNum": "70.",
        "title": "不同天氣型態下固定污染源對台中地區PM2.5的影響",
        "link": "https://hdl.handle.net/11296/e47z2j",
        "description": "大氣中的懸浮微粒是近期空氣污染防制的目標污染物之一，其對環境與人體的呼吸系統與心血管疾病有很大的影響，在長期暴露在高濃度的環境將使致癌風險和死亡率提高，由於懸浮微粒的粒徑越小越容易吸入人體器官，其造成的危害遠比大粒徑的懸浮微粒高，因此PM2.5的毒性和威脅不可小覷。台中盆地的固定污染源排放量的多寡是直接影響中部地區PM2.5濃度的主要來源之一，然而在排放量固定的情況下，污染傳輸情形會被氣象條件所主導，在受到盆地地形的影響下，當大氣擴散條件較差時，這些固定污染源將會對台中地區造成污染物的不斷累積，使得空氣品質劣化影響人民的健康。為了掌握不同天氣型態下固定污染源對台中地區PM2.5的影響，本研究選定台中地區較具規模的固定污染源，並根據容易出現不良大氣擴散條件以及出現頻率較高的天氣型態作為事件日，使用空氣污染模式(The Air Pollution Model, TAPM)進行模擬，以期得到較貼近真實的污染物的污染流佈現況，找出各個污染源的污染熱區，接著利用地理資訊系統將台中地區的行政區進行網格化並且編號，計算出各個污染源對台中地區各個受體點的污染貢獻量。研究結果顯示對台中盆地來說影響PM2.5的主因為風速、風向和地形，天氣型態以盛行西風下的太平洋高壓西伸型態(A12)和偏南氣流型態(A21)對台中盆地全境的污染貢獻量"
    },
    {
        "resulNum": "71.",
        "title": "天氣狀態對盈餘動能之影響",
        "link": "https://hdl.handle.net/11296/d7mr9r",
        "description": "天氣影響股市報酬率已被眾多學者所探討，如Keef and Roush (2002)、 Goetzmann and Zhu(2005)與Chang, Nieh, Yang, and Yang(2006)等，且Dehaan, Madsen, and Piotroski(2017)的研究中更是納入天氣的考量，觀察天氣是否會影響分析師對於盈餘發布的預測，也研究了天氣對盈餘動能(earnings momentum)的影響，發現當天氣不舒適時，投資人對餘訊息的反應較慢。因此本研究將著重以台灣股市各家公司的盈餘宣告日為事件日，結合天氣因子，來觀察盈餘宣告日當天的天氣情況好壞是否會導致台灣股市的盈餘動能現象變得更加明顯或趨於緩和。本研究計算各股票之累積異常報酬(cumulative abnormal return, CAR)，並依標準化未預期盈餘(standardized unexpected earnings, SUE)將股票分成九組，並參入天氣變數來觀察天氣對各組股票立即反應(CAR[0,2])與延遲反應(CAR[3,75])的影響。樣本期間為2007 年1 月1 日至2016 年12 月31 日，研究對象為台灣上市上櫃之普通股，惟不含TDR 與外國公司，並排除有全額交割紀錄與暫停交易之公司，共860 家公司。藉由中位數迴歸，本研究結果顯示天氣對立即反應與延遲反應有顯著的影響。當天氣越好，立即反應的效果會被減緩，而延遲反應效果則會更加明顯。"
    },
    {
        "resulNum": "72.",
        "title": "大數據分析 - 天氣對捷運、台鐵與高鐵搭乘率之影響",
        "link": "https://hdl.handle.net/11296/9yyfer",
        "description": "隨著現今科技不斷進步，對於大量數據的收集及分析，已不再是重大難題，如何從中萃取出能影響人們更頻繁的使用台灣的鐵道系統的因素，進而利用所擷取之規律以改善交通，才是重中之重。基於政府與交通部鐵路管理局開放資料，以開放資料中的捷運、台鐵與台灣高鐵各站旅運量資料與中央氣象台的歷年天氣資料做大數據分析，找出天氣對捷運、台鐵與高鐵搭乘率之影響，並希望藉由分析結果做出預測搭乘率以供站方利用，例如:雨天、上班上課時段加開班次和人潮疏導等。利用旅運量資料做為應變數(Response)，搭配氣象資料做為因子(Covariate)，將各天氣變數進行分類以及做探索，接著藉由決策樹(Decision Tree)模型對各站分別進行變數選擇，找出影響各車站搭乘意願的因子。"
    },
    {
        "resulNum": "73.",
        "title": "天氣、投資人情緒與台灣股市報酬率關係之研究",
        "link": "https://hdl.handle.net/11296/cum459",
        "description": "本研究旨在探討天氣、投資人情緒和台灣股市報酬率之間的關係，研究期間為2011年1月至2017年8月，共計1640筆日資料。天氣變數包括氣溫、雲層量、日照率和濕度，使用市場週轉率、融資比率、融券變動率、券資比、賣買權成交量比和波動率指數六個市場變數作為投資人情緒指標，並以主成分分析形成綜合情緒指標，進而探討天氣與投資人情緒的關係，檢測台灣股市報酬率是否受到天氣與投資人情緒的影響，以及控制投資人情緒後，天氣變數是否仍對於股市報酬率具有額外的解釋能力。本研究實證結果顯示，天氣與投資人情緒有顯著的相關性，當氣溫與雲層量上升時，樂觀情緒指標減弱、悲觀情緒指標增強，日照率與濕度的效果則相反，四個天氣變數僅濕度的影響不符合預期。其次，氣溫與日照率對於股市報酬率分別有顯著的負向和正向影響，而雲層量和濕度無顯著效果；結合賣買權交易量比的樂觀綜合情緒指標與股市報酬率在同期呈現顯著的正向關係，落後一期指標與股市報酬率呈現顯著的負向關係，隱含對該指標有過度反應的現象；結合波動度指數的樂觀綜合情緒指標與股市報酬率在同期呈現顯著的負向關係，落後一期指標與股市報酬率呈現顯著的正向關係。最後，考慮投資人情緒的效果後，發現氣溫和日照率對於股市報酬率仍有額外的解釋能力，顯示天氣可能透"
    },
    {
        "resulNum": "74.",
        "title": "天氣效應對台灣股票報酬之影響性分析",
        "link": "https://hdl.handle.net/11296/824sh8",
        "description": "誠如Hirshleifer and Shumway (2003) 所述，在好(壞)天氣時，投資行為會有過度反應(反應不足)的現象。若投資者在進行判斷時受到天氣的影響，則股票價格將隨著投資人情緒而波動。過去也有許多研究指出，天氣會影響投資人情緒。本研究探討2010年至2017年三個天氣變數:溫度、濕度、日照時數與股票報酬之間的相關性。並利用門檻值將天氣區分為好天氣與壞天氣，探討天氣好壞對股票報酬波動性是否有不對稱影響。本文實證結果顯示，天氣變數對股票報酬皆有解釋能力，其中日照時數為最有影響性的變數，而天氣與股票報酬間存在門檻效果，且波動具有不對稱效應，當消息不利時，股票報酬波動會下降。"
    },
    {
        "resulNum": "75.",
        "title": "軍用機場使用中央氣象局劇烈天氣監測系統之實證研究─整合資訊系統成功模式及科技接受模式",
        "link": "https://hdl.handle.net/11296/4gfg2a",
        "description": "本研究以資訊系統成功模式為基礎，對於使用者使用中央氣象局劇烈天氣監測系統行為意圖做調查與分析。從使用者端角度出發以該系統做為工具，探討知覺易用性、系統品質、知覺品質、知覺有用性、使用者滿意度及系統效益的關係。本研究彙整上述變數之相關文獻並做關聯性探討，針對國內使用者，以分層抽樣方式進行問券調查，共回收184份有效問卷，以SPSS統計軟體，進行樣本組成分析、敘述性統計、信度分析、效度分析、徑路分析、t檢定及變異數分析等。模式驗證如下：(1)知覺易用性對知覺有用性及使用者滿意度有顯著的正向影響；系統品質對知覺有用性及使用者滿意度有顯著的正向影響；資訊品質對知覺有用性及使用者滿意度有顯著的正向影響；知覺有用性及使用者滿意度對系統效益有顯著的正向影響；系統效益對知覺有用性有及使用者滿意度顯著的正向影響。(2)經敘述性統計分析結果顯示出知覺易用性、系統品質、知覺品質、知覺有用性、使用者滿意度、及系統效益各題項平均數及標準差。(3)差異性檢定結果顯示個人背景變數與系統品質、知覺品質、知覺有用性、使用者滿意度及系統效益無顯著相關。研究結果將可供軍方參考，使軍方於系統更新時更加完善，有效提高國軍工作效能與效率。關鍵字：中央氣象局劇烈天氣觀測系統、知覺易"
    },
    {
        "resulNum": "76.",
        "title": "天氣變化影響休閒運動意願之研究-以羽球為例",
        "link": "https://hdl.handle.net/11296/zc65dp",
        "description": "本論文探討天氣變化對於休閒運動的意願，目的在於希望這些分析的結果可以提供予相關研究領域的參考，也能夠提供休閒運動中心與有關的行業經營策略的參考，並提高其場館利用率或減少相關行業的成本與損失。此研究資料取自於地區性運動休閒中心統計資料，同時取得中央氣象局之天氣數據(雨量、溫度、風力)，並使用Hadoop、SPSS、Weka進行資料整合與分析，觀察是否能有效推論各種因素是否會影響人們參與休閒運動的意願。而線性迴歸預測、非線性迴歸預測、關聯法則探勘法、決策分析表關聯法則探勘法、貝氏分類預測法、決策樹分析預測法為本論文的主要研究方法。期待未來研究能夠考量可能更多可能的攸關因素去提升預測能力。或者提出更有效的推論方法，發掘出更多有用的推論規則去改善相關的決策品質。"
    },
    {
        "resulNum": "77.",
        "title": "雷達資料同化於多重尺度天氣系統(梅雨)的強降雨預報影響：SoWMEX IOP#8 個案研究",
        "link": "https://hdl.handle.net/11296/qa5sym",
        "description": "本研究使用Tsai et al. (2014) 開發之雷達資料同化系統(WRF-LETKF Radar Assimilation System) 同化七股及墾丁雷達資料，並提出有用的同化策略，以改善IOP#8期間的6月16日的降雨表現，探討此個案在臺灣西南至南部沿海地區所造成的持續性降雨能否藉由同化過中尺度觀測資訊的分析系集搭配WLRAS來改善梅雨個案的短期預報降水能力。梅雨季的強降雨事件富含多重尺度交互作用與地形效應，造成在定量降水預報上的困難，因此本研究使用同化過中尺度資料之分析系集做為初始場，再利用對流尺度的雷達資料同化改善對流尺度的預報，藉由結合中尺度資料同化與對流尺度資料同化來改善梅雨季的降水預報。本研究採用三種不同的初始系集進行測試，分別為：1) Yang et al. (2014) 同化過傳統氣象觀測資料、衛星觀測資料之分析系集，2) 同上設定，但沒有GPS-RO觀測資料之分析系集，及3) 將NECP GFS Final Analysis (FNL 1^°×1^° 資料) 以3DVAR的背景誤差協方差加入隨機擾動而成的系集；實驗結果說明當提供同化過中尺度觀測資訊之環境場且含有流場相依的誤差結構作為初始場有利於掌握此個案之降水分布。本研究亦測試WLRAS的同化策略，我們分別實驗同化徑向風更新模式風場、同化回波更新水氣相關變數、同化徑向風與回波更新所有模式預報變數。結果指出，僅修正風場可改善降雨的時間分布、但降雨強度與空間分布則仍有待改"
    },
    {
        "resulNum": "78.",
        "title": "水文模式結合季長期天氣展望推估鳳山溪流域地下水位變化",
        "link": "https://hdl.handle.net/11296/89ba65",
        "description": "台灣水資源的問題越發嚴重，平均年降雨量約是世界平均值的3.5倍，但國人平均分配到的年水量只有世界的1/7，再加上人口稠密、都市化效應、降雨型態改變以及地形陡峻等因素，結果造成水資源保存不易，更因為降雨集中往往造成雨季時河水暴漲以及淹水等嚴重問題，以往年的統計來看豐枯水年從19年循環逐漸變為7年循環，並且極端數據越來越多，這情況在2013年後越發明顯，而隨著降雨強度增加，更要面臨低窪地區淹水和山坡地發生土石崩落的機率增加等潛在危機，因此分析流域中水文變化情形變為很重要的課題。為此本研究選定新竹鳳山溪流域為研究區域，蒐集流域相關資料後，以GMS進行水文模式的地表地下水之網格建模，再以HEC-HMS模擬山區地表逕流，最後用水文模式WASH123D(WaterSHed Systems of 1-D Stream-River Network, 2-D Overland Regime, and 3-D Subsurface Media)進行該研究區域的校準與驗證，結果顯示模擬使用之參數適用於此流域，因此此模式可拿來做為鳳山溪流域中之後續研究使用。接著以台灣氣象局季長期氣候預報結合氣象合成模式WGEN繁衍出未來的降雨情況當作氣象參數輸入WASH123D，探討模式對於季節性預報的適用性，分析結果顯示，每個月地下水位受到前一個月的雨量影響很大，所以若季長期氣候預報之結果不準確，則模擬之結果就會出現高估或低估地下水位之情況，所以雨量預報的準確與否是影響模擬結果"
    },
    {
        "resulNum": "79.",
        "title": "結合長期天氣預報與其準確率應用於水資源水情評估探討：以石門水庫為例",
        "link": "https://hdl.handle.net/11296/98v479",
        "description": "長期天氣展望對於評估水庫水位與地表取水，用以供給民生用水、農業用水、與工業用水相當重要。傳統上水資源管理多使用逕流的氣候統計值(如: 歷史統計的水庫入流量超越機率)。然而在環境變遷的影響下，氣溫與降雨型態改變不易掌握，增加水資源管理困難度。因此，天氣與氣候預報資訊，如中央氣象局 (CWB) 所發布的天氣預報，能給予更明確的未來天氣趨勢，對於水資源管理更顯得重要。然而過往「利用天氣展望的水資源評估模式」卻無法考慮天氣預報的準確率。使決策無法應準確率調整決策。以民國 100 年乾旱事件與石門水庫水資源系統為研究案例 (案例一) 。本研究首先評估中央氣象局長期天氣預報於解除限水的效用。假設天氣展望與降雨預報的準確率相符的情境下，不同天氣預報準確率對於決策的影響。為了因應乾旱事件，當年三月一日至六月底實施第一階段限水。當長期天氣預報完全準確時，可於三月上旬決定五月中旬時解除限水；季預報命中率下降至 60$\\%$ 時，非完美短期氣候預報資訊顯示，在四月中下旬時，可望於五月中旬時解除限水。依實際中央氣象局目前月、季長期天預報能力 (40$\\%$-50$\\%$) 所假設的降雨預報情境下，仍具有提早解除限水的潛力，在本研究案例中約可提早1個月解除限水。此結果表現出：若天氣展望能反映命中率，隨著預報命中率降低，決策趨於"
    },
    {
        "resulNum": "80.",
        "title": "天氣指數型保險之綜效 以台南虱目魚為例",
        "link": "https://hdl.handle.net/11296/h9uev5",
        "description": "本研究利用1985-2015年台灣台南的虱目魚產量資料以及氣溫資料，針對虱目魚設計天氣指數型保險並檢測其有效性。我們發現HDD(Heating Degree Days)與虱目魚產量有顯著的相關性，可以做為衡量虱目魚低溫風險的指數。因此我們使用Campbell & Diebold的氣溫預測模型預測未來一年的HDD指數分配，發現此模型能有效地描述台南氣溫與氣溫波動度的季節性。由於產量的分配並非常態，因此我們用分量迴歸設計保單，並計算保單的賠付門檻值、賠付型態以及價格。最後我們設計三個情境，考量政府的保費補貼、天然災害救助金以及保險公司收取的附加保費於漁民的財富中，並以二階隨機優越法則比較不同決策，以檢測保單的避險效果。我們發現若保險公司有收取附加保費下，政府必須進行保費補貼漁民才會選擇購買保險。此外由於虱目魚產量不僅只受低溫寒害的影響，導致天氣指數型保險在避險效果上不及天然災害救助。然而，我們發現若將天氣指數型保險與天然災害救助結合，作為一個新的避險工具與天然災害救助比較時，則漁民能有更好避險效果，政府也能減少支出，且保險公司藉由開辦保險業務而有獲利的來源，這即為天氣指數型保險所產生的綜效。"
    },
    {
        "resulNum": "81.",
        "title": "經驗動態建模於季長期天氣展望與乾旱預警系統之應用-以濁水溪流域為例",
        "link": "https://hdl.handle.net/11296/e6n95j",
        "description": "台灣降雨時空分配不均，豐枯水期降雨量差距大，當枯水期降雨不足，往往會導致水資源缺乏而無法滿足供水量。近年來，受到氣候變遷影響下，旱澇事件更加頻繁地交替發生，豐枯水期差距更加懸殊，又因為工業園區的增設，導致需水量上升而更容易產生供水缺口，使得政府不得不採取限水、停灌等政策，造成龐大的經濟損失以及人民生活上的不便。為了填補氣候變遷下缺水風險的增加，勢必要訂定對應的調適策略，然而興建新興水源既花錢又曠日費時，欲解決乾旱問題所投資的成本過高。若能及早掌握未來缺水情勢，從水資源調配及管理著手，以乾旱預警系統作為調適手段，將能有效強化水資源系統之調適能力並減少乾旱風險。本研究應用中央氣象局季長期天氣展望資料，並同時以經驗動態建模(Empirical Dynamic Modeling, EDM)─Simplex projection & S-map預測方法，結合標準化降雨指標(SPI)，發展EDM季長期天氣預報方法，並以濁水溪流域為例，透過氣象合成模式(WGEN)、水文模式(GWLF)、水資源系統動力模式評估季長期的供水缺口，並建立乾旱預警系統以預測未來水資源之供需情勢，作為科技部氣候變遷調適科技整合研究計畫（TaiCCAT）氣候調適六步驟中第四步驟「界定與評估調適選項」之調適選項。研究結果顯示，以2012年至2015年間發生的乾旱事件為例，季長期天氣展望雖能合理預測降雨變化趨勢，在預測乾旱有時候會有些許高估情"
    },
    {
        "resulNum": "82.",
        "title": "自由營生阿米巴原蟲分型技術開發及其胞內菌相、毒力分析與天氣因子之探討",
        "link": "https://hdl.handle.net/11296/2bt9dt",
        "description": "自由營生阿米巴原蟲普遍存在於環境水體中，其中許多種蟲株已被證實會造成人體健康的危害，其中，棘阿米巴原蟲 (Acanthamoeba spp.) 和福氏奈格里變形蟲 (Naegleria fowleri) 與人類疾病的發生最為相關。了解環境中棘阿米巴原蟲與福氏奈格里變形蟲實際的分布型與所屬型別，對於水質管理與疾病的風險評估是至關重要的。本研究收集186個河川水庫水體樣本、26個日月潭水體樣本、144個朴子溪水體樣本、138個溫泉水體樣本以及58個醫院環境水體與生物膜樣本，透過直接濃縮法與培養法配合分子生物方式檢測環境水體中的自由營生阿米巴原蟲，並分析其所屬的型別。檢測結果發現棘阿米巴原蟲普遍存在於各種水體，甚至在醫院環境也有檢出，所有樣本之總檢出率為34.2 %，最常見的型別為genotype T4。本研究並沒有在環境中發現福氏奈格里變形蟲的存在，但其他種類的奈格里原蟲依然存在於環境中，尤其是溫泉水體，所有樣本之總檢出率為21.9 %，最常見的型別為N. australiensis。本研究建立T4、T5、T2、T3與T11型別棘阿米巴原蟲的JDP-DGGE圖譜，並成功利用JDP-DGGE圖譜將一批環境水體中的棘阿米巴原蟲分型，並證實在同一個水體樣本中確實會有多種型別之棘阿米巴原蟲存在的情況。在比較各PCR檢測方法後，發現直接濃縮法配合Modify Genotyping Nested PCR是最能有效檢視棘阿米巴原蟲在環境中實際存在狀況的方式。在胞內菌檢測部"
    },
    {
        "resulNum": "83.",
        "title": "加拿大林火天氣指標系統應用 --以台中港防風林區為例",
        "link": "https://hdl.handle.net/11296/guvjva",
        "description": "台中港防風林區火災特點，大多集中於東北季風開始之9月至翌年2月份，此段期間林區降水量低，致林區內地表枯落物乾燥，因而林區起火機率高。本研究基於每日氣象資料（氣溫、降水量、空氣相對濕度、風速），按照加拿大林火天氣指數的數值計算方法，將台中港1991～2015 年氣象資料和森林火災數據，分析林火天氣指標與林火的相關性。結果顯示，使用目標區長達25年氣象值，成功運算加拿大7種指標值，並發現林火嚴重率(DSR)從1990 年開始是持續增加中(DSR=10.48），但至近10年來卻反而降低（DSR=1.54）；另關係林區地表細小燃料FFMC，發現台中港防風林區地表引燃難易程度或引燃機率從1990-1995年(FFMC=78.76），至2010-2015年是呈現降低傾向（FFMC=74.76）現象。"
    },
    {
        "resulNum": "84.",
        "title": "天氣與地震對台灣50 ETF報酬與交易量之影響",
        "link": "https://hdl.handle.net/11296/8mun52",
        "description": "近年來，諸多研究學者已實證，環境外在因素會左右大眾的投資意願，並且交易行為人的預測會影響股價波動性與交易量，本研究根據過去相關文獻，將氣候因子之解釋變數設定為氣溫、溼度、降雨量、日照、地震的變化。被解釋變數為台灣50 ETF報酬率、台灣50 ETF交易量與台灣50 ETF交易量變動率。本文試圖找出氣候變異對台灣50 ETF報酬率與交易量之影響。在國內、外相關文獻中，各國皆發現報酬率與氣溫之間的關係多為負相關。根據本研究實證結果發現，台灣50 ETF報酬率與氣溫呈現顯著相關，且皆為負相關，符合過去相關文獻之研究結果。台灣50 ETF交易量方面與濕度呈現顯著正相關；台灣50 ETF交易量變動率與濕度在顯著水準10%下，呈現顯著負相關。"
    },
    {
        "resulNum": "85.",
        "title": "使用群集分析分類綜觀尺度天氣型態以探討台灣北部地區午後熱對流系統局部環流結構與系統發展特性",
        "link": "https://hdl.handle.net/11296/e8udhy",
        "description": "摘要午後雷陣雨又稱為對流雨以及熱雷雨，主要降水特徵為雨時短、雨區小、強度大，並且常發生在午後，為台灣北部地區夏季主要降水來源之一。本研究主要目的為使用群集分析進行綜觀尺度天氣形態分類，藉以探討台灣北部地區午後雷陣雨氣象特性。群集分析所使用之觀測資料，包含台灣北部地區2013年到2015年夏季(7、8及9月份)氣象局地面測站觀測資料，選取的氣象參數包含溫度、濕度、風速、風向、氣壓、降雨量以及比濕。研究方法，首先將這些氣象變數進行不同的組合，並進一步將每種組合的分類結果進行分析，找出各群集的特性，並在每個群集內製作降雨時序圖比對，再找出所有組合的最佳分類，最後進行分析與討論，以上方法可以找出午後雷陣雨和綜觀天氣型態的關係；而後將上述觀測資料重新篩選，單純挑選發生午後雷陣雨的事件，再重新進行群集分析，並與前一個群集分析分類結果進行比對。首先，使用風速和風向觀測資料進行群集分析，分類結果顯示北部地區夏季主要盛行風場為西南、東南以及東北風，主要降雨集中在東北風、西北西風以及東南風這三個群集內。東北風的降雨主要由三種類型的天氣型態所組成，分別為颱風、冷鋒鋒面以及冷高壓所產生的東北風。西北西風和東南風相關的群集，則是包含數個颱風個案，因此降雨量較高。若於群集分"
    },
    {
        "resulNum": "86.",
        "title": "天氣對於皮膚病之相關性研究",
        "link": "https://hdl.handle.net/11296/2tfs4z",
        "description": "皮膚病雖然大多數為非急性疾病，但卻對於患者的生活有很大的影響，因此若能及早發現或預防，將可以較有效避免或減緩皮膚病的帶來的傷害。隨著資訊科技的發展，健保局的資料庫也逐漸完整記錄台灣民眾的診療明細，本研究想要透過資料分析方法，結合健保資料的大量數據，找出從前多數僅在臨床醫學觀察，卻缺乏大量數據證實與罹患皮膚病有關聯的相關因子。皮膚為接觸外界首當其衝的器官，因此外界天氣與天氣的變化被認為是影響許多皮膚病生成與惡化的因素。其中，多數的醫生認為酒糟性皮膚炎的生成可能受到天氣因子影響，例如溫度變化、紫外線照射等。因此，本研究的目的為針對台灣的患者探討天氣對於酒糟性皮膚炎的影響。本研究資料包含台灣健保資料庫與行政院環保署的空氣汙染監測資料，在2000-2010年間共有263675筆病例，102053名病患。統計分析了解病患特徵: 罹患酒糟性皮膚炎機率最高的族群為21-30歲的女性；春季(3-5月)罹患此疾病的病例數最多。研究的結果發現天氣與天氣的變化確實與酒糟性皮膚炎有所關聯，複回歸分析所建立的天氣因子回歸模型對於酒糟性皮膚炎病例數有達到近七成的解釋力(R^2=0.68)，其中最重要天氣因子為一氧化碳濃度、濕度以及紫外線指數。而天氣變化因子的複回歸模型最高的r-square可達0.66，影響力最大的指標為二氧"
    },
    {
        "resulNum": "87.",
        "title": "結合季長期天氣展望發展乾旱預警與支援決策系統",
        "link": "https://hdl.handle.net/11296/y2bgsg",
        "description": "台灣的降雨時間分布不均，乾濕季分明，在乾季若降雨不如預期，時常會導致水庫蓄水量不足，進而促使政府宣布限水。近年來，在氣候變遷的影響下，極端氣候事件頻頻發生，豐枯水期的雨量差異更為懸殊，再加上工業區的發展與擴建，導致需水量上升與缺水情況惡化。若枯水期的水情不佳時，往往會造成顯著的經濟損失。由於興建水庫等水資源設施需要時間規劃與建造，無法短時間內對現況與未來的乾旱風險進行調適，而非結構性與相對較彈性的乾旱預警與風險管理是一個有效的調適手段。過去政府進行乾旱預警時，僅以歷史的低流量進行未來水庫蓄水量之推估，做為乾旱決策之依據，並沒有一個可以利用氣候預報推估未來水情的工具。本研究利用中央氣象局季長期天氣展望之預報資料，透過氣象合成模式(WGEN)、水文模式(GWLF)、水資源系統動力模式與乾旱決策模型，建立結合季長期天氣展望之乾旱預警與支援決策系統，並以此乾旱預警與支援決策系統做為調適手段，以因應乾旱的來臨提早做出決策，降低乾旱之風險。本研究以新竹地區為例，參考科技部氣候變遷調適科技整合研究計畫（TaiCCAT）氣候調適六步驟，執行步驟一至步驟四，從界定問題與設定目標、評估與分析現況風險、評估與分析未來風險、界定與評估調適選項，再以乾旱預警與支援決策系統做為調適選項，評估此支援"
    },
    {
        "resulNum": "88.",
        "title": "基於改進的趨勢分類模型運用於天氣預測",
        "link": "https://hdl.handle.net/11296/vnupy2",
        "description": "此研究貢獻在於提出一個有別於傳統技術的趨勢分類模型的新型天氣預報：運用溫度歷史資料於未來溫度預測，以台北為例。由於考慮的數據量是很巨大的，所提出的方法也可以被視為大數據資料分析，即為：使用數據分析解決大量數據。方法是運用溫度的歷史資料作為資料庫並透過資料分析、建模來預測氣溫。通常，每日溫度以區間間隔於建模，因此，在此研究的方法中，上限和下限（通常表示當日最高溫、最低溫）是被考慮用於匹配／預測，而趨勢分類是提供一個層次分類結構的模型，先使用溫差趨勢概念再整合傳統分類方法，使此模型能將匹配點更具意義，而基於這模式，將可使溫度預測模型成功被使用。而在趨勢分類模型中，更考量重疊的概念以及數據相關的對應關係，使模式匹配更有意義。並在趨勢分類後，使用聚類方法來定義所匹配的模式。考慮重疊的想法與簡潔，本研究使用上限與下限做為資料的區隔，更以上限及下限表示一天的溫度型態。本研究的方法是在進行模糊分類之前先做趨勢分析，而溫度的劇烈變化也被考慮並且在模式定義過程中被視為異常值以避免模式誤差過大。在處理數據時，透過不同模式將資料型態做分別不同的處理方式。從實驗結果得知，透過此研究的方法在預測一天中的最高溫度之平均誤差與新聞預測(中央氣象局預測)相比，平均誤差至少"
    },
    {
        "resulNum": "89.",
        "title": "天氣指數型保險─以臺灣烏魚為例",
        "link": "https://hdl.handle.net/11296/pb8nv6",
        "description": "在氣候變遷下，極端天氣出現的頻率和強度增加，對漁業也容易造成極大的損失。舉例來說，2009年莫拉克風災為臺灣南部帶來滂沱大雨，導致41億漁業損失；2011年一月的低溫寒害也帶來25億漁業損失；2016年一月連續低溫寒害更造成32億的損失。因此，本研究提出以天氣指數型保險管理養殖漁業所面臨的天氣風險，並以臺灣常見的高經濟價值魚類─烏魚為示範研究案例。本研究範圍鎖定影響烏魚產量最主要的兩個天氣因子─颱風和寒害，研究區域以烏魚主要產地之一的臺南市為樣本，研究時間為1996年到2014年。資料來源主要為行政院農業委員會漁業統計年報、中央氣象局颱風資料庫和颱風洪水研究中心大氣水文資料庫。本研究首先利用Locally Weighted Regression Model將烏魚產量資料去趨勢化，並根據天氣資料和烏魚生長特性設計影響烏魚產量的天氣指數，接著利用迴歸分析找出產量和天氣指數的關聯性。研究結果發現颱風和寒害對於烏魚產量均有顯著的影響，其中以颱風的風災所帶來的影響最大。之後再進一步以常態分配和對數常態分配對天氣指數進行模擬，利用蒙地卡羅分析設計出以10% 理賠機率的指數型保險，並以純保費法進行評價，計算保險產品的純保費。"
    },
    {
        "resulNum": "90.",
        "title": "天氣衍生性金融商品─以臺灣電力公司為例",
        "link": "https://hdl.handle.net/11296/73b8bk",
        "description": "台灣電力公司是台灣最大的電力公司，隨著台灣夏季溫度越來越高，使台灣電力供應出現吃緊的狀況，根據聯合新聞網於2015年的報導，台電在2015年7月2日因氣候異常高溫，使機組過熱而故障，導致當天備轉容量率僅剩1.9% 面臨限電危機。因此，在氣候變遷下，氣候異常現象頻率增加、且不易預測，使電力需求量不易估算，將造成電力供給方較難以估計精確的原物料需求量與安排完善的系統規劃，容易造成電量供給不穩定；若一旦限電危機發生時，為了提供足夠的燃料與完善的系統機組讓台電得以製電與發電，進而穩定供應民眾電力，台電須花費更多成本在現貨市場購買價格可能較燃料契約價格更高的現貨燃料，以及因機組過熱故障的機組檢修費用，勢必造成台電營運現金流的不穩。低溫指數 (Cooling Degree Day, CDD) 為一衡量高溫程度之溫度指數，在金融市場上有以CDD為標的的期貨與選擇權商品，其中CDD選擇權為最符合台電所面對之天氣風險狀況的避險商品，但台灣尚未推出天氣相關衍生性金融商品，故本研究欲設計一台電適用之台灣夏季低溫指數選擇權，並以燃燒分析法 (Burn Analysis)以及進一步考慮未來溫度變化的方法，評定其權利金價格。期望本研究可不僅提供天氣相關風險予台電做為決策參考，亦可作為其他企業於天氣風險上的決策參考，促進企業關注天氣衍生性金融商品市場，並期能活絡天"
    },
    {
        "resulNum": "91.",
        "title": "天氣型態對雲林地區細懸浮微粒濃度與組成之影響",
        "link": "https://hdl.handle.net/11296/45t8s2",
        "description": "本研究分析雲林縣麥寮與斗六地區 PM2.5之時空分佈及天氣型態對PM2.5濃度及組成之影響，於2013-2015共計執行11次人工採樣並分析其化學組成(陰陽離子、EC、OC)，另進行11次陰陽離子之逐時現址監測。利用風速風向之小時變化判別傳輸與滯留型態，並利用天氣圖來判定14種天氣型態。結果發現滯留型態較傳輸型態更易發生PM2.5事件日(≧35μg/m3) ，而在14種天氣型態中又以高壓迴流其事件日發生比率為最高，在麥寮與斗六兩地區分別為42%及67%。PM2.5組成分中之SNA(硫酸鹽、硝酸鹽、銨鹽)佔約29~43%，滯留型態高於傳輸型態。硝酸鹽與銨鹽濃度在14種天氣型態中以高壓迴流為最高，而硫酸鹽濃度則於西南氣流時最高。傳輸型態其PM2.5濃度較對照組(<20μg/m3且該日均溫低於20℃)高出2.3倍左右，滯留型態較對照組高出約3倍，而高壓迴流則較對照組高出近4倍。在組成分之比較上，硝酸鹽及銨鹽於高壓迴流時其相較於對照組之倍率為最高，而硫酸鹽則於西南氣流時為最高。由逐時監測之數據，發現硝酸鹽在滯留型天氣型態下，其每日最大升幅(每日最高濃度與最低濃度差異之幅度)為SNA三種鹽類中最高。計算銨過量之結果，發現滯留型態較傳輸型態有更多之過量銨，而在14種天氣型態中又以高壓迴流最高，而以西南氣流為最低。此外，發現當氣膠酸度較高其NR值低於0.7時，扣除硝"
    },
    {
        "resulNum": "92.",
        "title": "一個基於深度學習的動態資料驅動應用系統-以天氣預測為例",
        "link": "https://hdl.handle.net/11296/6ug647",
        "description": "隨著巨量資料趨勢崛起，數量龐大、種類繁多、且具即時性的動態資料日益增加，在資料快速變動的環境中，要達到準確且有效率的資訊預測與評估，成為一個相當困難的挑戰。深度學習是一個新興的特徵類機器學習方法，以多層次類神經網路的方式進行處理，透過抽象層的特徵表示來化簡維度。但是使用深度學習方法時，常會有輸入資料維度過於龐大、無法在動態環境中執行等問題。在本研究中，將深入探討如何應用動態資料驅動的概念，從大量且不同組合所產生的時間序列資料中，找到各種資料與預測目標之間的關聯性，利用關聯分析(Association Analysis)、序列分析(Sequence Analysis)、深度學習(Deep Learning)等方法來設計一個基於深度學習的動態資料驅動應用系統。本研究將以氣象資料為例，相較於先前的研究，此系統的平均預測錯誤率改進了87%。"
    },
    {
        "resulNum": "93.",
        "title": "天氣變化對零售業銷售業績之影響─以新北市深坑區農會生鮮超市為例",
        "link": "https://hdl.handle.net/11296/kv22nm",
        "description": "天氣因素在整體經濟環境中扮演著重要角色，其不僅影響商業活動及農產品之供應，對零售業銷售狀況及消費者購買行為亦有所影響。本研究探討天氣因素對零售業銷售業績與對消費者購買行為之影響，實證分析以新北市深坑區農會生鮮超市之營業據數統計資料為主，並將農會超市促銷活動、颱風來襲警報及周休假日等可能影響消費者購買行為之因素列為控制變數，同時探討消費者在控制其他影響因素後，天氣變化是否影響超市營業業績變化與消費者購買行為。藉此實證分析零售市場受天氣變數影響之關連性及程度，研究結果可提供零售業者參考便於掌握消費者各項需求，亦期能提供予相關業者未來經營零售業及顧客服務之方向與建議。本文之實證分析結果指出，天氣變化對農會超市銷售業績及消費者購買行為有顯著影響，主要研究發現摘要如下：除了「最大風速」變化不會影響農會超市銷售業績外，其他四個天氣變數「平均日溫」、「降雨量」、「紫外線指數」及「酷熱指數」均會對農會超市之銷售業績造成不同程度之影響。在天氣變數中以「降雨量」對農會超市之總體業額及各類商品部門銷售均呈現負向顯著影響，此結果顯示下雨天會導致農會超市銷售業績明顯下降。另外，「颱風來襲」、「促銷檔期」、「周休假期」等外部因子也均會對農會"
    },
    {
        "resulNum": "94.",
        "title": "天氣預報模式與風能統計分析在風場開發之應用",
        "link": "https://hdl.handle.net/11296/74jd5x",
        "description": "近年來，離岸風能於再生能源中扮演舉足輕重的角色。開發離岸風場時，兩種區域性的風能評估(WRA) 是不可或缺的: 1. 實測資料風能統計分析，2. 數值天氣預報(NWP)之風能模擬。另一方面，為了產生較多電能，風機體積隨之增大，更多的動量從大氣中被截取，這意味大型風機對大氣邊界層、環境之影響將更為顯著。因此，離岸風場對大氣環境的影響需被重視。基於以上，本研究以大氣研究軟體(WRF 模式) 之模擬，與福海氣象塔實測資料比對，詮釋台灣彰化離岸風能，並結合工程觀點探討其風場開發。考量風場運作，本研究利用Fitch 等人提出的風機參數化模型，進行福海風力發電股份有限公司於彰濱外海預訂30 台SWT-4.0-120 風機(第一、二期) 之風場模擬。經模擬後，發現風場後方有相當顯著、最大損失2(m/s) 的風場尾流。為了驗證其結果，本研究以一維動量理論做基本驗證，並進一步探討尾流特徵與尾流擾動等特性。此外，藉由Jensen 單一風機尾流模型構想，推廣出改良式尾流模型，以對風場開發進行初步的尾流評估。比較模型與模擬之尾流中心線速度恢復，發現風場的尾流衰變常數(wake decay constant) 與單一風機有相當程度的關聯性，間接證明了風場尾流能以單一風機來比擬。除了數值模擬，本文亦利用實測的冬季(10/7 ~ 11/7, 2015) 與夏季(5 月, 2016) 一個月風資料，依據國際規範IEC 61400 所制定的準則，以客觀角度評估台灣"
    },
    {
        "resulNum": "95.",
        "title": "邏輯回歸及二因子時間模糊序列模式用以預測天氣",
        "link": "https://hdl.handle.net/11296/jwy725",
        "description": "本研究提出了一個新的氣溫預測方法，該方法將學習的方法加入到了[1]中所提出的二因子時間模糊序列的模型中，並利用氣溫值以及雲密度做為該方法中的兩個因子。本研究假設了現在的天氣與過去的天氣有一定的相似關係，若在此情況下，加入過去的歷史資料進行學習，有助於提升預測的正確率。在模糊時間序列的模型提出以後，許多研究者以此為基礎提出新的模型，並應用在各個不同的領域上，而模糊時間序列的預測模型，主要的步驟可以分成論域的定義及切割、模糊集合的定義、建立模糊邏輯關係和解模糊化。本研究結合了模糊時間序列以及一個監督式學習的分類方法，邏輯斯回歸，此方法先從歷史資料中得出模糊邏輯關係，再將模糊邏輯關係做為訓練集合，利用此訓練集合及邏輯斯回歸分類方法建立一個分類器模型。而在本研究中，邏輯斯回歸的方法將與學習式向量量化法以及在[1]中的方法進行比較，比較過後，邏輯斯回歸方法可得到較好的正確率及穩定性。"
    },
    {
        "resulNum": "96.",
        "title": "天氣變化對不同類型投資者處置效果影響：以台灣期貨市場為例",
        "link": "https://hdl.handle.net/11296/4zfdza",
        "description": "有許多研究指出天氣影響投資者的情緒與風險態度，進而影響其行為與決策。因此，探討天氣變化如何影響風險偏好，進而影響不同類型投資者處置效果是本研究的主軸。在這篇文章中，我們探討兩個假設。首先，我們檢測不同類型投資者是否存在不同程度的處置效果。接著，我們檢測天氣如何影響不同類型投資者的處置效果。我們使用台灣期貨交易所的資料進行分析，並發現國內法人及國內散戶有顯著的處置效果，且相較於國內法人，國內散戶有較強的處置效果。另外，我們發現溫度和國內法人及國內散戶的處置效果有正向關聯；降雨量和國外法人的處置效果有正向關聯；日照程度和國內散戶的處置效果有正向關聯。實驗結果顯示天氣影響不同類型投資者的處置效果。"
    },
    {
        "resulNum": "97.",
        "title": "基於iOS之行人辨識及天氣資料圖形介面",
        "link": "https://hdl.handle.net/11296/9cqpub",
        "description": "近年來，行人偵測以及臉部辨識的技術快速發展，其中行人偵測的部分尚有很大的發展空間。行人偵測可以應用在車輛行駛輔助系統或是監控系統中，透過行動裝置的鏡頭所擷取的影像加以辨識行人，然而，行人偵測的正確率以及執行速度也是很重要的一部分，故本研究提出了一個運行在iOS系統的行人辨識系統，將行人偵測之功能應用於行動裝置上。本研究將探討OpenCV的HOG行人辨識方法運行在iOS系統上的準確率以及執行速度，並設法改善其效果。透過HOG方法將影像灰階化、直方圖均等化(Histogram Normalized)、劃分計算區域、計算梯度，取得特徵向量後，用SVM分類器做分類，然後跟已經訓練好的INRIA資料庫做比較，進一步判斷出是否為行人以及標記出行人所在位置。再加入感興趣區域(Regions of Interest)來降低運算量，如此便可以達到提升執行速率的效果，最後對本實驗結果的執行速度及行人偵測準確率作分析。另一方面，天氣資料應用在行動裝置上的研究也是近年來發展迅速的一項題目，而app store也已經上架了許多有關氣象資訊的應用程式。本研究提出了一個天氣資料的圖形介面，讓我們可以透過URL來獲取中央氣象局所提供的天氣資料，並且將這些氣象資訊展示給使用者作瀏覽。除此之外，本系統還會將獲取到的天氣資料作存取，製作成為一個天氣資料的資料庫。利用Mac OS裡的Core Data將數據儲存為XML"
    },
    {
        "resulNum": "98.",
        "title": "天氣效果對台灣、日本與香港股票市場報酬與波動之影響—日內資料之實證分析",
        "link": "https://hdl.handle.net/11296/kk9q6y",
        "description": "過去許多文獻都指出天氣因素將會促使人們從事特定行為，同時也發現日照、溫度、濕度這三種因素對人們的心理層面影響最大(Howarth and Hoffman,1984)，然而過去部分實證結果並未考慮市場態勢對投資人之影響(Trombley, 1997; Jacobsen and Marquering, 2008; Lu and Chou, 2012)，因此本文將使用日照、溫度和濕度等天氣變數來檢測極端天氣因素對股價報酬的影響，其樣本資料為2010~2014五分鐘台灣加權股價指數日內資料，並以GJR-GARCH模型來試圖捕捉波動不對稱之現象，此外，股票市場的波動受到相當多的經濟因素所影響，故本文加入市場態勢條件，使天氣效果能夠充分被表現，最後，本文研究結果補足以往相關文獻，並可供市場參與者作為投資之參考依據。"
    },
    {
        "resulNum": "99.",
        "title": "劇烈天氣下土石流災害緊急應變措施 精進作為之研究 -以新店區蘇迪勒颱風災情為例",
        "link": "https://hdl.handle.net/11296/wr7gp9",
        "description": "近年來全球暖化造成氣候變遷，各種前所未有的惡劣氣候及災害接踵而至，台灣災害性的劇烈天氣發生頻傳，最常見的就是颱風及豪雨。根據氣象局資料顯示，近20年來，台灣地區氣象災害以颱風災害占85％，豪雨占11％最多。每年財物損失平均高達新臺幣約170億元。每當颱風來臨時，常伴隨土石流及洪水等複合性災害。根據世界銀行2005年所出版的年鑑報告指出，臺灣為颱風、淹水、地震、土石流四種天然災害覆蓋率風險最高之國家，是全世界發生天然災害最頻繁的地區！顯見天然災害發生時，如何整備、應變、減災、災後復原重建規劃實在是國人必須正視的議題。本研究彙整2000-2016年資料，針對天然災害整備、應變、減災、災後復原重建規劃，分別導入平衡計分卡「財務面」、「顧客面」、「內部流程面」及「學習與成長面」四大構面衡量指標，萃取統計分析結果，以建立劇烈天氣下土石流災害緊急應變措施精進作為之研究策略。研究結果顯示「顧客面」是以「強化應變單位救災無線電通話之韌性及頻道擴充」最為重要佔95.0％，可能與現階段搶救災時，通訊設備仍有不足與人口普查仍未盡落實有關。至於「建立現場通訊支援小組(協調電信業者協助)」及「確保救災現場統一指揮體系、快速決策及有效分工」兩項佔91.0％。「財務面」顯示民眾仍期待政府增加編列災"
    },
    {
        "resulNum": "100.",
        "title": "天氣、路線及性別對駕駛主客觀心智負荷之影響",
        "link": "https://hdl.handle.net/11296/6kr658",
        "description": "　　全球十大死亡原因之一為道路交通傷害，在2012年全球因此死亡高達130萬人。而人們每天接觸的所有系統當中，道路交通體系是最為複雜和危險的，而世界衛生組織之全球道路安全現狀報告（2015）提到每年約有125萬人死於道路交通事故，並發現汽車造成之事故死亡率相較於其他交通工具之比例較高；而台灣從2011至2015年來因交通事故死亡人數平均約2000人。　　本研究為探討駕駛於不同天氣下，了解有無道路狀況時之生理反應、心智負荷及駕駛績效的影響，其情境內容是利用多重資源理論之輸入模態(input modalities)、視覺頻道（Visual Channels）及情境知覺之區域場景知覺，藉由兩個理論來了解有無道路狀況來是否對於駕駛分心有影響。實驗共招募44名受測者， 自變數為天氣（晴天白天、晴天晚上、雨天白天、雨天晚上）、路線（簡單路線、複雜路線）及性別（男性、女性），來量測駕駛績效（完成時間）、心搏率（Heart Rate，HR）、心率變異性（Heart Rate Variability，HRV）與主觀評量（NASA-TLX）。　　實驗結果發現在天氣狀況不佳（晚上、雨天），能見度低，容易造成視覺分心，需比平常駕駛時更加集中注意力，故交感神經（SDNN、LF）活性較大，副交感神經（R-MSSD、PNN50、HF）活性較小活性較小，駕駛績效時間較差，主觀評量（NASA-TLX）之心智需求與時間需求較為顯著；在路線複雜時，由於突發狀況（路障、行人穿越等）較多，使駕駛開車同時須注意突發狀況，使得注意力分散"
    }
]